
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: CoreUObject
/// dependency: Engine

#pragma pack(push, 0x1)

/// Class /Game/Art/BP/KMC/BP_KMC_MultipleSelection.BP_KMC_MultipleSelection_C
/// Size: 0x0360 (864 bytes) (0x000220 - 0x000360) align 8 MaxSize: 0x0360
class ABP_KMC_MultipleSelection_C : public AActor
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0220   (0x0008)  
	class UStaticMeshComponent*                        StaticMesh;                                                 // 0x0228   (0x0008)  
	class UParticleSystemComponent*                    ParticleSystem;                                             // 0x0230   (0x0008)  
	class UStaticMeshComponent*                        Y7;                                                         // 0x0238   (0x0008)  
	class UStaticMeshComponent*                        Z7;                                                         // 0x0240   (0x0008)  
	class UStaticMeshComponent*                        X7;                                                         // 0x0248   (0x0008)  
	class UArrowComponent*                             _7YZ;                                                       // 0x0250   (0x0008)  
	class UStaticMeshComponent*                        X6;                                                         // 0x0258   (0x0008)  
	class UStaticMeshComponent*                        Z6;                                                         // 0x0260   (0x0008)  
	class UStaticMeshComponent*                        Y6;                                                         // 0x0268   (0x0008)  
	class UArrowComponent*                             _6XYZ;                                                      // 0x0270   (0x0008)  
	class UStaticMeshComponent*                        Z5;                                                         // 0x0278   (0x0008)  
	class UStaticMeshComponent*                        Y5;                                                         // 0x0280   (0x0008)  
	class UStaticMeshComponent*                        X5;                                                         // 0x0288   (0x0008)  
	class UArrowComponent*                             _5XZ;                                                       // 0x0290   (0x0008)  
	class UStaticMeshComponent*                        Z4;                                                         // 0x0298   (0x0008)  
	class UStaticMeshComponent*                        X4;                                                         // 0x02A0   (0x0008)  
	class UStaticMeshComponent*                        Y4;                                                         // 0x02A8   (0x0008)  
	class UArrowComponent*                             _4Z;                                                        // 0x02B0   (0x0008)  
	class UStaticMeshComponent*                        X3;                                                         // 0x02B8   (0x0008)  
	class UStaticMeshComponent*                        Z3;                                                         // 0x02C0   (0x0008)  
	class UStaticMeshComponent*                        Y3;                                                         // 0x02C8   (0x0008)  
	class UArrowComponent*                             _3XY;                                                       // 0x02D0   (0x0008)  
	class UStaticMeshComponent*                        Y2;                                                         // 0x02D8   (0x0008)  
	class UStaticMeshComponent*                        Z2;                                                         // 0x02E0   (0x0008)  
	class UStaticMeshComponent*                        X2;                                                         // 0x02E8   (0x0008)  
	class UArrowComponent*                             _2Y;                                                        // 0x02F0   (0x0008)  
	class UStaticMeshComponent*                        Z1;                                                         // 0x02F8   (0x0008)  
	class UStaticMeshComponent*                        Y1;                                                         // 0x0300   (0x0008)  
	class UStaticMeshComponent*                        X1;                                                         // 0x0308   (0x0008)  
	class UArrowComponent*                             _1X;                                                        // 0x0310   (0x0008)  
	class UStaticMeshComponent*                        Z;                                                          // 0x0318   (0x0008)  
	class UStaticMeshComponent*                        X;                                                          // 0x0320   (0x0008)  
	class UStaticMeshComponent*                        Y;                                                          // 0x0328   (0x0008)  
	class UArrowComponent*                             _0Corner;                                                   // 0x0330   (0x0008)  
	class USceneComponent*                             DefaultSceneRoot;                                           // 0x0338   (0x0008)  
	float                                              X_Size;                                                     // 0x0340   (0x0004)  
	float                                              Y_Size;                                                     // 0x0344   (0x0004)  
	float                                              Z_Size;                                                     // 0x0348   (0x0004)  
	float                                              ScaleDivider;                                               // 0x034C   (0x0004)  
	float                                              ScaleMultiplier;                                            // 0x0350   (0x0004)  
	float                                              _X_Size;                                                    // 0x0354   (0x0004)  
	float                                              _Y_Size;                                                    // 0x0358   (0x0004)  
	float                                              _Z_Size;                                                    // 0x035C   (0x0004)  


	/// Functions
	// Function /Game/Art/BP/KMC/BP_KMC_MultipleSelection.BP_KMC_MultipleSelection_C.ReceiveTick
	// void ReceiveTick(float DeltaSeconds);                                                                                    // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/Art/BP/KMC/BP_KMC_MultipleSelection.BP_KMC_MultipleSelection_C.ExecuteUbergraph_BP_KMC_MultipleSelection
	// void ExecuteUbergraph_BP_KMC_MultipleSelection(int32_t EntryPoint);                                                      // [0x18d2100] Final                
};

#pragma pack(pop)


static_assert(sizeof(ABP_KMC_MultipleSelection_C) == 0x0360); // 864 bytes (0x000220 - 0x000360)
static_assert(offsetof(ABP_KMC_MultipleSelection_C, UberGraphFrame) == 0x0220);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, StaticMesh) == 0x0228);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, ParticleSystem) == 0x0230);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y7) == 0x0238);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z7) == 0x0240);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X7) == 0x0248);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _7YZ) == 0x0250);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X6) == 0x0258);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z6) == 0x0260);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y6) == 0x0268);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _6XYZ) == 0x0270);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z5) == 0x0278);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y5) == 0x0280);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X5) == 0x0288);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _5XZ) == 0x0290);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z4) == 0x0298);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X4) == 0x02A0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y4) == 0x02A8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _4Z) == 0x02B0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X3) == 0x02B8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z3) == 0x02C0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y3) == 0x02C8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _3XY) == 0x02D0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y2) == 0x02D8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z2) == 0x02E0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X2) == 0x02E8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _2Y) == 0x02F0);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z1) == 0x02F8);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y1) == 0x0300);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X1) == 0x0308);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _1X) == 0x0310);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Z) == 0x0318);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, X) == 0x0320);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, Y) == 0x0328);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, _0Corner) == 0x0330);
static_assert(offsetof(ABP_KMC_MultipleSelection_C, DefaultSceneRoot) == 0x0338);
