
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: UMG

#pragma pack(push, 0x1)

/// Enum /Script/CohtmlPlugin.ECohtmlKeys
/// Size: 0x01 (1 bytes)
enum class ECohtmlKeys : uint8_t
{
	ECohtmlKeys__LeftMouseButton                                                     = 0,
	ECohtmlKeys__RightMouseButton                                                    = 1,
	ECohtmlKeys__MiddleMouseButton                                                   = 2,
	ECohtmlKeys__ThumbMouseButton                                                    = 3,
	ECohtmlKeys__ThumbMouseButton2                                                   = 4,
	ECohtmlKeys__BackSpace                                                           = 5,
	ECohtmlKeys__Tab                                                                 = 6,
	ECohtmlKeys__Enter                                                               = 7,
	ECohtmlKeys__Pause                                                               = 8,
	ECohtmlKeys__CapsLock                                                            = 9,
	ECohtmlKeys__Escape                                                              = 10,
	ECohtmlKeys__SpaceBar                                                            = 11,
	ECohtmlKeys__PageUp                                                              = 12,
	ECohtmlKeys__PageDown                                                            = 13,
	ECohtmlKeys__End                                                                 = 14,
	ECohtmlKeys__Home                                                                = 15,
	ECohtmlKeys__Left                                                                = 16,
	ECohtmlKeys__Up                                                                  = 17,
	ECohtmlKeys__Right                                                               = 18,
	ECohtmlKeys__Down                                                                = 19,
	ECohtmlKeys__Insert                                                              = 20,
	ECohtmlKeys__Delete                                                              = 21,
	ECohtmlKeys__Zero                                                                = 22,
	ECohtmlKeys__One                                                                 = 23,
	ECohtmlKeys__Two                                                                 = 24,
	ECohtmlKeys__Three                                                               = 25,
	ECohtmlKeys__Four                                                                = 26,
	ECohtmlKeys__Five                                                                = 27,
	ECohtmlKeys__Six                                                                 = 28,
	ECohtmlKeys__Seven                                                               = 29,
	ECohtmlKeys__Eight                                                               = 30,
	ECohtmlKeys__Nine                                                                = 31,
	ECohtmlKeys__A                                                                   = 32,
	ECohtmlKeys__B                                                                   = 33,
	ECohtmlKeys__C                                                                   = 34,
	ECohtmlKeys__D                                                                   = 35,
	ECohtmlKeys__E                                                                   = 36,
	ECohtmlKeys__F                                                                   = 37,
	ECohtmlKeys__G                                                                   = 38,
	ECohtmlKeys__H                                                                   = 39,
	ECohtmlKeys__I                                                                   = 40,
	ECohtmlKeys__J                                                                   = 41,
	ECohtmlKeys__K                                                                   = 42,
	ECohtmlKeys__L                                                                   = 43,
	ECohtmlKeys__M                                                                   = 44,
	ECohtmlKeys__N                                                                   = 45,
	ECohtmlKeys__O                                                                   = 46,
	ECohtmlKeys__P                                                                   = 47,
	ECohtmlKeys__Q                                                                   = 48,
	ECohtmlKeys__R                                                                   = 49,
	ECohtmlKeys__S                                                                   = 50,
	ECohtmlKeys__T                                                                   = 51,
	ECohtmlKeys__U                                                                   = 52,
	ECohtmlKeys__V                                                                   = 53,
	ECohtmlKeys__W                                                                   = 54,
	ECohtmlKeys__X                                                                   = 55,
	ECohtmlKeys__Y                                                                   = 56,
	ECohtmlKeys__Z                                                                   = 57,
	ECohtmlKeys__NumPadZero                                                          = 58,
	ECohtmlKeys__NumPadOne                                                           = 59,
	ECohtmlKeys__NumPadTwo                                                           = 60,
	ECohtmlKeys__NumPadThree                                                         = 61,
	ECohtmlKeys__NumPadFour                                                          = 62,
	ECohtmlKeys__NumPadFive                                                          = 63,
	ECohtmlKeys__NumPadSix                                                           = 64,
	ECohtmlKeys__NumPadSeven                                                         = 65,
	ECohtmlKeys__NumPadEight                                                         = 66,
	ECohtmlKeys__NumPadNine                                                          = 67,
	ECohtmlKeys__Multiply                                                            = 68,
	ECohtmlKeys__Add                                                                 = 69,
	ECohtmlKeys__Subtract                                                            = 70,
	ECohtmlKeys__Decimal                                                             = 71,
	ECohtmlKeys__Divide                                                              = 72,
	ECohtmlKeys__F1                                                                  = 73,
	ECohtmlKeys__F2                                                                  = 74,
	ECohtmlKeys__F3                                                                  = 75,
	ECohtmlKeys__F4                                                                  = 76,
	ECohtmlKeys__F5                                                                  = 77,
	ECohtmlKeys__F6                                                                  = 78,
	ECohtmlKeys__F7                                                                  = 79,
	ECohtmlKeys__F8                                                                  = 80,
	ECohtmlKeys__F9                                                                  = 81,
	ECohtmlKeys__F10                                                                 = 82,
	ECohtmlKeys__F11                                                                 = 83,
	ECohtmlKeys__F12                                                                 = 84,
	ECohtmlKeys__NumLock                                                             = 85,
	ECohtmlKeys__ScrollLock                                                          = 86,
	ECohtmlKeys__LeftShift                                                           = 87,
	ECohtmlKeys__RightShift                                                          = 88,
	ECohtmlKeys__LeftControl                                                         = 89,
	ECohtmlKeys__RightControl                                                        = 90,
	ECohtmlKeys__LeftAlt                                                             = 91,
	ECohtmlKeys__RightAlt                                                            = 92,
	ECohtmlKeys__LeftCommand                                                         = 93,
	ECohtmlKeys__RightCommand                                                        = 94,
	ECohtmlKeys__Semicolon                                                           = 95,
	ECohtmlKeys__Equals                                                              = 96,
	ECohtmlKeys__Comma                                                               = 97,
	ECohtmlKeys__Underscore                                                          = 98,
	ECohtmlKeys__Period                                                              = 99,
	ECohtmlKeys__Slash                                                               = 100,
	ECohtmlKeys__Tilde                                                               = 101,
	ECohtmlKeys__LeftBracket                                                         = 102,
	ECohtmlKeys__Backslash                                                           = 103,
	ECohtmlKeys__RightBracket                                                        = 104,
	ECohtmlKeys__Quote                                                               = 105,
	ECohtmlKeys__Unknown                                                             = 106
};

/// Enum /Script/CohtmlPlugin.ECohtmlInputWidgetRaycastQuality
/// Size: 0x01 (1 bytes)
enum class ECohtmlInputWidgetRaycastQuality : uint8_t
{
	CohtmlRaycastQuality_Fast                                                        = 0,
	CohtmlRaycastQuality_Balanced                                                    = 1,
	CohtmlRaycastQuality_Accurate                                                    = 2
};

/// Enum /Script/CohtmlPlugin.ECohtmlInputWidgetLineTraceMode
/// Size: 0x01 (1 bytes)
enum class ECohtmlInputWidgetLineTraceMode : uint8_t
{
	CohtmlInputLineTrace_Single                                                      = 0,
	CohtmlInputLineTrace_Multi                                                       = 1
};

/// Enum /Script/CohtmlPlugin.ECohtmlImageFormat
/// Size: 0x01 (1 bytes)
enum class ECohtmlImageFormat : uint8_t
{
	ECohtmlImageFormat__PNG                                                          = 0,
	ECohtmlImageFormat__TGA                                                          = 1,
	ECohtmlImageFormat__JPEG                                                         = 2,
	ECohtmlImageFormat__PSD                                                          = 3,
	ECohtmlImageFormat__SVG                                                          = 4,
	ECohtmlImageFormat__DDS                                                          = 5,
	ECohtmlImageFormat__BMP                                                          = 6,
	ECohtmlImageFormat__ASTC                                                         = 7,
	ECohtmlImageFormat__PKM                                                          = 8,
	ECohtmlImageFormat__KTX                                                          = 9
};

/// Enum /Script/CohtmlPlugin.ECohtmlMSAA
/// Size: 0x01 (1 bytes)
enum class ECohtmlMSAA : uint8_t
{
	ECohtmlMSAA__MSAA_1x                                                             = 0,
	ECohtmlMSAA__MSAA_2x                                                             = 1,
	ECohtmlMSAA__MSAA_4x                                                             = 2
};

/// Enum /Script/CohtmlPlugin.ECohtmlSettingsSeverity
/// Size: 0x01 (1 bytes)
enum class ECohtmlSettingsSeverity : uint8_t
{
	ECohtmlSettingsSeverity__Trace                                                   = 0,
	ECohtmlSettingsSeverity__Debug                                                   = 1,
	ECohtmlSettingsSeverity__Info                                                    = 2,
	ECohtmlSettingsSeverity__Warning                                                 = 3,
	ECohtmlSettingsSeverity__AssertFailure                                           = 4,
	ECohtmlSettingsSeverity__Error                                                   = 5
};

/// Enum /Script/CohtmlPlugin.ECohtmlInputPropagationBehaviour
/// Size: 0x01 (1 bytes)
enum class ECohtmlInputPropagationBehaviour : uint8_t
{
	ECohtmlInputPropagationBehaviour__None                                           = 0,
	ECohtmlInputPropagationBehaviour__Keyboard                                       = 1,
	ECohtmlInputPropagationBehaviour__Joystick                                       = 2,
	ECohtmlInputPropagationBehaviour__KeyboardAndJoystick                            = 3
};

/// Enum /Script/CohtmlPlugin.ECohtmlGamepadBehaviourOnFocusLost
/// Size: 0x01 (1 bytes)
enum class ECohtmlGamepadBehaviourOnFocusLost : uint8_t
{
	CohtmlResetState                                                                 = 0,
	CohtmlUseCurrentState                                                            = 1,
	CohtmlUseStateBeforeReset                                                        = 2
};

/// Class /Script/CohtmlPlugin.CohtmlAssetReferencer
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UCohtmlAssetReferencer : public UObject
{ 
public:
};

/// Class /Script/CohtmlPlugin.CohtmlAtlasContainedTextures
/// Size: 0x0078 (120 bytes) (0x000028 - 0x000078) align 8 MaxSize: 0x0078
class UCohtmlAtlasContainedTextures : public UObject
{ 
public:
	SDK_UNDEFINED(80,281) /* TSet<UTexture2D*> */      __um(Textures);                                             // 0x0028   (0x0050)  
};

/// Class /Script/CohtmlPlugin.CohtmlTextureAtlasDetails
/// Size: 0x0060 (96 bytes) (0x000028 - 0x000060) align 8 MaxSize: 0x0060
class UCohtmlTextureAtlasDetails : public UObject
{ 
public:
	FString                                            AtlasPath;                                                  // 0x0028   (0x0010)  
	int32_t                                            Width;                                                      // 0x0038   (0x0004)  
	int32_t                                            Height;                                                     // 0x003C   (0x0004)  
	FString                                            PixelFormat;                                                // 0x0040   (0x0010)  
	int32_t                                            MaxAtlasWidth;                                              // 0x0050   (0x0004)  
	int32_t                                            MaxAtlasHeight;                                             // 0x0054   (0x0004)  
	int32_t                                            MaxTextureWidth;                                            // 0x0058   (0x0004)  
	int32_t                                            MaxTextureHeight;                                           // 0x005C   (0x0004)  
};

/// Struct /Script/CohtmlPlugin.CohtmlSound
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FCohtmlSound
{ 
	class UAudioComponent*                             Component;                                                  // 0x0000   (0x0008)  
	class USoundWaveProcedural*                        Stream;                                                     // 0x0008   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x0010   (0x0008)  MISSED
};

/// Class /Script/CohtmlPlugin.CohtmlAudioWrapper
/// Size: 0x0428 (1064 bytes) (0x000028 - 0x000428) align 8 MaxSize: 0x0428
class UCohtmlAudioWrapper : public UObject
{ 
public:
	class UObject*                                     Owner;                                                      // 0x0028   (0x0008)  
	TMap<int32_t, FCohtmlSound>                        Sounds;                                                     // 0x0030   (0x0050)  
	unsigned char                                      UnknownData00_7[0x3A8];                                     // 0x0080   (0x03A8)  MISSED
};

/// Class /Script/CohtmlPlugin.CohtmlBaseComponent
/// Size: 0x0180 (384 bytes) (0x0000B0 - 0x000180) align 8 MaxSize: 0x0180
class UCohtmlBaseComponent : public UActorComponent
{ 
public:
	SDK_UNDEFINED(16,282) /* FMulticastInlineDelegate */ __um(ReadyForBindings);                                   // 0x00B0   (0x0010)  
	SDK_UNDEFINED(16,283) /* FMulticastInlineDelegate */ __um(BindingsReleased);                                   // 0x00C0   (0x0010)  
	SDK_UNDEFINED(16,284) /* FMulticastInlineDelegate */ __um(ScriptingReady);                                     // 0x00D0   (0x0010)  
	TArray<class UTexture2D*>                          PreloadedTextures;                                          // 0x00E0   (0x0010)  
	bool                                               bEnableComplexCSSSupport;                                   // 0x00F0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x00F1   (0x0007)  MISSED
	class UTextureRenderTarget2D*                      Texture;                                                    // 0x00F8   (0x0008)  
	TEnumAsByte<TextureFilter>                         Filter;                                                     // 0x0100   (0x0001)  
	bool                                               bReceiveInput;                                              // 0x0101   (0x0001)  
	bool                                               bDelayedUpdate;                                             // 0x0102   (0x0001)  
	bool                                               bUseWideColorTextures;                                      // 0x0103   (0x0001)  
	unsigned char                                      UnknownData01_6[0x1C];                                      // 0x0104   (0x001C)  MISSED
	class UCohtmlAudioWrapper*                         AudioWrapper;                                               // 0x0120   (0x0008)  
	unsigned char                                      UnknownData02_7[0x58];                                      // 0x0128   (0x0058)  MISSED


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.UpdateWholeDataModelFromStruct
	// void UpdateWholeDataModelFromStruct(Struct Struct);                                                                      // [0xb19460] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.UpdateWholeDataModelFromObject
	// void UpdateWholeDataModelFromObject(class UObject* Model);                                                               // [0xb20070] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.TriggerJSEvent
	// void TriggerJSEvent(FString Name, class UCohtmlJSEvent* EventData);                                                      // [0xb1fd90] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.SynchronizeModels
	// void SynchronizeModels();                                                                                                // [0xb1fd30] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.ShowPaintRects
	// void ShowPaintRects(bool show);                                                                                          // [0xb1fc10] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.SetSoundAttenuation
	// void SetSoundAttenuation(FSoundAttenuationSettings& Settings);                                                           // [0xb1f8e0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.Resize
	// void Resize(int32_t Width, int32_t Height);                                                                              // [0xb1f570] Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.RemovePreloadedTextureFromPath
	// bool RemovePreloadedTextureFromPath(FString AssetPath);                                                                  // [0xb1f410] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.RemovePreloadedTexture
	// bool RemovePreloadedTexture(class UTexture2D* Texture);                                                                  // [0xb1f2d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.RemoveDataModelFromStruct
	// void RemoveDataModelFromStruct(Struct Struct);                                                                           // [0xb19250] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.RemoveDataModelFromObject
	// void RemoveDataModelFromObject(class UObject* Model);                                                                    // [0xb1f1b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.RemoveAllPreloadedTextures
	// void RemoveAllPreloadedTextures();                                                                                       // [0xb1f170] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.Reload
	// void Reload();                                                                                                           // [0xb1f130] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.PreloadTextureSync
	// void PreloadTextureSync(FString AssetPath);                                                                              // [0xb1eff0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.PreloadTextureAsync
	// void PreloadTextureAsync(FString AssetPath);                                                                             // [0xb1eeb0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.Load
	// void Load(FString Path);                                                                                                 // [0xb1ed70] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.IsReadyToCreateView
	// bool IsReadyToCreateView();                                                                                              // [0xb1ed40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.IsReadyForBindings
	// bool IsReadyForBindings();                                                                                               // [0xb1ece0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.HasRequestedView
	// bool HasRequestedView();                                                                                                 // [0xb1eaf0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.EndDebugFrameSave
	// void EndDebugFrameSave();                                                                                                // [0xb1ea40] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.EnableRendering
	// void EnableRendering(bool bEnabled);                                                                                     // [0xb1e9b0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.EnableDelayedUpdate
	// void EnableDelayedUpdate(bool bEnabled);                                                                                 // [0xb1e920] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.DebugSaveNextFrame
	// void DebugSaveNextFrame();                                                                                               // [0xb1e900] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.CreateJSEvent
	// class UCohtmlJSEvent* CreateJSEvent();                                                                                   // [0xb1e840] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.CreateDataModelFromStruct
	// void CreateDataModelFromStruct(FString Name, Arg Arg);                                                                   // [0xb18fd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.CreateDataModelFromObject
	// void CreateDataModelFromObject(FString Name, class UObject* Model);                                                      // [0xb1e680] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.BeginDebugFrameSave
	// void BeginDebugFrameSave();                                                                                              // [0xb1e660] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBaseComponent.AddPreloadedTexture
	// void AddPreloadedTexture(class UTexture2D* Texture);                                                                     // [0xb1e180] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UCohtmlBlueprintFunctionLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.TriggerJSEvent
	// void TriggerJSEvent(class UCohtmlBaseComponent* Component, FString EventName, class UCohtmlJSEvent* JSEvent);            // [0xb1fe70] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.CreateJSEvent
	// class UCohtmlJSEvent* CreateJSEvent(class UObject* WorldContextObject);                                                  // [0xb1e870] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddStructArg
	// void AddStructArg(class UCohtmlJSEvent* JSEvent, Arg Arg);                                                               // [0xb1e410] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddString
	// void AddString(class UCohtmlJSEvent* JSEvent, FString Arg);                                                              // [0xb1e2a0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddObject
	// void AddObject(class UCohtmlJSEvent* JSEvent, class UObject* Arg);                                                       // [0xb1e030] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddInt32
	// void AddInt32(class UCohtmlJSEvent* JSEvent, int32_t Arg);                                                               // [0xb1de50] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddFloat
	// void AddFloat(class UCohtmlJSEvent* JSEvent, float Arg);                                                                 // [0xb1dd10] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddByte
	// void AddByte(class UCohtmlJSEvent* JSEvent, char Arg);                                                                   // [0xb1dbd0] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddBool
	// void AddBool(class UCohtmlJSEvent* JSEvent, bool Arg);                                                                   // [0xb1da80] Final|Native|Static|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddArrayOfStructs
	// void AddArrayOfStructs(class UCohtmlJSEvent* JSEvent, TArray<int32_t>& Arg);                                             // [0xb1d960] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlBlueprintFunctionLibrary.AddArray
	// void AddArray(class UCohtmlJSEvent* JSEvent, TArray<int32_t>& Arg, int32_t ArrayType);                                   // [0xb1d830] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Class /Script/CohtmlPlugin.CohtmlComponent
/// Size: 0x01B8 (440 bytes) (0x000180 - 0x0001B8) align 8 MaxSize: 0x01B8
class UCohtmlComponent : public UCohtmlBaseComponent
{ 
public:
	FString                                            URL;                                                        // 0x0180   (0x0010)  
	int32_t                                            Width;                                                      // 0x0190   (0x0004)  
	int32_t                                            Height;                                                     // 0x0194   (0x0004)  
	bool                                               ManualTexture;                                              // 0x0198   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0199   (0x0003)  MISSED
	FName                                              PrimitiveName;                                              // 0x019C   (0x0008)  
	unsigned char                                      UnknownData01_7[0x14];                                      // 0x01A4   (0x0014)  MISSED
};

/// Class /Script/CohtmlPlugin.CohtmlEventHelpers
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UCohtmlEventHelpers : public UObject
{ 
public:
};

/// Class /Script/CohtmlPlugin.CohtmlGameHUD
/// Size: 0x03B8 (952 bytes) (0x000310 - 0x0003B8) align 8 MaxSize: 0x03B8
class ACohtmlGameHUD : public AHUD
{ 
public:
	class UCohtmlHUD*                                  CohtmlHUD;                                                  // 0x0310   (0x0008)  
	class UCohtmlHUD*                                  CohtmlHUDInternal;                                          // 0x0318   (0x0008)  
	unsigned char                                      UnknownData00_7[0x98];                                      // 0x0320   (0x0098)  MISSED


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlGameHUD.SetupView
	// void SetupView(FString PageUrl, bool bEnableComplexCSSSupport, bool bDelayedUpdate, bool bUseWideColorTextures);         // [0xb1fa80] Final|RequiredAPI|Native|Public|BlueprintCallable 
};

/// Class /Script/CohtmlPlugin.CohtmlHUD
/// Size: 0x01B0 (432 bytes) (0x000180 - 0x0001B0) align 8 MaxSize: 0x01B0
class UCohtmlHUD : public UCohtmlBaseComponent
{ 
public:
	FSoftObjectPath                                    HUDMaterialName;                                            // 0x0180   (0x0018)  
	class UMaterial*                                   HUDMaterial;                                                // 0x0198   (0x0008)  
	class UMaterialInstanceDynamic*                    HUDMaterialInstance;                                        // 0x01A0   (0x0008)  
	unsigned char                                      UnknownData00_7[0x8];                                       // 0x01A8   (0x0008)  MISSED
};

/// Class /Script/CohtmlPlugin.CohtmlInputActor
/// Size: 0x0278 (632 bytes) (0x000220 - 0x000278) align 8 MaxSize: 0x0278
class ACohtmlInputActor : public AActor
{ 
public:
	SDK_UNDEFINED(16,285) /* FMulticastInlineDelegate */ __um(OnCohtmlInputActorMouseButtonDown);                  // 0x0220   (0x0010)  
	SDK_UNDEFINED(16,286) /* FMulticastInlineDelegate */ __um(OnCohtmlInputActorMouseButtonUp);                    // 0x0230   (0x0010)  
	SDK_UNDEFINED(16,287) /* FMulticastInlineDelegate */ __um(OnCohtmlInputActorKeyDown);                          // 0x0240   (0x0010)  
	SDK_UNDEFINED(16,288) /* FMulticastInlineDelegate */ __um(OnCohtmlInputActorKeyUp);                            // 0x0250   (0x0010)  
	unsigned char                                      UnknownData00_7[0x18];                                      // 0x0260   (0x0018)  MISSED


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlInputActor.ToggleCohtmlInputFocus
	// void ToggleCohtmlInputFocus();                                                                                           // [0xb1fd70] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.SetLineTraceMode
	// void SetLineTraceMode(TEnumAsByte<ECohtmlInputWidgetLineTraceMode> Mode);                                                // [0xb1f860] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.SetInputPropagationBehaviour
	// void SetInputPropagationBehaviour(TEnumAsByte<ECohtmlInputPropagationBehaviour> Propagation);                            // [0xb1f760] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.SetCohtmlViewFocus
	// void SetCohtmlViewFocus(class UCohtmlBaseComponent* NewFocusedView);                                                     // [0xb1f6d0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.SetCohtmlInputFocus
	// void SetCohtmlInputFocus(bool FocusUI);                                                                                  // [0xb1f640] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.IsCohtmlFocused
	// bool IsCohtmlFocused();                                                                                                  // [0xb1ecb0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.Initialize
	// void Initialize(TEnumAsByte<ECollisionChannel> CollisionChannel, TEnumAsByte<TextureAddress> AddressMode, TEnumAsByte<ECohtmlInputWidgetRaycastQuality> RaycastQuality, int32_t UVChannel); // [0xb1eb50] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.GetInputPropagationBehaviour
	// TEnumAsByte<ECohtmlInputPropagationBehaviour> GetInputPropagationBehaviour();                                            // [0xb1ea60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlInputActor.AlwaysAcceptMouseInput
	// void AlwaysAcceptMouseInput(bool bAccept);                                                                               // [0xb1e5d0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/CohtmlPlugin.CohtmlJSEvent
/// Size: 0x00B8 (184 bytes) (0x000028 - 0x0000B8) align 8 MaxSize: 0x00B8
class UCohtmlJSEvent : public UObject
{ 
public:
	unsigned char                                      UnknownData00_8[0x80];                                      // 0x0028   (0x0080)  MISSED
	TArray<class UStruct*>                             StructTypes;                                                // 0x00A8   (0x0010)  


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddText
	// void AddText(FText& Text);                                                                                               // [0xb1e500] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddStructArg
	// void AddStructArg(Arg Arg);                                                                                              // [0xb18f10] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddString
	// void AddString(FString str);                                                                                             // [0xb1e370] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddObject
	// void AddObject(class UObject* Object);                                                                                   // [0xb1e0f0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddName
	// void AddName(FName& Name);                                                                                               // [0xb1dfa0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddInt32
	// void AddInt32(int32_t integer);                                                                                          // [0xb1df10] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddFloat
	// void AddFloat(float fl);                                                                                                 // [0xb1ddd0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddByte
	// void AddByte(char byte);                                                                                                 // [0xb1dc90] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddBool
	// void AddBool(bool B);                                                                                                    // [0xb1db40] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlJSEvent.AddArray
	// void AddArray(TArray<int32_t>& Array);                                                                                   // [0xb18e60] Final|Native|Public|HasOutParms|BlueprintCallable 
};

/// Struct /Script/CohtmlPlugin.SingleFormatFallbacks
/// Size: 0x0018 (24 bytes) (0x000000 - 0x000018) align 8 MaxSize: 0x0018
struct FSingleFormatFallbacks
{ 
	ECohtmlImageFormat                                 BaseFormat;                                                 // 0x0000   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0001   (0x0007)  MISSED
	TArray<ECohtmlImageFormat>                         PossibleFallbacks;                                          // 0x0008   (0x0010)  
};

/// Struct /Script/CohtmlPlugin.ResourceHostPair
/// Size: 0x0020 (32 bytes) (0x000000 - 0x000020) align 8 MaxSize: 0x0020
struct FResourceHostPair
{ 
	FString                                            Host;                                                       // 0x0000   (0x0010)  
	FString                                            HostLocation;                                               // 0x0010   (0x0010)  
};

/// Class /Script/CohtmlPlugin.CohtmlSettings
/// Size: 0x00A0 (160 bytes) (0x000028 - 0x0000A0) align 8 MaxSize: 0x00A0
class UCohtmlSettings : public UObject
{ 
public:
	bool                                               EnableLiveReload;                                           // 0x0028   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0029   (0x0003)  MISSED
	int32_t                                            DevToolsPort;                                               // 0x002C   (0x0004)  
	bool                                               EnableLocalization;                                         // 0x0030   (0x0001)  
	bool                                               EnableBreakIterator;                                        // 0x0031   (0x0001)  
	bool                                               HandleInputOnHTMLBody;                                      // 0x0032   (0x0001)  
	unsigned char                                      UnknownData01_6[0x5];                                       // 0x0033   (0x0005)  MISSED
	TArray<FString>                                    InputTransparentCssClasses;                                 // 0x0038   (0x0010)  
	TArray<FString>                                    InputTransparentCssClassesWithChildren;                     // 0x0048   (0x0010)  
	bool                                               SetDefaultVKTextLayoutToAlphaNumeric;                       // 0x0058   (0x0001)  
	unsigned char                                      UnknownData02_6[0x3];                                       // 0x0059   (0x0003)  MISSED
	float                                              ScrollDelta;                                                // 0x005C   (0x0004)  
	bool                                               ShowWarningsOnScreen;                                       // 0x0060   (0x0001)  
	ECohtmlSettingsSeverity                            LogSeverity;                                                // 0x0061   (0x0001)  
	bool                                               bRespectTitleSafeZone;                                      // 0x0062   (0x0001)  
	bool                                               bRespectLetterboxing;                                       // 0x0063   (0x0001)  
	bool                                               TickWhileGameIsPaused;                                      // 0x0064   (0x0001)  
	bool                                               bUseLowerCaseNamesForAutoExposedProperties;                 // 0x0065   (0x0001)  
	ECohtmlMSAA                                        MSAA;                                                       // 0x0066   (0x0001)  
	unsigned char                                      UnknownData03_6[0x1];                                       // 0x0067   (0x0001)  MISSED
	TArray<FSingleFormatFallbacks>                     FallbacksForAllFormats;                                     // 0x0068   (0x0010)  
	FString                                            DefaultStyleFontFamily;                                     // 0x0078   (0x0010)  
	bool                                               AsynchronousResourceRequestCalls;                           // 0x0088   (0x0001)  
	bool                                               bUseInputPreprocessor;                                      // 0x0089   (0x0001)  
	unsigned char                                      UnknownData04_6[0x6];                                       // 0x008A   (0x0006)  MISSED
	TArray<FResourceHostPair>                          ResourceHostMapping;                                        // 0x0090   (0x0010)  
};

/// Class /Script/CohtmlPlugin.CohtmlSystem
/// Size: 0x0268 (616 bytes) (0x000220 - 0x000268) align 8 MaxSize: 0x0268
class ACohtmlSystem : public AActor
{ 
public:
	unsigned char                                      UnknownData00_1[0x48];                                      // 0x0220   (0x0048)  MISSED
};

/// Class /Script/CohtmlPlugin.CohtmlWidget
/// Size: 0x0208 (520 bytes) (0x000108 - 0x000208) align 8 MaxSize: 0x0208
class UCohtmlWidget : public UWidget
{ 
public:
	unsigned char                                      UnknownData00_8[0x18];                                      // 0x0108   (0x0018)  MISSED
	class AActor*                                      Owner;                                                      // 0x0120   (0x0008)  
	SDK_UNDEFINED(16,289) /* FMulticastInlineDelegate */ __um(ReadyForBindings);                                   // 0x0128   (0x0010)  
	SDK_UNDEFINED(16,290) /* FMulticastInlineDelegate */ __um(BindingsReleased);                                   // 0x0138   (0x0010)  
	SDK_UNDEFINED(16,291) /* FMulticastInlineDelegate */ __um(ScriptingReady);                                     // 0x0148   (0x0010)  
	bool                                               bEnableComplexCSSSupport;                                   // 0x0158   (0x0001)  
	TEnumAsByte<TextureFilter>                         Filter;                                                     // 0x0159   (0x0001)  
	bool                                               bReceiveInput;                                              // 0x015A   (0x0001)  
	TEnumAsByte<ECohtmlInputPropagationBehaviour>      InputPropagationBehaviour;                                  // 0x015B   (0x0001)  
	bool                                               bGammaCorrectedMaterial;                                    // 0x015C   (0x0001)  
	bool                                               bUseWideColorTextures;                                      // 0x015D   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x015E   (0x0002)  MISSED
	float                                              TickPeriodInMinimizedGame;                                  // 0x0160   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x0164   (0x0004)  MISSED
	TArray<class UTexture2D*>                          PreloadedTextures;                                          // 0x0168   (0x0010)  
	class UCohtmlAudioWrapper*                         AudioWrapper;                                               // 0x0178   (0x0008)  
	unsigned char                                      UnknownData03_6[0x78];                                      // 0x0180   (0x0078)  MISSED
	FString                                            URL;                                                        // 0x01F8   (0x0010)  


	/// Functions
	// Function /Script/CohtmlPlugin.CohtmlWidget.UpdateWholeDataModelFromStruct
	// void UpdateWholeDataModelFromStruct(Struct Struct);                                                                      // [0xb19550] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.UpdateWholeDataModelFromObject
	// void UpdateWholeDataModelFromObject(class UObject* Model);                                                               // [0xb20100] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.TriggerJSEvent
	// void TriggerJSEvent(FString Name, class UCohtmlJSEvent* EventData);                                                      // [0xb1ff90] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.SynchronizeModels
	// void SynchronizeModels();                                                                                                // [0xb1fd50] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.ShowPaintRects
	// void ShowPaintRects(bool show);                                                                                          // [0xb1fca0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.SetSoundAttenuation
	// void SetSoundAttenuation(FSoundAttenuationSettings& Settings);                                                           // [0xb1f9b0] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.SetInputPropagationBehaviour
	// void SetInputPropagationBehaviour(TEnumAsByte<ECohtmlInputPropagationBehaviour> Propagation);                            // [0xb1f7e0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.RemovePreloadedTextureFromPath
	// bool RemovePreloadedTextureFromPath(FString AssetPath);                                                                  // [0xb1f4c0] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.RemovePreloadedTexture
	// bool RemovePreloadedTexture(class UTexture2D* Texture);                                                                  // [0xb1f370] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.RemoveDataModelFromStruct
	// void RemoveDataModelFromStruct(Struct Struct);                                                                           // [0xb19340] Final|Native|Public|BlueprintCallable|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.RemoveDataModelFromObject
	// void RemoveDataModelFromObject(class UObject* Model);                                                                    // [0xb1f240] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.RemoveAllPreloadedTextures
	// void RemoveAllPreloadedTextures();                                                                                       // [0xb1f190] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.Reload
	// void Reload();                                                                                                           // [0xb1f150] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.PreloadTextureSync
	// void PreloadTextureSync(FString AssetPath);                                                                              // [0xb1f090] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.PreloadTextureAsync
	// void PreloadTextureAsync(FString AssetPath);                                                                             // [0xb1ef50] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.Load
	// void Load(FString Path);                                                                                                 // [0xb1ee10] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.IsReadyToCreateView
	// bool IsReadyToCreateView();                                                                                              // [0xb1ed40] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.IsReadyForBindings
	// bool IsReadyForBindings();                                                                                               // [0xb1ed10] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.HasRequestedView
	// bool HasRequestedView();                                                                                                 // [0xb1eb20] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.GetRenderTexture
	// class UTextureRenderTarget2D* GetRenderTexture();                                                                        // [0xb1eac0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.GetInputPropagationBehaviour
	// TEnumAsByte<ECohtmlInputPropagationBehaviour> GetInputPropagationBehaviour();                                            // [0xb1ea90] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/CohtmlPlugin.CohtmlWidget.CreateJSEvent
	// class UCohtmlJSEvent* CreateJSEvent();                                                                                   // [0xb1e840] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.CreateDataModelFromStruct
	// void CreateDataModelFromStruct(FString Name, Struct Struct);                                                             // [0xb19100] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.CreateDataModelFromObject
	// void CreateDataModelFromObject(FString Name, class UObject* Model);                                                      // [0xb1e760] Final|Native|Public|BlueprintCallable 
	// Function /Script/CohtmlPlugin.CohtmlWidget.AddPreloadedTexture
	// void AddPreloadedTexture(class UTexture2D* Texture);                                                                     // [0xb1e210] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/CohtmlPlugin.HummingbirdBaseComponent
/// Size: 0x0180 (384 bytes) (0x000180 - 0x000180) align 8 MaxSize: 0x0180
class UHummingbirdBaseComponent : public UCohtmlBaseComponent
{ 
public:
};

/// Class /Script/CohtmlPlugin.HummingbirdComponent
/// Size: 0x01B8 (440 bytes) (0x0001B8 - 0x0001B8) align 8 MaxSize: 0x01B8
class UHummingbirdComponent : public UCohtmlComponent
{ 
public:
};

/// Class /Script/CohtmlPlugin.HummingbirdGameHUD
/// Size: 0x03B8 (952 bytes) (0x0003B8 - 0x0003B8) align 8 MaxSize: 0x03B8
class AHummingbirdGameHUD : public ACohtmlGameHUD
{ 
public:
};

/// Class /Script/CohtmlPlugin.HummingbirdHUD
/// Size: 0x01B0 (432 bytes) (0x0001B0 - 0x0001B0) align 8 MaxSize: 0x01B0
class UHummingbirdHUD : public UCohtmlHUD
{ 
public:
};

/// Class /Script/CohtmlPlugin.HummingbirdInputActor
/// Size: 0x0278 (632 bytes) (0x000278 - 0x000278) align 8 MaxSize: 0x0278
class AHummingbirdInputActor : public ACohtmlInputActor
{ 
public:
};

/// Class /Script/CohtmlPlugin.HummingbirdSystem
/// Size: 0x0268 (616 bytes) (0x000268 - 0x000268) align 8 MaxSize: 0x0268
class AHummingbirdSystem : public ACohtmlSystem
{ 
public:
};

/// Struct /Script/CohtmlPlugin.TextureAtlasMetaData
/// Size: 0x00B0 (176 bytes) (0x000000 - 0x0000B0) align 8 MaxSize: 0x00B0
struct FTextureAtlasMetaData
{ 
	TMap<FString, class UCohtmlTextureAtlasDetails*>   AtlasDetails;                                               // 0x0000   (0x0050)  
	unsigned char                                      UnknownData00_7[0x60];                                      // 0x0050   (0x0060)  MISSED
};

/// Struct /Script/CohtmlPlugin.TextureAtlasMappingInfo
/// Size: 0x0028 (40 bytes) (0x000000 - 0x000028) align 8 MaxSize: 0x0028
struct FTextureAtlasMappingInfo
{ 
	FString                                            AtlasPath;                                                  // 0x0000   (0x0010)  
	int32_t                                            Width;                                                      // 0x0010   (0x0004)  
	int32_t                                            Height;                                                     // 0x0014   (0x0004)  
	int32_t                                            ContentRectWidth;                                           // 0x0018   (0x0004)  
	int32_t                                            ContentRectHeight;                                          // 0x001C   (0x0004)  
	int32_t                                            OriginX;                                                    // 0x0020   (0x0004)  
	int32_t                                            OriginY;                                                    // 0x0024   (0x0004)  
};

/// Struct /Script/CohtmlPlugin.CohtmlViewSettings
/// Size: 0x0010 (16 bytes) (0x000000 - 0x000010) align 4 MaxSize: 0x0010
struct FCohtmlViewSettings
{ 
	int32_t                                            Width;                                                      // 0x0000   (0x0004)  
	int32_t                                            Height;                                                     // 0x0004   (0x0004)  
	bool                                               IsTransparent;                                              // 0x0008   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0009   (0x0003)  MISSED
	float                                              AnimationFrameDefer;                                        // 0x000C   (0x0004)  
};

#pragma pack(pop)


static_assert(sizeof(UCohtmlAssetReferencer) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UCohtmlAtlasContainedTextures) == 0x0078); // 120 bytes (0x000028 - 0x000078)
static_assert(sizeof(UCohtmlTextureAtlasDetails) == 0x0060); // 96 bytes (0x000028 - 0x000060)
static_assert(sizeof(FCohtmlSound) == 0x0018); // 24 bytes (0x000000 - 0x000018)
static_assert(sizeof(UCohtmlAudioWrapper) == 0x0428); // 1064 bytes (0x000028 - 0x000428)
static_assert(sizeof(UCohtmlBaseComponent) == 0x0180); // 384 bytes (0x0000B0 - 0x000180)
static_assert(sizeof(UCohtmlBlueprintFunctionLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(UCohtmlComponent) == 0x01B8); // 440 bytes (0x000180 - 0x0001B8)
static_assert(sizeof(UCohtmlEventHelpers) == 0x0028); // 40 bytes (0x000028 - 0x000028)
