
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameSkillsTrainer
/// dependency: UWorksCore

#pragma pack(push, 0x1)

/// Class /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C
/// Size: 0x0038 (56 bytes) (0x000030 - 0x000038) align 8 MaxSize: 0x0038
class UPlaylistRepositoryBP_C : public UPlaylistRepository
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  


	/// Functions
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_73D3397C42CEA9F452EC0D8A8217F4A5
	// void Receive_ErrorK2_73D3397C42CEA9F452EC0D8A8217F4A5(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_73D3397C42CEA9F452EC0D8A8217F4A5
	// void Receive_SuccessK2_73D3397C42CEA9F452EC0D8A8217F4A5(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_F02C0DA94560E2ECCA54B8A833045E2D
	// void Receive_ErrorK2_F02C0DA94560E2ECCA54B8A833045E2D(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_F02C0DA94560E2ECCA54B8A833045E2D
	// void Receive_SuccessK2_F02C0DA94560E2ECCA54B8A833045E2D(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_1C4591D143BE155206C364B8C5FA9BE1
	// void Receive_ErrorK2_1C4591D143BE155206C364B8C5FA9BE1(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_1C4591D143BE155206C364B8C5FA9BE1
	// void Receive_SuccessK2_1C4591D143BE155206C364B8C5FA9BE1(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_4CDBDB46476AA921B4A1E1834166ACFE
	// void Receive_ErrorK2_4CDBDB46476AA921B4A1E1834166ACFE(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_4CDBDB46476AA921B4A1E1834166ACFE
	// void Receive_SuccessK2_4CDBDB46476AA921B4A1E1834166ACFE(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_CCE62CC9498728B7EEFBA8985EC7CDA5
	// void Receive_ErrorK2_CCE62CC9498728B7EEFBA8985EC7CDA5(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_CCE62CC9498728B7EEFBA8985EC7CDA5
	// void Receive_SuccessK2_CCE62CC9498728B7EEFBA8985EC7CDA5(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_5C75F94F4EC01E78845768A56D96236F
	// void Receive_ErrorK2_5C75F94F4EC01E78845768A56D96236F(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_5C75F94F4EC01E78845768A56D96236F
	// void Receive_SuccessK2_5C75F94F4EC01E78845768A56D96236F(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_22CF2A6F4E7F673EB8C3DBB5CDFEB1F4
	// void Receive_ErrorK2_22CF2A6F4E7F673EB8C3DBB5CDFEB1F4(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_22CF2A6F4E7F673EB8C3DBB5CDFEB1F4
	// void Receive_SuccessK2_22CF2A6F4E7F673EB8C3DBB5CDFEB1F4(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_2F779F39410E509CB7D9478EFD7AB832
	// void Receive_ErrorK2_2F779F39410E509CB7D9478EFD7AB832(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_2F779F39410E509CB7D9478EFD7AB832
	// void Receive_SuccessK2_2F779F39410E509CB7D9478EFD7AB832(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_ErrorK2_0E7C40B94998AD63FA20599E84F4E847
	// void Receive_ErrorK2_0E7C40B94998AD63FA20599E84F4E847(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_SuccessK2_0E7C40B94998AD63FA20599E84F4E847
	// void Receive_SuccessK2_0E7C40B94998AD63FA20599E84F4E847(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_4B1D65DE4033EE392A3244A4F86ADE98
	// void Receive_Error_K2_4B1D65DE4033EE392A3244A4F86ADE98(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_4B1D65DE4033EE392A3244A4F86ADE98
	// void Receive_Success_K2_4B1D65DE4033EE392A3244A4F86ADE98(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_7E58491140B5207FF800BE868558E777
	// void Receive_Error_K2_7E58491140B5207FF800BE868558E777(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_7E58491140B5207FF800BE868558E777
	// void Receive_Success_K2_7E58491140B5207FF800BE868558E777(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_97D778E945686EC61F31FDACDFAE992D
	// void Receive_Error_K2_97D778E945686EC61F31FDACDFAE992D(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_97D778E945686EC61F31FDACDFAE992D
	// void Receive_Success_K2_97D778E945686EC61F31FDACDFAE992D(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_CAB2052348E5EF480882B7A4899A4C5E
	// void Receive_Error_K2_CAB2052348E5EF480882B7A4899A4C5E(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_CAB2052348E5EF480882B7A4899A4C5E
	// void Receive_Success_K2_CAB2052348E5EF480882B7A4899A4C5E(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_8EA3C2E74C920ED3139BA797CDA672CA
	// void Receive_Error_K2_8EA3C2E74C920ED3139BA797CDA672CA(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_8EA3C2E74C920ED3139BA797CDA672CA
	// void Receive_Success_K2_8EA3C2E74C920ED3139BA797CDA672CA(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_5B4C9BC04A56ADC27370C1AE68850E7A
	// void Receive_Error_K2_5B4C9BC04A56ADC27370C1AE68850E7A(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_5B4C9BC04A56ADC27370C1AE68850E7A
	// void Receive_Success_K2_5B4C9BC04A56ADC27370C1AE68850E7A(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_AB7CA60B4D7FC603C45FA3BF252F0B8F
	// void Receive_Error_K2_AB7CA60B4D7FC603C45FA3BF252F0B8F(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_AB7CA60B4D7FC603C45FA3BF252F0B8F
	// void Receive_Success_K2_AB7CA60B4D7FC603C45FA3BF252F0B8F(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_F0D134DC480E75B9C86E6AA9561E0DB2
	// void Receive_Error_K2_F0D134DC480E75B9C86E6AA9561E0DB2(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_F0D134DC480E75B9C86E6AA9561E0DB2
	// void Receive_Success_K2_F0D134DC480E75B9C86E6AA9561E0DB2(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Error_K2_8074ECD34492526B0CEB248417DEF856
	// void Receive_Error_K2_8074ECD34492526B0CEB248417DEF856(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Receive_Success_K2_8074ECD34492526B0CEB248417DEF856
	// void Receive_Success_K2_8074ECD34492526B0CEB248417DEF856(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_GetAllSubscribedPlaylists
	// void Send_GetAllSubscribedPlaylists();                                                                                   // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_GetPlaylistByCodeThenPlay
	// void Send_GetPlaylistByCodeThenPlay(FString Code);                                                                       // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_GetPlaylistByCode
	// void Send_GetPlaylistByCode(FString Code);                                                                               // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_GetPlaylistMetaDataByIDThenUpdateIsOutOfDate
	// void Send_GetPlaylistMetaDataByIDThenUpdateIsOutOfDate(int32_t PlaylistId);                                              // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_UnsubscribeFromPlaylist
	// void Send_UnsubscribeFromPlaylist(int32_t PlaylistId);                                                                   // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_AddFavorite
	// void Send_AddFavorite(int32_t PlaylistId);                                                                               // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_RemoveFavorite
	// void Send_RemoveFavorite(int32_t PlaylistId);                                                                            // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_NewPlaylist
	// void Send_NewPlaylist(FString PlaylistName);                                                                             // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.Send_EditPlaylist
	// void Send_EditPlaylist(FPlaylistServerData& NetworkModel);                                                               // [0x18d2100] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/PlaylistRepositoryBP.PlaylistRepositoryBP_C.ExecuteUbergraph_PlaylistRepositoryBP
	// void ExecuteUbergraph_PlaylistRepositoryBP(int32_t EntryPoint);                                                          // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/Repositories/SteamScenarioRepositoryBP.SteamScenarioRepositoryBP_C
/// Size: 0x012F (303 bytes) (0x000030 - 0x00012F) align 8 MaxSize: 0x012F
class USteamScenarioRepositoryBP_C : public USteamScenarioRepository
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0030   (0x0008)  
	int32_t                                            RetryCount__Public_;                                        // 0x0038   (0x0004)  
	FSteamWorksAsyncResultCodes                        ErrorCodes__Public_;                                        // 0x003C   (0x0002)  
	unsigned char                                      UnknownData00_6[0x2];                                       // 0x003E   (0x0002)  MISSED
	int32_t                                            PageCountTotal__Public_;                                    // 0x0040   (0x0004)  
	int32_t                                            DownloadedPageCount__Public_;                               // 0x0044   (0x0004)  
	int32_t                                            ProcessedPageCount__Public_;                                // 0x0048   (0x0004)  
	unsigned char                                      UnknownData01_6[0x4];                                       // 0x004C   (0x0004)  MISSED
	TArray<FQueryAllUGCParams>                         QueryAllParams__Public_;                                    // 0x0050   (0x0010)  
	TArray<FQueryAllUGCParams>                         QueryAllParams____PendingRetry__Public_;                    // 0x0060   (0x0010)  
	TArray<FQueryAllUGCResult>                         QueryAllResults__Public_;                                   // 0x0070   (0x0010)  
	int32_t                                            RetryCount__Private_;                                       // 0x0080   (0x0004)  
	FSteamWorksAsyncResultCodes                        ErrorCodes__Private_;                                       // 0x0084   (0x0002)  
	unsigned char                                      UnknownData02_6[0x2];                                       // 0x0086   (0x0002)  MISSED
	int32_t                                            PageCountTotal__Private_;                                   // 0x0088   (0x0004)  
	int32_t                                            DownloadedPageCount__Private_;                              // 0x008C   (0x0004)  
	int32_t                                            ProcessedPageCount__Private_;                               // 0x0090   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x0094   (0x0004)  MISSED
	TArray<FQueryAccountTotalPageCountParams>          QueryPageCountsParams__Private_;                            // 0x0098   (0x0010)  
	TArray<FQueryAccountTotalPageCountParams>          QueryPageCountsParams____PendingRetry__Private_;            // 0x00A8   (0x0010)  
	TArray<FQueryAccountTotalPageCountResult>          QueryPageCountsResults__Private_;                           // 0x00B8   (0x0010)  
	TArray<FQueryAllUGCParams>                         QueryAllParams__Private_;                                   // 0x00C8   (0x0010)  
	TArray<FQueryAllUGCParams>                         QueryAllParams____PendingRetry__Private_;                   // 0x00D8   (0x0010)  
	TArray<FQueryAllUGCResult>                         QueryAllUGCResults__Private_;                               // 0x00E8   (0x0010)  
	TArray<FQueryPublishedFileIDsParams>               QueryIDParams__Public_;                                     // 0x00F8   (0x0010)  
	TArray<FQueryPublishedFileIDsParams>               QueryIDParams____PendingRetry__Public_;                     // 0x0108   (0x0010)  
	TArray<FQueryPublishedFileIDsResult>               QueryIDResults__Public_;                                    // 0x0118   (0x0010)  
	bool                                               IsDownloadPending__Public_;                                 // 0x0128   (0x0001)  
	bool                                               IsProcessingPending__Public_;                               // 0x0129   (0x0001)  
	bool                                               IsProcessingPending__Private_;                              // 0x012A   (0x0001)  
	bool                                               IsDownloadPending__Private_;                                // 0x012B   (0x0001)  
	FSteamWorksAsyncResultCodes                        SERVICE_UNAVAILABLE;                                        // 0x012C   (0x0002)  
	bool                                               UseCursor__Public_;                                         // 0x012E   (0x0001)  


	/// Functions
	// Function /Game/Repositories/SteamScenarioRepositoryBP.SteamScenarioRepositoryBP_C.Reset-Data (Private)
	// void Reset_Data_Private_();                                                                                              // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/SteamScenarioRepositoryBP.SteamScenarioRepositoryBP_C.Reset-Data (Public)
	// void Reset_Data_Public_();                                                                                               // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/Repositories/SteamScenarioRepositoryBP.SteamScenarioRepositoryBP_C.Convert to- Total Page Count Params
