
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: AnimGraphRuntime
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: GameSkillsTrainer
/// dependency: GoodSky
/// dependency: InputCore
/// dependency: KovaaKCoreModels
/// dependency: KovaaKFramework
/// dependency: KovaaKProfileModels
/// dependency: KovaaKSettingsModels
/// dependency: KovaaKUI
/// dependency: MapCreator
/// dependency: Slate
/// dependency: SlateCore
/// dependency: UMG
/// dependency: UWorks
/// dependency: UWorksCore
/// dependency: VaRest
/// dependency: VictoryBPLibrary

#pragma pack(push, 0x1)

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/WeaponCooldownType.WeaponCooldownType
/// Size: 0x01 (1 bytes)
enum class WeaponCooldownType : uint8_t
{
	WeaponCooldownType__NewEnumerator2                                               = 0,
	WeaponCooldownType__NewEnumerator1                                               = 1,
	WeaponCooldownType__NewEnumerator0                                               = 2,
	WeaponCooldownType__NewEnumerator3                                               = 3
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/WeaponAnimation.WeaponAnimation
/// Size: 0x01 (1 bytes)
enum class WeaponAnimation : uint8_t
{
	WeaponAnimation__NewEnumerator0                                                  = 0,
	WeaponAnimation__NewEnumerator1                                                  = 1,
	WeaponAnimation__NewEnumerator2                                                  = 2,
	WeaponAnimation__NewEnumerator3                                                  = 3
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/Sounds.Sounds
/// Size: 0x01 (1 bytes)
enum class Sounds : uint8_t
{
	Sounds__NewEnumerator0                                                           = 0,
	Sounds__NewEnumerator1                                                           = 1,
	Sounds__NewEnumerator2                                                           = 2
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/ProjectileGraphic.ProjectileGraphic
/// Size: 0x01 (1 bytes)
enum class ProjectileGraphic : uint8_t
{
	ProjectileGraphic__NewEnumerator0                                                = 0,
	ProjectileGraphic__NewEnumerator1                                                = 1,
	ProjectileGraphic__NewEnumerator2                                                = 2,
	ProjectileGraphic__NewEnumerator3                                                = 3,
	ProjectileGraphic__NewEnumerator4                                                = 4,
	ProjectileGraphic__NewEnumerator5                                                = 5
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Player/BoundingBoxType.BoundingBoxType
/// Size: 0x01 (1 bytes)
enum class BoundingBoxType : uint8_t
{
	BoundingBoxType__NewEnumerator0                                                  = 0,
	BoundingBoxType__NewEnumerator1                                                  = 1,
	BoundingBoxType__NewEnumerator2                                                  = 2
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/WeaponType.WeaponType
/// Size: 0x01 (1 bytes)
enum class WeaponType : uint8_t
{
	WeaponType__NewEnumerator0                                                       = 0,
	WeaponType__NewEnumerator1                                                       = 1,
	WeaponType__NewEnumerator2                                                       = 2
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Weapons/WeaponCategory.WeaponCategory
/// Size: 0x01 (1 bytes)
enum class WeaponCategory : uint8_t
{
	WeaponCategory__NewEnumerator0                                                   = 0,
	WeaponCategory__NewEnumerator1                                                   = 1,
	WeaponCategory__NewEnumerator4                                                   = 2,
	WeaponCategory__NewEnumerator2                                                   = 3,
	WeaponCategory__NewEnumerator3                                                   = 4
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/AI/AimingStyle.AimingStyle
/// Size: 0x01 (1 bytes)
enum class AimingStyle : uint8_t
{
	AimingStyle__NewEnumerator0                                                      = 0,
	AimingStyle__NewEnumerator1                                                      = 1,
	AimingStyle__NewEnumerator2                                                      = 2
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/AI/TargetStrafeOverride.TargetStrafeOverride
/// Size: 0x01 (1 bytes)
enum class TargetStrafeOverride : uint8_t
{
	TargetStrafeOverride__NewEnumerator0                                             = 0,
	TargetStrafeOverride__NewEnumerator1                                             = 1,
	TargetStrafeOverride__NewEnumerator2                                             = 2,
	TargetStrafeOverride__NewEnumerator3                                             = 3
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/AI/AIWaypointLogic.AIWaypointLogic
/// Size: 0x01 (1 bytes)
enum class AIWaypointLogic : uint8_t
{
	AIWaypointLogic__NewEnumerator0                                                  = 0,
	AIWaypointLogic__NewEnumerator1                                                  = 1,
	AIWaypointLogic__NewEnumerator2                                                  = 2,
	AIWaypointLogic__NewEnumerator3                                                  = 3
};

/// Enum /Game/FirstPersonBP/Blueprints/Bodies/Player/SensScalars.SensScalars
/// Size: 0x01 (1 bytes)
enum class SensScalars : uint8_t
{
	SensScalars__NewEnumerator0                                                      = 0,
	SensScalars__NewEnumerator1                                                      = 1,
	SensScalars__NewEnumerator2                                                      = 2,
	SensScalars__NewEnumerator4                                                      = 3,
	SensScalars__NewEnumerator5                                                      = 4,
	SensScalars__NewEnumerator6                                                      = 5,
	SensScalars__NewEnumerator7                                                      = 6,
	SensScalars__NewEnumerator8                                                      = 7,
	SensScalars__NewEnumerator9                                                      = 8,
	SensScalars__NewEnumerator10                                                     = 9,
	SensScalars__NewEnumerator11                                                     = 10,
	SensScalars__NewEnumerator12                                                     = 11,
	SensScalars__NewEnumerator13                                                     = 12,
	SensScalars__NewEnumerator14                                                     = 13,
	SensScalars__NewEnumerator15                                                     = 14,
	SensScalars__NewEnumerator16                                                     = 15,
	SensScalars__NewEnumerator17                                                     = 16,
	SensScalars__NewEnumerator18                                                     = 17,
	SensScalars__NewEnumerator19                                                     = 18,
	SensScalars__NewEnumerator20                                                     = 19
};

/// Enum /Game/FirstPersonBP/Blueprints/UI/GameUI/Scopes/ScopeChoices.ScopeChoices
/// Size: 0x01 (1 bytes)
enum class ScopeChoices : uint8_t
{
	ScopeChoices__NewEnumerator0                                                     = 0,
	ScopeChoices__NewEnumerator1                                                     = 1,
	ScopeChoices__NewEnumerator2                                                     = 2,
	ScopeChoices__NewEnumerator3                                                     = 3,
	ScopeChoices__NewEnumerator4                                                     = 4,
	ScopeChoices__NewEnumerator5                                                     = 5,
	ScopeChoices__NewEnumerator6                                                     = 6,
	ScopeChoices__NewEnumerator7                                                     = 7,
	ScopeChoices__NewEnumerator8                                                     = 8,
	ScopeChoices__NewEnumerator9                                                     = 9,
	ScopeChoices__NewEnumerator10                                                    = 10,
	ScopeChoices__NewEnumerator11                                                    = 11
};

/// Enum /Game/Character/ThirdPerson/E_WeaponType.E_WeaponType
/// Size: 0x01 (1 bytes)
enum class E_WeaponType : uint8_t
{
	E_WeaponType__NewEnumerator2                                                     = 0,
	E_WeaponType__NewEnumerator0                                                     = 1,
	E_WeaponType__NewEnumerator1                                                     = 2,
	E_WeaponType__NewEnumerator3                                                     = 3,
	E_WeaponType__NewEnumerator4                                                     = 4,
	E_WeaponType__NewEnumerator5                                                     = 5,
	E_WeaponType__NewEnumerator6                                                     = 6,
	E_WeaponType__NewEnumerator7                                                     = 7,
	E_WeaponType__NewEnumerator8                                                     = 8
};

/// Enum /Game/Tools/ThirdPerson/Meso/DT_Weapon.DT_Weapon
/// Size: 0x01 (1 bytes)
enum class DT_Weapon : uint8_t
{
	DT_Weapon__NewEnumerator0                                                        = 0,
	DT_Weapon__NewEnumerator1                                                        = 1,
	DT_Weapon__NewEnumerator2                                                        = 2,
	DT_Weapon__NewEnumerator3                                                        = 3,
	DT_Weapon__NewEnumerator4                                                        = 4,
	DT_Weapon__NewEnumerator5                                                        = 5,
	DT_Weapon__NewEnumerator6                                                        = 6,
	DT_Weapon__NewEnumerator7                                                        = 7,
	DT_Weapon__NewEnumerator8                                                        = 8,
	DT_Weapon__NewEnumerator9                                                        = 9,
	DT_Weapon__NewEnumerator10                                                       = 10,
	DT_Weapon__NewEnumerator11                                                       = 11,
	DT_Weapon__NewEnumerator12                                                       = 12,
	DT_Weapon__NewEnumerator13                                                       = 13,
	DT_Weapon__NewEnumerator14                                                       = 14
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C
/// Size: 0x03C8 (968 bytes) (0x000260 - 0x0003C8) align 8 MaxSize: 0x03C8
class UAdaptiveDifficultyViewBase_C : public UAdaptiveDifficultyViewWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_SmallText_C*                            __;                                                         // 0x0268   (0x0008)  
	class UVerticalBox*                                AdaptiveAdvancedVBox;                                       // 0x0270   (0x0008)  
	class UHorizontalBox*                              AdaptiveGoal;                                               // 0x0278   (0x0008)  
	class UVerticalBox*                                AdaptiveSettings;                                           // 0x0280   (0x0008)  
	class UButton*                                     AdaptiveSettingsButton;                                     // 0x0288   (0x0008)  
	class UInputFloat_C*                               AdjustmentAmount;                                           // 0x0290   (0x0008)  
	class UImage*                                      Arrow;                                                      // 0x0298   (0x0008)  
	class UHorizontalBox*                              ErrorMarginHBox;                                            // 0x02A0   (0x0008)  
	class UInputFloat_C*                               Interval;                                                   // 0x02A8   (0x0008)  
	class UCheckBox*                                   IsHeightLocked;                                             // 0x02B0   (0x0008)  
	class UHorizontalBox*                              IsHeightLockedHBox;                                         // 0x02B8   (0x0008)  
	class UCheckBox*                                   IsWorldSpeed;                                               // 0x02C0   (0x0008)  
	class UHorizontalBox*                              IsWorldSpeedHBox;                                           // 0x02C8   (0x0008)  
	class UKovTooltip_C*                               KovTooltip;                                                 // 0x02D0   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x02D8   (0x0008)  
	class UUIR_SmallText_C*                            MainText0;                                                  // 0x02E0   (0x0008)  
	class UUIR_SmallText_C*                            MainText1;                                                  // 0x02E8   (0x0008)  
	class UUIR_SmallText_C*                            MainText2;                                                  // 0x02F0   (0x0008)  
	class UUIR_SmallText_C*                            MainText3;                                                  // 0x02F8   (0x0008)  
	class UUIR_SmallText_C*                            MainText4;                                                  // 0x0300   (0x0008)  
	class UInputFloat_C*                               MaximumTargetSize;                                          // 0x0308   (0x0008)  
	class UInputFloat_C*                               MaximumTargetSpeed;                                         // 0x0310   (0x0008)  
	class UHorizontalBox*                              MaxSizeHBox;                                                // 0x0318   (0x0008)  
	class UHorizontalBox*                              MaxSpeedHBox;                                               // 0x0320   (0x0008)  
	class UInputFloat_C*                               MinimumTargetSize;                                          // 0x0328   (0x0008)  
	class UInputFloat_C*                               MinimumTargetSpeed;                                         // 0x0330   (0x0008)  
	class UHorizontalBox*                              MinSizeHBox;                                                // 0x0338   (0x0008)  
	class UHorizontalBox*                              MinSpeedHBox;                                               // 0x0340   (0x0008)  
	class UVerticalBox*                                RightSpacer;                                                // 0x0348   (0x0008)  
	class UUIR_SmallText_C*                            SecondsText;                                                // 0x0350   (0x0008)  
	class UUIR_SmallText_C*                            SecondsText5;                                               // 0x0358   (0x0008)  
	class UUIR_SmallText_C*                            SecondsText6;                                               // 0x0360   (0x0008)  
	class UInputFloat_C*                               TargetMargin;                                               // 0x0368   (0x0008)  
	class UUIR_SmallText_C*                            TargetPerformancePercentText;                               // 0x0370   (0x0008)  
	class UInputToggle_C*                              TargetSizeDynToggle;                                        // 0x0378   (0x0008)  
	class UInputFloatSlider_C*                         TargetSizeSlider;                                           // 0x0380   (0x0008)  
	class UUIR_SmallText_C*                            TargetSpeedText;                                            // 0x0388   (0x0008)  
	class UUIR_ComboWidget_C*                          TargetStat;                                                 // 0x0390   (0x0008)  
	class UInputFloatSlider_C*                         TargetValueSlider;                                          // 0x0398   (0x0008)  
	class UUIR_SmallText_C*                            ThresholdPercentText;                                       // 0x03A0   (0x0008)  
	class UInputToggle_C*                              TimescaleDynToggle;                                         // 0x03A8   (0x0008)  
	class UInputFloatSlider_C*                         TimescaleSlider;                                            // 0x03B0   (0x0008)  
	bool                                               SmallerSizeWidget;                                          // 0x03B8   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x03B9   (0x0003)  MISSED
	float                                              DefaultMinAdjustmentInterval;                               // 0x03BC   (0x0004)  
	bool                                               IsDirty;                                                    // 0x03C0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x03C1   (0x0003)  MISSED
	float                                              VERY_SMALL_NUMBER;                                          // 0x03C4   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update-AdjustmentInterval
	// void Update_AdjustmentInterval(EAdaptivePerformanceMetricType Selection);                                                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update-MaximumTargetValue
	// void Update_MaximumTargetValue(EAdaptivePerformanceMetricType Selection);                                                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Get-IsNonEditorFreeplay
	// void Get_IsNonEditorFreeplay(bool& NewParam);                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update-PerformanceThreshold
	// void Update_PerformanceThreshold(EAdaptivePerformanceMetricType InPerformanceMetricType);                                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update-PerformanceTarget
	// void Update_PerformanceTarget(EAdaptivePerformanceMetricType InPerformanceMetricType);                                   // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update-PercentTextVisibility
	// void Update_PercentTextVisibility(EAdaptivePerformanceMetricType InPerformanceMetricType);                               // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Convert-ModelToViewModel (PerformanceTarget)
	// void Convert_ModelToViewModel_PerformanceTarget_(EAdaptivePerformanceMetricType InPerformanceMetricType, float InValue, float& OutValue); // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Convert-ViewModelToModel (PerformanceTarget)
	// void Convert_ViewModelToModel_PerformanceTarget_(EAdaptivePerformanceMetricType InPerformanceMetricType, float InValue, float& OutValue); // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Update- Extras Visibility
	// void Update_ExtrasVisibility();                                                                                          // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TargetSizeDynToggle_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature
	// void BndEvt__InputDynamicSettings_TargetSizeDynToggle_K2Node_ComponentBoundEvent_3_OnValueChanged__DelegateSignature(bool bLeftSelected); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TimescaleDynToggle_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature
	// void BndEvt__InputDynamicSettings_TimescaleDynToggle_K2Node_ComponentBoundEvent_4_OnValueChanged__DelegateSignature(bool bLeftSelected); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__DynamicSettings_TargetStat_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature
	// void BndEvt__DynamicSettings_TargetStat_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo> SelectionType); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TimescaleSlider_K2Node_ComponentBoundEvent_6_OnNewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_TimescaleSlider_K2Node_ComponentBoundEvent_6_OnNewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TargetSizeSlider_K2Node_ComponentBoundEvent_7_OnNewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_TargetSizeSlider_K2Node_ComponentBoundEvent_7_OnNewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TargetValueSlider_K2Node_ComponentBoundEvent_8_OnNewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_TargetValueSlider_K2Node_ComponentBoundEvent_8_OnNewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_Interval_K2Node_ComponentBoundEvent_9_NewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_Interval_K2Node_ComponentBoundEvent_9_NewValueInput__DelegateSignature(float Value);   // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_AdjustmentAmount_K2Node_ComponentBoundEvent_10_NewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_AdjustmentAmount_K2Node_ComponentBoundEvent_10_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__InputDynamicSettings_TargetMargin_K2Node_ComponentBoundEvent_11_NewValueInput__DelegateSignature
	// void BndEvt__InputDynamicSettings_TargetMargin_K2Node_ComponentBoundEvent_11_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyView_MinimumTargetSize_K2Node_ComponentBoundEvent_0_NewValueInput__DelegateSignature
	// void BndEvt__AdaptiveDifficultyView_MinimumTargetSize_K2Node_ComponentBoundEvent_0_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyView_MaximumTargetSize_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature
	// void BndEvt__AdaptiveDifficultyView_MaximumTargetSize_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyView_AdaptiveSettingsButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__AdaptiveDifficultyView_AdaptiveSettingsButton_K2Node_ComponentBoundEvent_12_OnButtonClickedEvent__DelegateSignature(); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Hide Advanced Adaptive Settings
	// void HideAdvancedAdaptiveSettings();                                                                                     // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.Register-EventListeners
	// void Register_EventListeners();                                                                                          // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyViewBase_MinimumTargetSpeed_K2Node_ComponentBoundEvent_0_NewValueInput__DelegateSignature
	// void BndEvt__AdaptiveDifficultyViewBase_MinimumTargetSpeed_K2Node_ComponentBoundEvent_0_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyViewBase_MaximumTargetSpeed_K2Node_ComponentBoundEvent_12_NewValueInput__DelegateSignature
	// void BndEvt__AdaptiveDifficultyViewBase_MaximumTargetSpeed_K2Node_ComponentBoundEvent_12_NewValueInput__DelegateSignature(float Value); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyViewBase_IsHeightLocked_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature
	// void BndEvt__AdaptiveDifficultyViewBase_IsHeightLocked_K2Node_ComponentBoundEvent_13_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.BndEvt__AdaptiveDifficultyViewBase_IsWorldSpeed_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature
	// void BndEvt__AdaptiveDifficultyViewBase_IsWorldSpeed_K2Node_ComponentBoundEvent_14_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/AdaptiveDifficultyViewBase.AdaptiveDifficultyViewBase_C.ExecuteUbergraph_AdaptiveDifficultyViewBase
	// void ExecuteUbergraph_AdaptiveDifficultyViewBase(int32_t EntryPoint);                                                    // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C
/// Size: 0x03D0 (976 bytes) (0x0003C8 - 0x0003D0) align 8 MaxSize: 0x03D0
class UAdaptiveDifficultyGameView_C : public UAdaptiveDifficultyViewBase_C
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x03C8   (0x0008)  


	/// Functions
	// Function /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C.Get-IsFreeplay
	// bool Get_IsFreeplay();                                                                                                   // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C.Find_Model
	// class UAdaptiveDifficultyModelInterface* Find_Model();                                                                   // [0x18d2100] Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C.OnInitialized
	// void OnInitialized();                                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C.Receive-Resume
	// void Receive_Resume();                                                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/AdaptiveDifficultyGameView.AdaptiveDifficultyGameView_C.ExecuteUbergraph_AdaptiveDifficultyGameView
	// void ExecuteUbergraph_AdaptiveDifficultyGameView(int32_t EntryPoint);                                                    // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameUI/VersionStringWidget.VersionStringWidget_C
/// Size: 0x0270 (624 bytes) (0x000260 - 0x000270) align 8 MaxSize: 0x0270
class UVersionStringWidget_C : public UVersionDisplayWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_VersionText;                                            // 0x0268   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameUI/VersionStringWidget.VersionStringWidget_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameUI/VersionStringWidget.VersionStringWidget_C.SetText
	// void SetText(FText& Value);                                                                                              // [0x18d2100] Event|Protected|HasOutParms|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameUI/VersionStringWidget.VersionStringWidget_C.ExecuteUbergraph_VersionStringWidget
	// void ExecuteUbergraph_VersionStringWidget(int32_t EntryPoint);                                                           // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C
/// Size: 0x02C4 (708 bytes) (0x000260 - 0x0002C4) align 8 MaxSize: 0x02C4
class UVideoSettingsConfirmationPopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  ApplyButton;                                                // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  CancelButton;                                               // 0x0270   (0x0008)  
	class UUIR_SmallText_C*                            CountdownText;                                              // 0x0278   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0280   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0288   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0290   (0x0008)  
	class UUIR_SmallText_C*                            UIR_SmallText_C;                                            // 0x0298   (0x0008)  
	SDK_UNDEFINED(16,660) /* FMulticastInlineDelegate */ __um(OnOptionChosen);                                     // 0x02A0   (0x0010)  
	TEnumAsByte<EWindowMode>                           LastConfirmedVideoMode;                                     // 0x02B0   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x02B1   (0x0003)  MISSED
	FIntPoint                                          LastConfirmedScreenResolution;                              // 0x02B4   (0x0008)  
	float                                              RevertTimerInterval;                                        // 0x02BC   (0x0004)  
	float                                              RevertTimerEnd;                                             // 0x02C0   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.ClosePopup
	// void ClosePopup();                                                                                                       // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.RevertSettings
	// void RevertSettings();                                                                                                   // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.Tick
	// void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.BndEvt__ApplyButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__ApplyButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                                    // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	// void BndEvt__CancelButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();                                   // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.ExecuteUbergraph_VideoSettingsConfirmationPopup
	// void ExecuteUbergraph_VideoSettingsConfirmationPopup(int32_t EntryPoint);                                                // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/VideoSettingsConfirmationPopup.VideoSettingsConfirmationPopup_C.OnOptionChosen__DelegateSignature
	// void OnOptionChosen__DelegateSignature();                                                                                // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/PlaybackModeNotifier.PlaybackModeNotifier_C
/// Size: 0x0288 (648 bytes) (0x000280 - 0x000288) align 8 MaxSize: 0x0288
class UPlaybackModeNotifier_C : public UPlaybackStreamingModeNotifierWidgetBase
{ 
public:
	class UCanvasPanel*                                CanvasPanel;                                                // 0x0280   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/PlaybackModeNotifier.PlaybackModeNotifier_C.GetVisibility
	// ESlateVisibility GetVisibility();                                                                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/LoadPlayback.LoadPlayback_C
/// Size: 0x02C0 (704 bytes) (0x000288 - 0x0002C0) align 8 MaxSize: 0x02C0
class ULoadPlayback_C : public ULoadPlaybackNative
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0288   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  CancelBtn;                                                  // 0x0290   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  ConfirmButton;                                              // 0x0298   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x02A0   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x02A8   (0x0008)  
	class UUIR_TextBlock_C*                            Text;                                                       // 0x02B0   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C;                                            // 0x02B8   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/LoadPlayback.LoadPlayback_C.BndEvt__LoadPlayback_CancelBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__LoadPlayback_CancelBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/LoadPlayback.LoadPlayback_C.BndEvt__LoadPlayback_ConfirmButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__LoadPlayback_ConfirmButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                     // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/LoadPlayback.LoadPlayback_C.ExecuteUbergraph_LoadPlayback
	// void ExecuteUbergraph_LoadPlayback(int32_t EntryPoint);                                                                  // [0x18d2100] Final                
};

/// Class /Game/FirstPersonBP/Blueprints/UI/CharacterStuff/Playback/ConfirmStartRecording.ConfirmStartRecording_C
/// Size: 0x0268 (616 bytes) (0x000268 - 0x000268) align 8 MaxSize: 0x0268
class UConfirmStartRecording_C : public UStartRecordingConfirmationWidgetBase
{ 
public:
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C
/// Size: 0x03CC (972 bytes) (0x000260 - 0x0003CC) align 8 MaxSize: 0x03CC
class UChallengeSubScore_C : public UChallengeSubScoreWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedTextWidget_C*                       EqualsText;                                                 // 0x0268   (0x0008)  
	class UPalettedTextWidget_C*                       GivenText;                                                  // 0x0270   (0x0008)  
	class UPalettedTextWidget_C*                       MultText;                                                   // 0x0278   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDamageCount;                                        // 0x0280   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDamageMult;                                         // 0x0288   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDamageScore;                                        // 0x0290   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDamageText;                                         // 0x0298   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDirectCount;                                        // 0x02A0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDirectMult;                                         // 0x02A8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDirectScore;                                        // 0x02B0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDirectsText;                                        // 0x02B8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedHitCount;                                           // 0x02C0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedHitMult;                                            // 0x02C8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedHitScore;                                           // 0x02D0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedHitText;                                            // 0x02D8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedKillCount;                                          // 0x02E0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedKillMult;                                           // 0x02E8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedKillScore;                                          // 0x02F0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedKillsText;                                          // 0x02F8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMidairCount;                                        // 0x0300   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMidairMult;                                         // 0x0308   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMidairScore;                                        // 0x0310   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMidairsText;                                        // 0x0318   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMissCount;                                          // 0x0320   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMissMult;                                           // 0x0328   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMissScore;                                          // 0x0330   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedMissText;                                           // 0x0338   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedReloadCount;                                        // 0x0340   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedReloadMult;                                         // 0x0348   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedReloadScore;                                        // 0x0350   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedReloadText;                                         // 0x0358   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedSumScore;                                           // 0x0360   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTotalText;                                          // 0x0368   (0x0008)  
	float                                              DamageTotal;                                                // 0x0370   (0x0004)  
	float                                              KillTotal;                                                  // 0x0374   (0x0004)  
	float                                              MidairTotal;                                                // 0x0378   (0x0004)  
	float                                              DirectTotal;                                                // 0x037C   (0x0004)  
	float                                              DamageMultiplier;                                           // 0x0380   (0x0004)  
	float                                              KillMultiplier;                                             // 0x0384   (0x0004)  
	float                                              MidairMultiplier;                                           // 0x0388   (0x0004)  
	float                                              DirectMultiplier;                                           // 0x038C   (0x0004)  
	float                                              StartTime;                                                  // 0x0390   (0x0004)  
	float                                              EndTime;                                                    // 0x0394   (0x0004)  
	float                                              CurrentTime;                                                // 0x0398   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x039C   (0x0004)  MISSED
	SDK_UNDEFINED(16,661) /* FMulticastInlineDelegate */ __um(DoneCountingUp);                                     // 0x03A0   (0x0010)  
	char                                               TextColor;                                                  // 0x03B0   (0x0001)  
	bool                                               WhiteText;                                                  // 0x03B1   (0x0001)  
	unsigned char                                      UnknownData01_6[0x2];                                       // 0x03B2   (0x0002)  MISSED
	float                                              MissMultiplier;                                             // 0x03B4   (0x0004)  
	float                                              MissTotal;                                                  // 0x03B8   (0x0004)  
	float                                              Hit_Multiplier;                                             // 0x03BC   (0x0004)  
	float                                              Hit_Total;                                                  // 0x03C0   (0x0004)  
	float                                              Reload_Total;                                               // 0x03C4   (0x0004)  
	float                                              Reload_Multiplier;                                          // 0x03C8   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.SetVisibilities
	// void SetVisibilities(bool ForceShowBasic);                                                                               // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.SetAllColorText
	// void SetAllColorText();                                                                                                  // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.SetData
	// void SetData(float DamageTotal, float HitTotal, float KillTotal, float MidairTotal, float DirectTotal, float MissTotal, float ReloadTotal, float DamageMultiplier, float HitMultiplier, float KillMultiplier, float MidairMultiplier, float DirectMultiplier, float MissMultiplier, float ReloadMultiplier, bool ForceShowBasic); // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.SetCounts
	// void SetCounts(float percent);                                                                                           // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.Tick
	// void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.Init
	// void Init();                                                                                                             // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.ExecuteUbergraph_ChallengeSubScore
	// void ExecuteUbergraph_ChallengeSubScore(int32_t EntryPoint);                                                             // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeSubScore.ChallengeSubScore_C.DoneCountingUp__DelegateSignature
	// void DoneCountingUp__DelegateSignature();                                                                                // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsGraph.ChallengeResultsGraph_C
/// Size: 0x03DD (989 bytes) (0x000390 - 0x0003DD) align 8 MaxSize: 0x03DD
class UChallengeResultsGraph_C : public UChallengeResultsGraph
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0390   (0x0008)  
	class UPalettedTextWidget_C*                       FinalScoreWidget;                                           // 0x0398   (0x0008)  
	class UUIR_TextBlock_C*                            HighScoreWidget;                                            // 0x03A0   (0x0008)  
	class UUIR_TextBlock_C*                            ScenarioNameText;                                           // 0x03A8   (0x0008)  
	class UVerticalBox*                                VerticalBox;                                                // 0x03B0   (0x0008)  
	TArray<FString>                                    TimeStamps;                                                 // 0x03B8   (0x0010)  
	TArray<int32_t>                                    Scores;                                                     // 0x03C8   (0x0010)  
	float                                              HighScore;                                                  // 0x03D8   (0x0004)  
	bool                                               Has_Prev_High_Score;                                        // 0x03DC   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsGraph.ChallengeResultsGraph_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsGraph.ChallengeResultsGraph_C.SetData
	// void SetData(FString ScenarioName, float FinalScore, float PrevHighScore, bool HasPrevHighScore);                        // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsGraph.ChallengeResultsGraph_C.OnInitialized
	// void OnInitialized();                                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsGraph.ChallengeResultsGraph_C.ExecuteUbergraph_ChallengeResultsGraph
	// void ExecuteUbergraph_ChallengeResultsGraph(int32_t EntryPoint);                                                         // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C
/// Size: 0x03D0 (976 bytes) (0x000330 - 0x0003D0) align 8 MaxSize: 0x03D0
class UChallengeResultsAnalysisTab_C : public UChallengeEndAnalysisWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0330   (0x0008)  
	class UUIR_TextBlock_C*                            AccuracyText;                                               // 0x0338   (0x0008)  
	class UUIR_TextBlock_C*                            AverageAccuracyText;                                        // 0x0340   (0x0008)  
	class UUIR_TextBlock_C*                            AverageKillsText;                                           // 0x0348   (0x0008)  
	class UUIR_TextBlock_C*                            AverageScoreText;                                           // 0x0350   (0x0008)  
	class UUIR_TextBlock_C*                            AverageTimeToKillText;                                      // 0x0358   (0x0008)  
	class UUIR_TextBlock_C*                            DamageDoneText;                                             // 0x0360   (0x0008)  
	class UUIR_TextBlock_C*                            DateText;                                                   // 0x0368   (0x0008)  
	class UUIR_TextBlock_C*                            FOVText;                                                    // 0x0370   (0x0008)  
	class UUIR_TextBlock_C*                            HorizSensText;                                              // 0x0378   (0x0008)  
	class UUIR_TextBlock_C*                            KillsText;                                                  // 0x0380   (0x0008)  
	class UKovTooltip_C*                               KovTooltip;                                                 // 0x0388   (0x0008)  
	class UUIR_TextBlock_C*                            OvershotsText;                                              // 0x0390   (0x0008)  
	class UUIR_TextBlock_C*                            PerformanceText;                                            // 0x0398   (0x0008)  
	class UUIR_TextBlock_C*                            ScoreText;                                                  // 0x03A0   (0x0008)  
	class UUIR_TextBlock_C*                            SensScaleText;                                              // 0x03A8   (0x0008)  
	class UUIR_TextBlock_C*                            TimeText;                                                   // 0x03B0   (0x0008)  
	class UUIR_TextBlock_C*                            TimeToKillText;                                             // 0x03B8   (0x0008)  
	class UUIR_TextBlock_C*                            TotalTimesPlayedText;                                       // 0x03C0   (0x0008)  
	class UUIR_TextBlock_C*                            VertSensText;                                               // 0x03C8   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C.SetPerformanceText
	// void SetPerformanceText();                                                                                               // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C.SetAvgScenarioData
	// void SetAvgScenarioData(FCSVDataStruct& CSVDataStruct);                                                                  // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C.SetCurrentScenarioData
	// void SetCurrentScenarioData(FCSVDataStruct& CSVDataStruct);                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C.SetData
	// void SetData();                                                                                                          // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeResultsAnalysisTab.ChallengeResultsAnalysisTab_C.ExecuteUbergraph_ChallengeResultsAnalysisTab
	// void ExecuteUbergraph_ChallengeResultsAnalysisTab(int32_t EntryPoint);                                                   // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C
/// Size: 0x0649 (1609 bytes) (0x000260 - 0x000649) align 8 MaxSize: 0x0649
class UChallengeEndScore_C : public UChallengeEndScoreWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UWidgetAnimation*                            HighScoreOpacity;                                           // 0x0268   (0x0008)  
	class UWidgetAnimation*                            HighScoreZoom;                                              // 0x0270   (0x0008)  
	class UBorder*                                     AccuracyBorder;                                             // 0x0278   (0x0008)  
	class USizeBox*                                    AccuracyBox;                                                // 0x0280   (0x0008)  
	class UUIR_TextBlock_C*                            AccuracyText;                                               // 0x0288   (0x0008)  
	class USizeBox*                                    DamageBox;                                                  // 0x0290   (0x0008)  
	class UBorder*                                     DamageEffBorder;                                            // 0x0298   (0x0008)  
	class UUIR_TextBlock_C*                            DamageEffText;                                              // 0x02A0   (0x0008)  
	class UUIR_TextBlock_C*                            DamageText;                                                 // 0x02A8   (0x0008)  
	class UHorizontalBox*                              DistanceBox;                                                // 0x02B0   (0x0008)  
	class UUIR_TextBlock_C*                            DistScore;                                                  // 0x02B8   (0x0008)  
	class UHorizontalBox*                              DynMultiplierBox;                                           // 0x02C0   (0x0008)  
	class UImage*                                      DynSeparator;                                               // 0x02C8   (0x0008)  
	class UVerticalBox*                                DynTargetSizeBox;                                           // 0x02D0   (0x0008)  
	class UUIR_TextBlock_C*                            DynTargetSizeText;                                          // 0x02D8   (0x0008)  
	class UVerticalBox*                                DynTimescaleBox;                                            // 0x02E0   (0x0008)  
	class UUIR_TextBlock_C*                            DynTimescaleText;                                           // 0x02E8   (0x0008)  
	class UUIR_TextBlock_C*                            FinalScore;                                                 // 0x02F0   (0x0008)  
	class UHorizontalBox*                              FinalScoreHorizontalBox;                                    // 0x02F8   (0x0008)  
	class UChallengeSubScore_C*                        GivenScore;                                                 // 0x0300   (0x0008)  
	class UBorder*                                     GoldBorder;                                                 // 0x0308   (0x0008)  
	class UBorder*                                     GoldBorder0;                                                // 0x0310   (0x0008)  
	class UUIR_TextBlock_C*                            HighScore;                                                  // 0x0318   (0x0008)  
	class UHorizontalBox*                              HighScoreBox;                                               // 0x0320   (0x0008)  
	class UTextBlock*                                  HighScoreText;                                              // 0x0328   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0330   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0338   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0340   (0x0008)  
	class UBorder*                                     KDRBorder;                                                  // 0x0348   (0x0008)  
	class UUIR_TextBlock_C*                            KDRText;                                                    // 0x0350   (0x0008)  
	class UUIR_TextBlock_C*                            KillEffText;                                                // 0x0358   (0x0008)  
	class USizeBox*                                    KillsBox;                                                   // 0x0360   (0x0008)  
	class UHorizontalBox*                              MovementBox;                                                // 0x0368   (0x0008)  
	class UUIR_TextBlock_C*                            MovementScore;                                              // 0x0370   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedAccuracyText;                                       // 0x0378   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDmgEffText;                                         // 0x0380   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDynTargetSizeText;                                  // 0x0388   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedDynTimescaleText;                                   // 0x0390   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedKDRText;                                            // 0x0398   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextHighScore;                                      // 0x03A0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget;                                         // 0x03A8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget3;                                        // 0x03B0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget4;                                        // 0x03B8   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget5;                                        // 0x03C0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget6;                                        // 0x03C8   (0x0008)  
	class UHorizontalBox*                              ScoreBox;                                                   // 0x03D0   (0x0008)  
	class UTextBlock*                                  SessionBestText;                                            // 0x03D8   (0x0008)  
	class UUIR_TextBlock_C*                            ShotsText;                                                  // 0x03E0   (0x0008)  
	class UUIR_TextBlock_C*                            SubTotal;                                                   // 0x03E8   (0x0008)  
	class UHorizontalBox*                              SubTotalBox;                                                // 0x03F0   (0x0008)  
	class UChallengeSubScore_C*                        TakenScore;                                                 // 0x03F8   (0x0008)  
	class UHorizontalBox*                              TimeBox;                                                    // 0x0400   (0x0008)  
	class UUIR_TextBlock_C*                            TimeScore;                                                  // 0x0408   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C;                                            // 0x0410   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x0418   (0x0008)  
	class ANewCharacterPlayerController_C*             NewPlayerCont;                                              // 0x0420   (0x0008)  
	bool                                               HotkeysEnabled;                                             // 0x0428   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0429   (0x0003)  MISSED
	float                                              Accuracy;                                                   // 0x042C   (0x0004)  
	float                                              DamageEff;                                                  // 0x0430   (0x0004)  
	float                                              KillEff;                                                    // 0x0434   (0x0004)  
	FLinearColor                                       NormalTextColor;                                            // 0x0438   (0x0010)  
	FLinearColor                                       DimTextColor;                                               // 0x0448   (0x0010)  
	float                                              SecondsRemaining;                                           // 0x0458   (0x0004)  
	bool                                               CheatDetected;                                              // 0x045C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x045D   (0x0003)  MISSED
	int32_t                                            OrigRating;                                                 // 0x0460   (0x0004)  
	int32_t                                            NewRating;                                                  // 0x0464   (0x0004)  
	float                                              DistTraveled;                                               // 0x0468   (0x0004)  
	unsigned char                                      UnknownData02_6[0x4];                                       // 0x046C   (0x0004)  MISSED
	FKey                                               ResetKey;                                                   // 0x0470   (0x0018)  
	SDK_UNDEFINED(16,662) /* FMulticastInlineDelegate */ __um(PlaylistNextClicked);                                // 0x0488   (0x0010)  
	SDK_UNDEFINED(16,663) /* FMulticastInlineDelegate */ __um(PlaylistStopClicked);                                // 0x0498   (0x0010)  
	float                                              PreviousHighScore;                                          // 0x04A8   (0x0004)  
	unsigned char                                      UnknownData03_6[0x4];                                       // 0x04AC   (0x0004)  MISSED
	FKey                                               JumpKey;                                                    // 0x04B0   (0x0018)  
	SDK_UNDEFINED(16,664) /* FMulticastInlineDelegate */ __um(PlaylistReset);                                      // 0x04C8   (0x0010)  
	FScoringProfileNative                              NativeScoringProfile;                                       // 0x04D8   (0x0070)  
	FScoreNative                                       NativeScore;                                                // 0x0548   (0x0100)  
	bool                                               HasPrevHighScore;                                           // 0x0648   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.SetDynamicVisibility
	// void SetDynamicVisibility();                                                                                             // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Set Subscore Values and Tooltips
	// void SetSubscoreValuesandTooltips();                                                                                     // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.ShowGivenScore
	// void ShowGivenScore(bool& Bool);                                                                                         // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_AccuracyBorder_ToolTipText
	// FText Get_AccuracyBorder_ToolTipText();                                                                                  // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DistanceScoreMax_Text
	// FText Get_DistanceScoreMax_Text();                                                                                       // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_InvalidGameVersionBox_Visibility
	// ESlateVisibility Get_InvalidGameVersionBox_Visibility();                                                                 // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.SetDynamicText
	// void SetDynamicText();                                                                                                   // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistNext
	// void PlaylistNext();                                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistStop
	// void PlaylistStop();                                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistKeyEvent
	// void PlaylistKeyEvent(FKeyEvent KeyDownEvent);                                                                           // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_KDRHeader_ColorAndOpacity
	// FSlateColor Get_KDRHeader_ColorAndOpacity();                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DamageEffHeader_ColorAndOpacity
	// FSlateColor Get_DamageEffHeader_ColorAndOpacity();                                                                       // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_AccuracyHeader_ColorAndOpacity
	// FSlateColor Get_AccuracyHeader_ColorAndOpacity();                                                                        // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_HighScoreBox_Visibility
	// ESlateVisibility Get_HighScoreBox_Visibility();                                                                          // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_ScenarioTitleDisplay_Text
	// FText Get_ScenarioTitleDisplay_Text();                                                                                   // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_KDRBorder_BrushColor
	// FLinearColor Get_KDRBorder_BrushColor();                                                                                 // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DamageEffBorder_BrushColor
	// FLinearColor Get_DamageEffBorder_BrushColor();                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_AccuracyBorder_BrushColor
	// FLinearColor Get_AccuracyBorder_BrushColor();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_AccuracyBorder_Background
	// void Get_AccuracyBorder_Background();                                                                                    // [0x18d2100] Public|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_KDRHeader_Text
	// FText Get_KDRHeader_Text();                                                                                              // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DamageEffHeader_Text
	// FText Get_DamageEffHeader_Text();                                                                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_MovementMax_Text
	// FText Get_MovementMax_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_MovementScore_Text
	// FText Get_MovementScore_Text();                                                                                          // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_MovementBox_Visibility
	// ESlateVisibility Get_MovementBox_Visibility();                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.CacheActionKeys
	// void CacheActionKeys();                                                                                                  // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DistanceBox_Visibility
	// ESlateVisibility Get_DistanceBox_Visibility();                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DistScore_Text
	// FText Get_DistScore_Text();                                                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DistMult_Text
	// FText Get_DistMult_Text();                                                                                               // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DistanceTraveled_Text
	// FText Get_DistanceTraveled_Text();                                                                                       // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_WorkshopID_Visibility
	// ESlateVisibility Get_WorkshopID_Visibility();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_SubTotalBox_Visibility
	// ESlateVisibility Get_SubTotalBox_Visibility();                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_HashText_Text
	// FText Get_HashText_Text();                                                                                               // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_TimeBox_Visibility
	// ESlateVisibility Get_TimeBox_Visibility();                                                                               // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_TimeScore_Text
	// FText Get_TimeScore_Text();                                                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_TimeMult_Text
	// FText Get_TimeMult_Text();                                                                                               // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_TimeRemaining_Text
	// FText Get_TimeRemaining_Text();                                                                                          // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_CheatsText_Visibility
	// ESlateVisibility Get_CheatsText_Visibility();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_HighScore_Text
	// FText Get_HighScore_Text();                                                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_FinalScore_Text
	// FText Get_FinalScore_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_KillEffText_ColorAndOpacity
	// FSlateColor Get_KillEffText_ColorAndOpacity();                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_DamageEffText_ColorAndOpacity
	// FSlateColor Get_DamageEffText_ColorAndOpacity();                                                                         // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_AccuracyText_ColorAndOpacity
	// FSlateColor Get_AccuracyText_ColorAndOpacity();                                                                          // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_SubTotal_Text
	// FText Get_SubTotal_Text();                                                                                               // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.EnableHotkeys
	// void EnableHotkeys();                                                                                                    // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.SetData
	// void SetData(FScoreNative ScoreIn, float PreviousBest, bool HasPrevHighScore);                                           // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_TakenScore_Visibility
	// ESlateVisibility Get_TakenScore_Visibility();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Get_GivenScore_Visibility
	// ESlateVisibility Get_GivenScore_Visibility();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnKeyDown
	// FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Completed_3EE84FBC4379875ADE1E9F9901751897
	// void Completed_3EE84FBC4379875ADE1E9F9901751897(bool bSuccessful, FUWorksPublishedFileID PublishedFileID, EUWorksResult Result, bool bVotedUp, bool bVotedDown, bool bVoteSkipped); // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Completed_BACAC82F48AF19934C3CC7AB98A619A8
	// void Completed_BACAC82F48AF19934C3CC7AB98A619A8(bool bSuccessful, FUWorksPublishedFileID PublishedFileID, EUWorksResult Result, bool bVoteUp); // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Completed_36F20708424B0247BF6F9D8534D56200
	// void Completed_36F20708424B0247BF6F9D8534D56200(bool bSuccessful, FUWorksPublishedFileID PublishedFileID, EUWorksResult Result, bool bVoteUp); // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.FreePlay
	// void FreePlay();                                                                                                         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.CheckUpdateWorkshopRating
	// void CheckUpdateWorkshopRating();                                                                                        // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.BndEvt__GivenScore_K2Node_ComponentBoundEvent_0_DoneCountingUp__DelegateSignature
	// void BndEvt__GivenScore_K2Node_ComponentBoundEvent_0_DoneCountingUp__DelegateSignature();                                // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnInitialized
	// void OnInitialized();                                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.ShowHighScorePopup
	// void ShowHighScorePopup();                                                                                               // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlayAgain
	// void PlayAgain();                                                                                                        // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnClickThumbsUp
	// void OnClickThumbsUp();                                                                                                  // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnClickThumbsDown
	// void OnClickThumbsDown();                                                                                                // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnClickFavStar
	// void OnClickFavStar(bool IsFav);                                                                                         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnClickDone
	// void OnClickDone();                                                                                                      // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnPlaylistNext
	// void OnPlaylistNext();                                                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnPlaylistStop
	// void OnPlaylistStop();                                                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.OnVisibilityChanged_Event
	// void OnVisibilityChanged_Event(ESlateVisibility InVisibility);                                                           // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.K2_PlayAgain
	// void K2_PlayAgain();                                                                                                     // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.ExecuteUbergraph_ChallengeEndScore
	// void ExecuteUbergraph_ChallengeEndScore(int32_t EntryPoint);                                                             // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistReset__DelegateSignature
	// void PlaylistReset__DelegateSignature();                                                                                 // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistStopClicked__DelegateSignature
	// void PlaylistStopClicked__DelegateSignature();                                                                           // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScore.ChallengeEndScore_C.PlaylistNextClicked__DelegateSignature
	// void PlaylistNextClicked__DelegateSignature();                                                                           // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndDetails.ChallengeEndDetails_C
/// Size: 0x02B8 (696 bytes) (0x000260 - 0x0002B8) align 8 MaxSize: 0x02B8
class UChallengeEndDetails_C : public UChallengeEndDetailsWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_TextBlock_C*                            AuthorText;                                                 // 0x0268   (0x0008)  
	class UUIR_TextBlock_C*                            BotsLivesText;                                              // 0x0270   (0x0008)  
	class UUIR_TextBlock_C*                            BotsText;                                                   // 0x0278   (0x0008)  
	class UUIR_TextBlock_C*                            DescriptionText;                                            // 0x0280   (0x0008)  
	class UUIR_TextBlock_C*                            MapText;                                                    // 0x0288   (0x0008)  
	class UUIR_TextBlock_C*                            PlayerLivesText;                                            // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            TagsText;                                                   // 0x0298   (0x0008)  
	class UUIR_TextBlock_C*                            TimeLimitText;                                              // 0x02A0   (0x0008)  
	class UUIR_TextBlock_C*                            UploaderText;                                               // 0x02A8   (0x0008)  
	class UUIR_TextBlock_C*                            WeaponHeroText;                                             // 0x02B0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndDetails.ChallengeEndDetails_C.DisplayScenarioData
	// void DisplayScenarioData(FScenarioDataStruct& data);                                                                     // [0x18d2100] Event|Protected|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndDetails.ChallengeEndDetails_C.SetDetails
	// void SetDetails(FScenarioDataStruct data);                                                                               // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndDetails.ChallengeEndDetails_C.ExecuteUbergraph_ChallengeEndDetails
	// void ExecuteUbergraph_ChallengeEndDetails(int32_t EntryPoint);                                                           // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Palette/PalettedButtonWithText.PalettedButtonWithText_C
/// Size: 0x0320 (800 bytes) (0x000318 - 0x000320) align 8 MaxSize: 0x0320
class UPalettedButtonWithText_C : public UPalettedButtonWithTextWidget
{ 
public:
	class UNamedSlot*                                  ButtonContentsSlot;                                         // 0x0318   (0x0008)  
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C
/// Size: 0x02D8 (728 bytes) (0x000260 - 0x0002D8) align 8 MaxSize: 0x02D8
class UInjectProfile_C : public UInjectProfileWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  CancelButton;                                               // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  ConfirmButton;                                              // 0x0270   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0278   (0x0008)  
	class UHorizontalBox*                              FortniteBox;                                                // 0x0280   (0x0008)  
	class UUIR_ComboWidget_C*                          FortniteWeapon;                                             // 0x0288   (0x0008)  
	class UUIR_ComboWidget_C*                          Game;                                                       // 0x0290   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0298   (0x0008)  
	class UHorizontalBox*                              OverwatchBox;                                               // 0x02A0   (0x0008)  
	class UUIR_ComboWidget_C*                          OverwatchChar;                                              // 0x02A8   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x02B0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PalExitButton;                                              // 0x02B8   (0x0008)  
	class UPauseMenu_C*                                PauseMenu;                                                  // 0x02C0   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x02C8   (0x0008)  
	class AKovGameState_C*                             GameState;                                                  // 0x02D0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.TestProfileMcCree
	// void TestProfileMcCree(FCharacterProfileNative& CharProfile, FWeaponProfileNative& WeaponProfile, FMovementAbilityNative& AbilityMovementProfile, FMeleeAbilityNative& AbilityMeleeProfileOut); // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.Get_FortniteBox_Visibility
	// ESlateVisibility Get_FortniteBox_Visibility();                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.InjectProfile
	// void InjectProfile();                                                                                                    // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.Get_OverwatchBox_Visibility
	// ESlateVisibility Get_OverwatchBox_Visibility();                                                                          // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.OnKeyDown
	// FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.Exit
	// void Exit();                                                                                                             // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.BndEvt__PalExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	// void BndEvt__PalExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.BndEvt__CancelButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
	// void BndEvt__CancelButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();                                   // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
	// void BndEvt__ConfirmButton_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();                                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/InjectProfile.InjectProfile_C.ExecuteUbergraph_InjectProfile
	// void ExecuteUbergraph_InjectProfile(int32_t EntryPoint);                                                                 // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C
/// Size: 0x04D4 (1236 bytes) (0x000270 - 0x0004D4) align 8 MaxSize: 0x04D4
class USelectScenario_C : public USelectScenarioWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UUIR_TextBlock_C*                            AuthorTags;                                                 // 0x0278   (0x0008)  
	class UUIR_TextBlock_C*                            BotCount;                                                   // 0x0280   (0x0008)  
	class UUIR_TextBlock_C*                            BotLifeCount;                                               // 0x0288   (0x0008)  
	class UPalettedTextWidget_C*                       CHALLENGE_RULES_TITLE;                                      // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Bots;                                             // 0x0298   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Damage;                                           // 0x02A0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Directs;                                          // 0x02A8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_DynTargetSize;                                    // 0x02B0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_DynTimescale;                                     // 0x02B8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Given;                                            // 0x02C0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Kills;                                            // 0x02C8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Limit;                                            // 0x02D0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Lives;                                            // 0x02D8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Lives2;                                           // 0x02E0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Map;                                              // 0x02E8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_MBS;                                              // 0x02F0   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_MidairDirects;                                    // 0x02F8   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_PointsPerSecond;                                  // 0x0300   (0x0008)  
	class UUIR_TextBlock_C*                            ColorText_Taken;                                            // 0x0308   (0x0008)  
	class UUIR_SmallText_C*                            ColorTextLeaderboard;                                       // 0x0310   (0x0008)  
	class UUIR_TextBlock_C*                            Description;                                                // 0x0318   (0x0008)  
	class UPalettedTextWidget_C*                       DESCRIPTION_TITLE;                                          // 0x0320   (0x0008)  
	class UCheckBox*                                   DontSubmitToLB;                                             // 0x0328   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0330   (0x0008)  
	class UUIR_TextBlock_C*                            DynTargetSize;                                              // 0x0338   (0x0008)  
	class UUIR_TextBlock_C*                            DynTimescale;                                               // 0x0340   (0x0008)  
	class UPalettedTextWidget_C*                       FINAL_SCORES_MULTIPLIERS_TITLE;                             // 0x0348   (0x0008)  
	class UUIR_TextBlock_C*                            HighScore;                                                  // 0x0350   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0358   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0360   (0x0008)  
	class UKovTooltip_C*                               KovTooltip;                                                 // 0x0368   (0x0008)  
	class UUIR_TextBlock_C*                            Lives;                                                      // 0x0370   (0x0008)  
	class UUIR_TextBlock_C*                            MapName;                                                    // 0x0378   (0x0008)  
	class UHorizontalBox*                              MBSBox;                                                     // 0x0380   (0x0008)  
	class UPalettedTextWidget_C*                       MODIFIERS_TITLE;                                            // 0x0388   (0x0008)  
	class UBoxBorder_C*                                OlderVersionBox;                                            // 0x0390   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0398   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget;                                         // 0x03A0   (0x0008)  
	class UPalettedTextWidget_C*                       PalettedTextWidget_C;                                       // 0x03A8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PalExitButton;                                              // 0x03B0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PlayButton;                                                 // 0x03B8   (0x0008)  
	class UPalettedTextWidget_C*                       SCORE_TO_WIN_TITLE;                                         // 0x03C0   (0x0008)  
	class UUIR_TextBlock_C*                            TimeLimit;                                                  // 0x03C8   (0x0008)  
	class UHorizontalBox*                              TimeLimitBox;                                               // 0x03D0   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C;                                            // 0x03D8   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C1;                                           // 0x03E0   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C2;                                           // 0x03E8   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C3;                                           // 0x03F0   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C4;                                           // 0x03F8   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C5;                                           // 0x0400   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C6;                                           // 0x0408   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C7;                                           // 0x0410   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C8;                                           // 0x0418   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C9;                                           // 0x0420   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C10;                                          // 0x0428   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C11;                                          // 0x0430   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C12;                                          // 0x0438   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C13;                                          // 0x0440   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C14;                                          // 0x0448   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C15;                                          // 0x0450   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C16;                                          // 0x0458   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C17;                                          // 0x0460   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C18;                                          // 0x0468   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C19;                                          // 0x0470   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C20;                                          // 0x0478   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C21;                                          // 0x0480   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C22;                                          // 0x0488   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C23;                                          // 0x0490   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C24;                                          // 0x0498   (0x0008)  
	class UUIR_TextBlock_C*                            UIRTextBlock;                                               // 0x04A0   (0x0008)  
	class UBoxBorder_C*                                UploaderBorder;                                             // 0x04A8   (0x0008)  
	class UPalettedTextWidget_C*                       YOUR_HIGH_SCORE_TITLE;                                      // 0x04B0   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x04B8   (0x0008)  
	class AKovGameState_C*                             GameState;                                                  // 0x04C0   (0x0008)  
	bool                                               HasModifiers;                                               // 0x04C8   (0x0001)  
	bool                                               HasMultipliers;                                             // 0x04C9   (0x0001)  
	bool                                               BlockInput;                                                 // 0x04CA   (0x0001)  
	bool                                               KPATest;                                                    // 0x04CB   (0x0001)  
	float                                              BestScore;                                                  // 0x04CC   (0x0004)  
	float                                              AccOrDmgEff;                                                // 0x04D0   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get Target Size Visibility
	// ESlateVisibility GetTargetSizeVisibility();                                                                              // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get Target Speed Visibility
	// ESlateVisibility GetTargetSpeedVisibility();                                                                             // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DynTargetSize_Text
	// FText Get_DynTargetSize_Text();                                                                                          // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DynTimescale_Text
	// FText Get_DynTimescale_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_UploaderBorder_Visibility
	// ESlateVisibility Get_UploaderBorder_Visibility();                                                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Misses_Visibility
	// ESlateVisibility Get_Misses_Visibility();                                                                                // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Reloads_Visibility
	// ESlateVisibility Get_Reloads_Visibility();                                                                               // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Hits_Visibility
	// ESlateVisibility Get_Hits_Visibility();                                                                                  // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.GetText
	// FText GetText();                                                                                                         // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.HandleVisibilityChanged
	// void HandleVisibilityChanged(ESlateVisibility NewVisibility);                                                            // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MissesTaken_Text
	// FText Get_MissesTaken_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.GetColorAndOpacity
	// FSlateColor GetColorAndOpacity();                                                                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.SetGameVersionInvalidVisibility
	// void SetGameVersionInvalidVisibility();                                                                                  // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_HighScore_Text
	// FText Get_HighScore_Text();                                                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.GetHighScore
	// void GetHighScore();                                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_AuthorTags_Text
	// FText Get_AuthorTags_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ColorText_Directs_Visibility
	// ESlateVisibility Get_ColorText_Directs_Visibility();                                                                     // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ColorText_MidairDirects_Visibility
	// ESlateVisibility Get_ColorText_MidairDirects_Visibility();                                                               // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MBSTooltip_ToolTipText
	// FText Get_MBSTooltip_ToolTipText();                                                                                      // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MBSBox_Visibility
	// ESlateVisibility Get_MBSBox_Visibility();                                                                                // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ColorText_Multipliers_Visibility
	// ESlateVisibility Get_ColorText_Multipliers_Visibility();                                                                 // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_BotLifeCount_Text
	// FText Get_BotLifeCount_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_BotCount_Text
	// FText Get_BotCount_Text();                                                                                               // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Description_Text
	// FText Get_Description_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Vis_MultipliersBox
	// FText Vis_MultipliersBox();                                                                                              // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Vis_ModifiersBox
	// FText Vis_ModifiersBox();                                                                                                // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_TimeBox_Visibility
	// ESlateVisibility Get_TimeBox_Visibility();                                                                               // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_SecondsLeft_Text
	// FText Get_SecondsLeft_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_InvincibleText_Text
	// FText Get_InvincibleText_Text();                                                                                         // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.CheckBotsInvuln
	// void CheckBotsInvuln(bool& Invuln);                                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_InvincibleText_Visibility
	// ESlateVisibility Get_InvincibleText_Visibility();                                                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_CheatsText_Visibility
	// ESlateVisibility Get_CheatsText_Visibility();                                                                            // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ProjectilePredictorsText_Visibility
	// ESlateVisibility Get_ProjectilePredictorsText_Visibility();                                                              // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.OnKeyDown
	// FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Score_Multiplier_Visibility
	// ESlateVisibility Get_Score_Multiplier_Visibility();                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_FinalScoreKillEff_Visibility
	// ESlateVisibility Get_FinalScoreKillEff_Visibility();                                                                     // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_FinalScoreDamageEff_Visibility
	// ESlateVisibility Get_FinalScoreDamageEff_Visibility();                                                                   // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_FinalScoreAcc_Visibility
	// ESlateVisibility Get_FinalScoreAcc_Visibility();                                                                         // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DirectsTaken_Text
	// FText Get_DirectsTaken_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MidairsTaken_Text
	// FText Get_MidairsTaken_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_KillsTaken_Text
	// FText Get_KillsTaken_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DamageTaken_Text
	// FText Get_DamageTaken_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DirectsGiven_Text
	// FText Get_DirectsGiven_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MidairsGiven_Text
	// FText Get_MidairsGiven_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_KillsGiven_Text
	// FText Get_KillsGiven_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_DamageGiven_Text
	// FText Get_DamageGiven_Text();                                                                                            // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ScoreToWin_Text
	// FText Get_ScoreToWin_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_Lives_Text
	// FText Get_Lives_Text();                                                                                                  // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_PlayerProfile_Text
	// FText Get_PlayerProfile_Text();                                                                                          // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_MapName_Text
	// FText Get_MapName_Text();                                                                                                // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_TimeLimit_Text
	// FText Get_TimeLimit_Text();                                                                                              // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Get_ScenarioName_Text
	// FText Get_ScenarioName_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.FreePlay
	// void FreePlay();                                                                                                         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.RunChallenge
	// void RunChallenge();                                                                                                     // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Exit
	// void Exit();                                                                                                             // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.BndEvt__DontSubmitToLB_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature
	// void BndEvt__DontSubmitToLB_K2Node_ComponentBoundEvent_0_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.BndEvt__PalChallengeButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__PalChallengeButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.BndEvt__PalExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	// void BndEvt__PalExitButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.InjectProfile
	// void InjectProfile();                                                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.OnAddScoreToTopScoreCache
	// void OnAddScoreToTopScoreCache(FString ScenarioName);                                                                    // [0x18d2100] Event|Protected|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/SelectScenario.SelectScenario_C.ExecuteUbergraph_SelectScenario
	// void ExecuteUbergraph_SelectScenario(int32_t EntryPoint);                                                                // [0x18d2100] Final                
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/WBP_Modal.WBP_Modal_C
/// Size: 0x0320 (800 bytes) (0x000310 - 0x000320) align 8 MaxSize: 0x0320
class UWBP_Modal_C : public UMetaModalWidget
{ 
public:
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0310   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0318   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/WBP_Modal.WBP_Modal_C.GetHeaderTextBlock
	// class UPalettedTextWidgetNative* GetHeaderTextBlock();                                                                   // [0x18d2100] Event|Protected|HasOutParms|BlueprintCallable|BlueprintEvent|Const 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/DuelsGameplayTimeout.DuelsGameplayTimeout_C
/// Size: 0x0300 (768 bytes) (0x000270 - 0x000300) align 8 MaxSize: 0x0300
class UDuelsGameplayTimeout_C : public UDuelsGameplayTimeoutWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0278   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0280   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0288   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  QuitButton;                                                 // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            Text;                                                       // 0x0298   (0x0008)  
	class UPauseMenu_C*                                PauseMenu;                                                  // 0x02A0   (0x0008)  
	FString                                            Folder;                                                     // 0x02A8   (0x0010)  
	FString                                            Filename;                                                   // 0x02B8   (0x0010)  
	int32_t                                            CmdProcID;                                                  // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02CC   (0x0004)  MISSED
	FText                                              DefaultText;                                                // 0x02D0   (0x0018)  
	FText                                              NoChallengeCompletedText;                                   // 0x02E8   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsGameplayTimeout.DuelsGameplayTimeout_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsGameplayTimeout.DuelsGameplayTimeout_C.BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsGameplayTimeout.DuelsGameplayTimeout_C.OnVisibilityChanged_GameplayTimeout
	// void OnVisibilityChanged_GameplayTimeout(ESlateVisibility InVisibility);                                                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsGameplayTimeout.DuelsGameplayTimeout_C.ExecuteUbergraph_DuelsGameplayTimeout
	// void ExecuteUbergraph_DuelsGameplayTimeout(int32_t EntryPoint);                                                          // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/WBP_HUD.WBP_HUD_C
/// Size: 0x0298 (664 bytes) (0x000298 - 0x000298) align 8 MaxSize: 0x0298
class UWBP_HUD_C : public UMetaHudWidget
{ 
public:
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C
/// Size: 0x03D8 (984 bytes) (0x000298 - 0x0003D8) align 8 MaxSize: 0x03D8
class UChallengeEndScreen_C : public UChallengeEndScreenWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0298   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  AnalysisButton;                                             // 0x02A0   (0x0008)  
	class USizeBox*                                    AnalysisButtonSlot;                                         // 0x02A8   (0x0008)  
	class UHorizontalBox*                              AnalysisTab;                                                // 0x02B0   (0x0008)  
	class USizeBox*                                    BenchmarkBox;                                               // 0x02B8   (0x0008)  
	class UBenchmarkEndScreen_C*                       BenchmarkEndScreen;                                         // 0x02C0   (0x0008)  
	class UUIR_SmallText_C*                            BenchmarksBlockedSubmissionWarning;                         // 0x02C8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  BenchmarksButton;                                           // 0x02D0   (0x0008)  
	class USizeBox*                                    BenchmarksButtonSlot;                                       // 0x02D8   (0x0008)  
	class UChallengeEndDetails_C*                      ChallengeEndDetails;                                        // 0x02E0   (0x0008)  
	class UChallengeResultsAnalysisTab_C*              ChallengeResultsAnalysis;                                   // 0x02E8   (0x0008)  
	class UChallengeResultsGraph_C*                    ChallengeResultsGraph;                                      // 0x02F0   (0x0008)  
	class USizeBox*                                    ChallengeSizeBox;                                           // 0x02F8   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0300   (0x0008)  
	class UOverlay*                                    EndScoreParent;                                             // 0x0308   (0x0008)  
	class ULeaderboards_C*                             EndScreenLeaderboard;                                       // 0x0310   (0x0008)  
	class UFavoriteIcon_C*                             FavoriteIcon;                                               // 0x0318   (0x0008)  
	class UUIR_SmallText_C*                            LeaderboardBlockedSubmissionWarning;                        // 0x0320   (0x0008)  
	class USizeBox*                                    LeaderboardBox;                                             // 0x0328   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  LeaderboardButton;                                          // 0x0330   (0x0008)  
	class USizeBox*                                    LeaderboardButtonSlot;                                      // 0x0338   (0x0008)  
	class UHorizontalBox*                              LeaderboardTab;                                             // 0x0340   (0x0008)  
	class USpacer*                                     MiddleSpacer;                                               // 0x0348   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0350   (0x0008)  
	class UUIR_TextBlock_C*                            PlayAgainButtonText;                                        // 0x0358   (0x0008)  
	class UUIR_TextBlock_C*                            PlayAgainButtonText0;                                       // 0x0360   (0x0008)  
	class USizeBox*                                    PlaylistBox;                                                // 0x0368   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PlaylistButton;                                             // 0x0370   (0x0008)  
	class USizeBox*                                    PlaylistButtonSlot;                                         // 0x0378   (0x0008)  
	class UUIR_TextBlock_C*                            PlaylistCompleteText;                                       // 0x0380   (0x0008)  
	class UPlaylistEditor_C*                           PlaylistEditor;                                             // 0x0388   (0x0008)  
	class USpacer*                                     PlaylistLeaderboardSpacer;                                  // 0x0390   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  RatingDown;                                                 // 0x0398   (0x0008)  
	class UImage*                                      RatingDownImage;                                            // 0x03A0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  RatingUp;                                                   // 0x03A8   (0x0008)  
	class UImage*                                      RatingUpImage;                                              // 0x03B0   (0x0008)  
	class USizeBox*                                    ReplayBox;                                                  // 0x03B8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  ReplayButton;                                               // 0x03C0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  StatsButton;                                                // 0x03C8   (0x0008)  
	class UWidgetSwitcher*                             WidgetSwitcher;                                             // 0x03D0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Get-IsSteamAvailable
	// bool Get_IsSteamAvailable();                                                                                             // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Test- Steam Availability
	// bool Test_SteamAvailability();                                                                                           // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.SetHeaderTitle
	// void SetHeaderTitle();                                                                                                   // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdateFavoriteStar
	// void UpdateFavoriteStar();                                                                                               // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Setup Tab Visibility
	// void SetupTabVisibility();                                                                                               // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.OnKeyDown
	// FEventReply OnKeyDown(FGeometry MyGeometry, FKeyEvent InKeyEvent);                                                       // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.StopPlaylist
	// void StopPlaylist();                                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdateSpacers
	// void UpdateSpacers();                                                                                                    // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdateMiddleSpacerVisibility
	// void UpdateMiddleSpacerVisibility();                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdatePlaylistLeaderboardSpacerVisibility
	// void UpdatePlaylistLeaderboardSpacerVisibility();                                                                        // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.SetLeaderboardVisibility
	// void SetLeaderboardVisibility(bool Visible);                                                                             // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Completed_5476A3CF4273D80750389299158F3CAA
	// void Completed_5476A3CF4273D80750389299158F3CAA(bool bSuccessful, FUWorksPublishedFileID PublishedFileID, EUWorksResult Result, bool bVotedUp, bool bVotedDown, bool bVoteSkipped); // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.ErroredEvent_E827A0504024D6A2FDDCC690BDA8DF91
	// void ErroredEvent_E827A0504024D6A2FDDCC690BDA8DF91(FText& ErrStr);                                                       // [0x18d2100] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.SucceededEvent_E827A0504024D6A2FDDCC690BDA8DF91
	// void SucceededEvent_E827A0504024D6A2FDDCC690BDA8DF91(FText& ErrStr);                                                     // [0x18d2100] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.PlaylistNextClicked
	// void PlaylistNextClicked();                                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.PlaylistStopClicked
	// void PlaylistStopClicked();                                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_LeaderboardButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_LeaderboardButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();           // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_AnalysisButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_AnalysisButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();              // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_PlaylistButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_PlaylistButton_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();              // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_PlayAgainButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_PlayAgainButton_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_DoneButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_DoneButton_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_RatingDown_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_RatingDown_K2Node_ComponentBoundEvent_6_OnClicked__DelegateSignature();                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_RatingUp_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_RatingUp_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();                    // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_FavoriteIcon_K2Node_ComponentBoundEvent_8_StarClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_FavoriteIcon_K2Node_ComponentBoundEvent_8_StarClicked__DelegateSignature(bool IsFavorite); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Destruct
	// void Destruct();                                                                                                         // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdateResultsGraph
	// void UpdateResultsGraph();                                                                                               // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_StatsButton_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_StatsButton_K2Node_ComponentBoundEvent_9_OnClicked__DelegateSignature();                 // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_BenchmarksButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_BenchmarksButton_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.OnBenchmarksClicked
	// void OnBenchmarksClicked();                                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.StopClicked
	// void StopClicked();                                                                                                      // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.OnVisibilityChanged_Event
	// void OnVisibilityChanged_Event(ESlateVisibility InVisibility);                                                           // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.UpdateVoting
	// void UpdateVoting();                                                                                                     // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.HandleRatingUpClick
	// void HandleRatingUpClick();                                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.HandleRatingDownClick
	// void HandleRatingDownClick();                                                                                            // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.BndEvt__ChallengeEndScreen_ReplayButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature
	// void BndEvt__ChallengeEndScreen_ReplayButton_K2Node_ComponentBoundEvent_10_OnClicked__DelegateSignature();               // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Show-SteamOfflineErrorPopUp
	// void Show_SteamOfflineErrorPopUp();                                                                                      // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Invoke-HandleSteamOffline_OkPressed_Event
	// void Invoke_HandleSteamOffline_OkPressed_Event();                                                                        // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.ExternalPlayAgainButton
	// void ExternalPlayAgainButton();                                                                                          // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.ForceExternalPlayAgain
	// void ForceExternalPlayAgain();                                                                                           // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.NewScenarioLoaded
	// void NewScenarioLoaded();                                                                                                // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Challenges/ChallengeEndScreen.ChallengeEndScreen_C.ExecuteUbergraph_ChallengeEndScreen
	// void ExecuteUbergraph_ChallengeEndScreen(int32_t EntryPoint);                                                            // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleCrosshairItem.SingleCrosshairItem_C
/// Size: 0x02B8 (696 bytes) (0x000260 - 0x0002B8) align 8 MaxSize: 0x02B8
class USingleCrosshairItem_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_SmallButton_C*                          Button;                                                     // 0x0268   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0270   (0x0008)  
	class UWidget*                                     ScrollOwner;                                                // 0x0278   (0x0008)  
	class UInputCrosshair_C*                           DropdownParent;                                             // 0x0280   (0x0008)  
	FString                                            Filename;                                                   // 0x0288   (0x0010)  
	FVector                                            CrosshairTint;                                              // 0x0298   (0x000C)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02A4   (0x0004)  MISSED
	class UTexture2D*                                  CrosshairImage;                                             // 0x02A8   (0x0008)  
	class UCrosshairPicker_C*                          Picker;                                                     // 0x02B0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleCrosshairItem.SingleCrosshairItem_C.SetCrosshairColor
	// void SetCrosshairColor();                                                                                                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleCrosshairItem.SingleCrosshairItem_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_0_K2Node_ComponentBoundEvent_1_OnButtonClickedEvent__DelegateSignature();                            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleCrosshairItem.SingleCrosshairItem_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleCrosshairItem.SingleCrosshairItem_C.ExecuteUbergraph_SingleCrosshairItem
	// void ExecuteUbergraph_SingleCrosshairItem(int32_t EntryPoint);                                                           // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C
/// Size: 0x02E8 (744 bytes) (0x0002A8 - 0x0002E8) align 8 MaxSize: 0x02E8
class UCrosshairPicker_C : public UTemporaryUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class UWidgetAnimation*                            FadeIn;                                                     // 0x02B0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Cancel;                                                     // 0x02B8   (0x0008)  
	class UUniformGridPanel*                           CrosshairGrid;                                              // 0x02C0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Custom;                                                     // 0x02C8   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x02D0   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x02D8   (0x0008)  
	class UInputCrosshair_C*                           ParentCrosshairWidget;                                      // 0x02E0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.CloseWidget
	// void CloseWidget();                                                                                                      // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.SetPickerCrosshairColors
	// void SetPickerCrosshairColors();                                                                                         // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.GetCrosshairs
	// void GetCrosshairs();                                                                                                    // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.MessageFromButton
	// void MessageFromButton(FText Message, int32_t Number, FString Extension, class UObject* data);                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.Tick
	// void Tick(FGeometry MyGeometry, float InDeltaTime);                                                                      // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.BndEvt__Cancel_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__Cancel_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.BndEvt__Custom_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__Custom_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/CrosshairPicker.CrosshairPicker_C.ExecuteUbergraph_CrosshairPicker
	// void ExecuteUbergraph_CrosshairPicker(int32_t EntryPoint);                                                               // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C
/// Size: 0x0314 (788 bytes) (0x000260 - 0x000314) align 8 MaxSize: 0x0314
class UPopupFILMS_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UButton*                                     Button_MoreInfo;                                            // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Cancel;                                                     // 0x0270   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0278   (0x0008)  
	class UUIR_SmallText_C*                            FILMSExplanation;                                           // 0x0280   (0x0008)  
	class UUIR_SmallText_C*                            FOV;                                                        // 0x0288   (0x0008)  
	class UInputFloat_C*                               FOVNumber;                                                  // 0x0290   (0x0008)  
	class UUIR_SmallText_C*                            FOVOutputHoriz;                                             // 0x0298   (0x0008)  
	class UUIR_SmallText_C*                            FOVOutputVert;                                              // 0x02A0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Okay;                                                       // 0x02B0   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x02B8   (0x0008)  
	class UUIR_SmallText_C*                            Resolution;                                                 // 0x02C0   (0x0008)  
	class UUIR_SmallText_C*                            SelectedText;                                               // 0x02C8   (0x0008)  
	SDK_UNDEFINED(16,665) /* FMulticastInlineDelegate */ __um(OkayClicked);                                        // 0x02D0   (0x0010)  
	SDK_UNDEFINED(16,666) /* FMulticastInlineDelegate */ __um(CancelClicked);                                      // 0x02E0   (0x0010)  
	FString                                            FILMSString;                                                // 0x02F0   (0x0010)  
	FString                                            SelectedFOVScale;                                           // 0x0300   (0x0010)  
	float                                              FOVInput;                                                   // 0x0310   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.Get_SelectedText_Visibility
	// ESlateVisibility Get_SelectedText_Visibility();                                                                          // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.Get_Resolution_Text
	// FText Get_Resolution_Text();                                                                                             // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.GetScaleRule
	// void GetScaleRule(FText& ScaleRule);                                                                                     // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.GetMeasureRule
	// void GetMeasureRule(FText& measureRule);                                                                                 // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.Get_FILMSExplanation_Text
	// FText Get_FILMSExplanation_Text();                                                                                       // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.Get_SelectedText_Text
	// FText Get_SelectedText_Text();                                                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.BndEvt__Yes_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__Yes_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                                            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.BndEvt__Cancel_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	// void BndEvt__Cancel_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.UpdateActualFOVs
	// void UpdateActualFOVs();                                                                                                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.BndEvt__PopupFILMS_FOVNumber_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature
	// void BndEvt__PopupFILMS_FOVNumber_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature(float Value);            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.BndEvt__PopupFILMS_Button_MoreInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__PopupFILMS_Button_MoreInfo_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();          // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.ExecuteUbergraph_PopupFILMS
	// void ExecuteUbergraph_PopupFILMS(int32_t EntryPoint);                                                                    // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.CancelClicked__DelegateSignature
	// void CancelClicked__DelegateSignature();                                                                                 // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameOptions/PopupFILMS.PopupFILMS_C.OkayClicked__DelegateSignature
	// void OkayClicked__DelegateSignature();                                                                                   // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C
/// Size: 0x02B8 (696 bytes) (0x000260 - 0x0002B8) align 8 MaxSize: 0x02B8
class USoundInMultiSelector_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  DeleteButton;                                               // 0x0268   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0270   (0x0008)  
	class UInputSound_C*                               InputSound;                                                 // 0x0278   (0x0008)  
	class UInputMultiSound_C*                          ParentSelector;                                             // 0x0280   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x0288   (0x0008)  
	FText                                              PickerHeader;                                               // 0x0290   (0x0018)  
	FString                                            DefaultFilter;                                              // 0x02A8   (0x0010)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C.MessageFromButton
	// void MessageFromButton(FText Message, int32_t Number, FString Extension, class UObject* data);                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C.BndEvt__InputSound_K2Node_ComponentBoundEvent_0_OnSoundChange__DelegateSignature
	// void BndEvt__InputSound_K2Node_ComponentBoundEvent_0_OnSoundChange__DelegateSignature(FString Filename);                 // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C.BndEvt__DeleteButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__DeleteButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                   // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SoundInMultiSelector.SoundInMultiSelector_C.ExecuteUbergraph_SoundInMultiSelector
	// void ExecuteUbergraph_SoundInMultiSelector(int32_t EntryPoint);                                                          // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleScaleItem.SingleScaleItem_C
/// Size: 0x02A8 (680 bytes) (0x000260 - 0x0002A8) align 8 MaxSize: 0x02A8
class USingleScaleItem_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Button;                                                     // 0x0268   (0x0008)  
	class UUIR_TextBlock_C*                            ButtonText;                                                 // 0x0270   (0x0008)  
	class UWidget*                                     ScrollOwner;                                                // 0x0278   (0x0008)  
	class UInputCrosshair_C*                           DropdownParent;                                             // 0x0280   (0x0008)  
	FString                                            ScaleName;                                                  // 0x0288   (0x0010)  
	class UScalePicker_C*                              ScalePicker;                                                // 0x0298   (0x0008)  
	class ANewCharacterPlayerController_C*             NewPlayerController;                                        // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleScaleItem.SingleScaleItem_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleScaleItem.SingleScaleItem_C.BndEvt__Button_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__Button_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SingleScaleItem.SingleScaleItem_C.ExecuteUbergraph_SingleScaleItem
	// void ExecuteUbergraph_SingleScaleItem(int32_t EntryPoint);                                                               // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Palette/PalettedProgressBar_Small.PalettedProgressBar_Small_C
/// Size: 0x0280 (640 bytes) (0x000278 - 0x000280) align 8 MaxSize: 0x0280
class UPalettedProgressBar_Small_C : public UPalettedProgressBarNative
{ 
public:
	class UImage*                                      DarkBackdrop;                                               // 0x0278   (0x0008)  
};

/// Class /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C
/// Size: 0x02B8 (696 bytes) (0x000268 - 0x0002B8) align 8 MaxSize: 0x02B8
class UInfobar_C : public UCharacterOwnedWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0268   (0x0008)  
	class UWidgetAnimation*                            WeaponEmpty;                                                // 0x0270   (0x0008)  
	class UWidgetAnimation*                            DodgeEmpty;                                                 // 0x0278   (0x0008)  
	class UTextBlock*                                  DodgeName;                                                  // 0x0280   (0x0008)  
	class UPalettedProgressBar_Small_C*                DodgeProgressBar;                                           // 0x0288   (0x0008)  
	class USizeBox*                                    WeaponBox;                                                  // 0x0290   (0x0008)  
	class UTextBlock*                                  WeaponName;                                                 // 0x0298   (0x0008)  
	class UPalettedProgressBar_Small_C*                WeaponProgressBar;                                          // 0x02A0   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x02A8   (0x0008)  
	class ATheMetaAIController*                        BotAIController;                                            // 0x02B0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C.HandleInvalidateDodgeProfile
	// void HandleInvalidateDodgeProfile(FText DodgeProfileDisplayName, float SwapTime);                                        // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C.HandleInvalidateWeaponProfile
	// void HandleInvalidateWeaponProfile(FText WeaponDisplayName, float SwapTime);                                             // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/Infobar.Infobar_C.ExecuteUbergraph_Infobar
	// void ExecuteUbergraph_Infobar(int32_t EntryPoint);                                                                       // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/Bodies/Player/BP_DummyCamera.BP_DummyCamera_C
/// Size: 0x0240 (576 bytes) (0x000240 - 0x000240) align 8 MaxSize: 0x0240
class ABP_DummyCamera_C : public ADummyCamera
{ 
public:
};

/// Class /Game/FirstPersonBP/Blueprints/Bodies/BP_WeaponHandler.BP_WeaponHandler_C
/// Size: 0x02C0 (704 bytes) (0x0002C0 - 0x0002C0) align 8 MaxSize: 0x02C0
class ABP_WeaponHandler_C : public AWeaponHandler
{ 
public:


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/Bodies/BP_WeaponHandler.BP_WeaponHandler_C.GetEffectiveWeaponModel
	// void GetEffectiveWeaponModel(FString It, FString& OutValue);                                                             // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/BP_WeaponHandler.BP_WeaponHandler_C.ZoomOutImplementation
	// void ZoomOutImplementation();                                                                                            // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/BP_WeaponHandler.BP_WeaponHandler_C.ZoomInImplementation
	// void ZoomInImplementation();                                                                                             // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/Bodies/BP_WeaponHandler.BP_WeaponHandler_C.UpdateThirdPersonWeaponModel
	// void UpdateThirdPersonWeaponModel();                                                                                     // [0x18d2100] Event|Protected|HasDefaults|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C
/// Size: 0x02FA (762 bytes) (0x000260 - 0x0002FA) align 8 MaxSize: 0x02FA
class USaveNoCancel_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Cancel;                                                     // 0x0268   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0270   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0278   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  No;                                                         // 0x0280   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0288   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Yes;                                                        // 0x0290   (0x0008)  
	SDK_UNDEFINED(16,667) /* FMulticastInlineDelegate */ __um(SAVEClicked);                                        // 0x0298   (0x0010)  
	SDK_UNDEFINED(16,668) /* FMulticastInlineDelegate */ __um(DontSaveClicked);                                    // 0x02A8   (0x0010)  
	SDK_UNDEFINED(16,669) /* FMulticastInlineDelegate */ __um(CancelClicked);                                      // 0x02B8   (0x0010)  
	FText                                              Text;                                                       // 0x02C8   (0x0018)  
	FText                                              Header;                                                     // 0x02E0   (0x0018)  
	bool                                               HideCancel;                                                 // 0x02F8   (0x0001)  
	bool                                               HideNo;                                                     // 0x02F9   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.BndEvt__Yes_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__Yes_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                                            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.BndEvt__No_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	// void BndEvt__No_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                                             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.BndEvt__Cancel_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	// void BndEvt__Cancel_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.ExecuteUbergraph_SaveNoCancel
	// void ExecuteUbergraph_SaveNoCancel(int32_t EntryPoint);                                                                  // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.CancelClicked__DelegateSignature
	// void CancelClicked__DelegateSignature();                                                                                 // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.DontSaveClicked__DelegateSignature
	// void DontSaveClicked__DelegateSignature();                                                                               // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/SaveNoCancel.SaveNoCancel_C.SaveClicked__DelegateSignature
	// void SaveClicked__DelegateSignature();                                                                                   // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C
/// Size: 0x0298 (664 bytes) (0x000280 - 0x000298) align 8 MaxSize: 0x0298
class UBotInBotSelector_C : public UBotInBotSelectorWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0280   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0288   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              RemoveButton;                                               // 0x0290   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.PopulateProfiles
	// void PopulateProfiles(FString Folder, FString Extension, bool Clear, bool BlankExtensions);                              // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.PopulateProfilesWithStrings
	// void PopulateProfilesWithStrings(TArray<FString>& InStrings, TArray<FString>& Extensions, bool Clear);                   // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.MessageFromButton
	// void MessageFromButton(FText Message, int32_t Number, FString Extension, class UObject* data);                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.BndEvt__PalettedRoundedButtonWidget_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__PalettedRoundedButtonWidget_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                    // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.BndEvt__BotInBotSelector_InputProfile_69_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature
	// void BndEvt__BotInBotSelector_InputProfile_69_K2Node_ComponentBoundEvent_1_NewValueInput__DelegateSignature(FText ProfileNameText); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotInBotSelector.BotInBotSelector_C.ExecuteUbergraph_BotInBotSelector
	// void ExecuteUbergraph_BotInBotSelector(int32_t EntryPoint);                                                              // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C
/// Size: 0x0370 (880 bytes) (0x000260 - 0x000370) align 8 MaxSize: 0x0370
class UBotSelector_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  AddBot;                                                     // 0x0268   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0270   (0x0008)  
	class UCheckBox*                                   InvincibleBots;                                             // 0x0278   (0x0008)  
	class UVerticalBox*                                ProfileBox;                                                 // 0x0280   (0x0008)  
	FText                                              ErrorMessage;                                               // 0x0288   (0x0018)  
	class UProfileInMultiSelector_C*                   CurrentItem;                                                // 0x02A0   (0x0008)  
	bool                                               ShowWeights;                                                // 0x02A8   (0x0001)  
	bool                                               ShowArrows;                                                 // 0x02A9   (0x0001)  
	bool                                               ShowLives;                                                  // 0x02AA   (0x0001)  
	unsigned char                                      UnknownData00_6[0x5];                                       // 0x02AB   (0x0005)  MISSED
	SDK_UNDEFINED(16,670) /* FMulticastInlineDelegate */ __um(ProfilesChanged);                                    // 0x02B0   (0x0010)  
	bool                                               ShowTeam;                                                   // 0x02C0   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x02C1   (0x0007)  MISSED
	TArray<FString>                                    Profiles;                                                   // 0x02C8   (0x0010)  
	TArray<FString>                                    Extensions;                                                 // 0x02D8   (0x0010)  
	class UObject*                                     Picker;                                                     // 0x02E8   (0x0008)  
	FText                                              PickerText;                                                 // 0x02F0   (0x0018)  
	bool                                               PopWithStrings_;                                            // 0x0308   (0x0001)  
	unsigned char                                      UnknownData02_6[0x7];                                       // 0x0309   (0x0007)  MISSED
	FString                                            PopFolder;                                                  // 0x0310   (0x0010)  
	FString                                            PopExtension;                                               // 0x0320   (0x0010)  
	bool                                               PopClear;                                                   // 0x0330   (0x0001)  
	bool                                               PopBlankExts;                                               // 0x0331   (0x0001)  
	unsigned char                                      UnknownData03_6[0x6];                                       // 0x0332   (0x0006)  MISSED
	TArray<FString>                                    PopStrings;                                                 // 0x0338   (0x0010)  
	TArray<FString>                                    PopExts;                                                    // 0x0348   (0x0010)  
	int32_t                                            LastBotTeam;                                                // 0x0358   (0x0004)  
	unsigned char                                      UnknownData04_6[0x4];                                       // 0x035C   (0x0004)  MISSED
	SDK_UNDEFINED(16,671) /* FMulticastInlineDelegate */ __um(CheckStateChanged);                                  // 0x0360   (0x0010)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.PopulateWithFilteredList
	// void PopulateWithFilteredList();                                                                                         // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.UpdateBotList
	// void UpdateBotList();                                                                                                    // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.PopulateOneInput
	// void PopulateOneInput(class UInputProfileWidget* InputProfileWidget);                                                    // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.PopulateWithStrings
	// void PopulateWithStrings(TArray<FString>& InStrings, TArray<FString>& Extensions, bool Clear);                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.PopulateProfiles
	// void PopulateProfiles(FString Folder, FString Extension, bool Clear, bool BlankExtensions);                              // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.MessageFromButton
	// void MessageFromButton(FText Message, int32_t Number, FString Extension, class UObject* data);                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.BndEvt__BotSelector_AddBot_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__BotSelector_AddBot_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.BndEvt__BotSelector_InvincibleBots_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature
	// void BndEvt__BotSelector_InvincibleBots_K2Node_ComponentBoundEvent_1_OnCheckBoxComponentStateChanged__DelegateSignature(bool bIsChecked); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.Receive_PostStart
	// void Receive_PostStart(EScenarioStartType StartType);                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.Receive-Initialize
	// void Receive_Initialize(bool bNewScenario);                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.ExecuteUbergraph_BotSelector
	// void ExecuteUbergraph_BotSelector(int32_t EntryPoint);                                                                   // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.CheckStateChanged__DelegateSignature
	// void CheckStateChanged__DelegateSignature(bool IsChecked);                                                               // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/GameManager/Elements/BotSelector.BotSelector_C.ProfilesChanged__DelegateSignature
	// void ProfilesChanged__DelegateSignature();                                                                               // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C
/// Size: 0x0308 (776 bytes) (0x0002A8 - 0x000308) align 8 MaxSize: 0x0308
class UPlayerOnLeaderboard_C : public UPlayerOnLeaderboardWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class UUIR_SmallText_C*                            Accuracy;                                                   // 0x02B0   (0x0008)  
	class UBorder*                                     Border;                                                     // 0x02B8   (0x0008)  
	class UImage*                                      IsChallengeIcon;                                            // 0x02C0   (0x0008)  
	class UHorizontalBox*                              MainBox;                                                    // 0x02C8   (0x0008)  
	class UPalettedHighlightWidget_C*                  PalettedHighlightWidget;                                    // 0x02D0   (0x0008)  
	class UButton*                                     PlayerButton;                                               // 0x02D8   (0x0008)  
	class UUIR_SmallText_C*                            PlayerName;                                                 // 0x02E0   (0x0008)  
	class UUIR_SmallText_C*                            RankTextBox;                                                // 0x02E8   (0x0008)  
	class UUIR_SmallText_C*                            Score;                                                      // 0x02F0   (0x0008)  
	class UButton*                                     ScoreButton;                                                // 0x02F8   (0x0008)  
	class UBorder*                                     SelectedBorder;                                             // 0x0300   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Set-LeaderboardPopUp
	// void Set_LeaderboardPopUp(class UWidget* InWidget);                                                                      // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Get-LeaderboardPopUp
	// void Get_LeaderboardPopUp(class ULeaderboardEntry_C*& LeaderboardEntryPopUpWidget);                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-KovaakPlus
	// void Update_KovaakPlus();                                                                                                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-PlayerName
	// void Update_PlayerName();                                                                                                // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-Rank
	// void Update_Rank();                                                                                                      // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-Score
	// void Update_Score();                                                                                                     // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-Accuracy
	// void Update_Accuracy();                                                                                                  // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Update-Highlight
	// void Update_Highlight();                                                                                                 // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.Receive_LeaderboardEntryResult_9003ADDE44E314D55C30A99CCC487BF1
	// void Receive_LeaderboardEntryResult_9003ADDE44E314D55C30A99CCC487BF1(FLeaderboardEntryResult& Result);                   // [0x18d2100] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.BndEvt__PlayerButton_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__PlayerButton_K2Node_ComponentBoundEvent_35_OnButtonClickedEvent__DelegateSignature();                       // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.DisplayDataChanged
	// void DisplayDataChanged();                                                                                               // [0x18d2100] Event|Protected|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/PlayerOnLeaderboard.PlayerOnLeaderboard_C.ExecuteUbergraph_PlayerOnLeaderboard
	// void ExecuteUbergraph_PlayerOnLeaderboard(int32_t EntryPoint);                                                           // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/FriendsListPrivatePopUp.FriendsListPrivatePopUp_C
/// Size: 0x0290 (656 bytes) (0x000260 - 0x000290) align 8 MaxSize: 0x0290
class UFriendsListPrivatePopUp_C : public UFriendsListPrivatePopUp
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      DarkScreen;                                                 // 0x0268   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0270   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Okay;                                                       // 0x0278   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0280   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  SteamSettings;                                              // 0x0288   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/FriendsListPrivatePopUp.FriendsListPrivatePopUp_C.BndEvt__PalettedBoxButtonWidget_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__PalettedBoxButtonWidget_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/FriendsListPrivatePopUp.FriendsListPrivatePopUp_C.BndEvt__SteamSettings_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__SteamSettings_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/ScenarioBrowser/Elements/FriendsListPrivatePopUp.FriendsListPrivatePopUp_C.ExecuteUbergraph_FriendsListPrivatePopUp
	// void ExecuteUbergraph_FriendsListPrivatePopUp(int32_t EntryPoint);                                                       // [0x18d2100] Final                
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Anticheat/DisconnectedServicesPopup.DisconnectedServicesPopup_C
/// Size: 0x0288 (648 bytes) (0x000260 - 0x000288) align 8 MaxSize: 0x0288
class UDisconnectedServicesPopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      DarkScreen;                                                 // 0x0268   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0270   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Okay;                                                       // 0x0278   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0280   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Anticheat/DisconnectedServicesPopup.DisconnectedServicesPopup_C.BndEvt__DisconnectedServicesPopup_Okay_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__DisconnectedServicesPopup_Okay_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                 // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Anticheat/DisconnectedServicesPopup.DisconnectedServicesPopup_C.ExecuteUbergraph_DisconnectedServicesPopup
	// void ExecuteUbergraph_DisconnectedServicesPopup(int32_t EntryPoint);                                                     // [0x18d2100] Final                
};

/// Class /Game/FirstPersonBP/Blueprints/UI/DuelsPostConfirmQuit.DuelsPostConfirmQuit_C
/// Size: 0x0300 (768 bytes) (0x000270 - 0x000300) align 8 MaxSize: 0x0300
class UDuelsPostConfirmQuit_C : public UDuelsGameplayTimeoutWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0278   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0280   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0288   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  QuitButton;                                                 // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            Text;                                                       // 0x0298   (0x0008)  
	class UPauseMenu_C*                                PauseMenu;                                                  // 0x02A0   (0x0008)  
	FString                                            Folder;                                                     // 0x02A8   (0x0010)  
	FString                                            Filename;                                                   // 0x02B8   (0x0010)  
	int32_t                                            CmdProcID;                                                  // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02CC   (0x0004)  MISSED
	FText                                              DefaultText;                                                // 0x02D0   (0x0018)  
	FText                                              NoChallengeCompletedText;                                   // 0x02E8   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostConfirmQuit.DuelsPostConfirmQuit_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostConfirmQuit.DuelsPostConfirmQuit_C.BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostConfirmQuit.DuelsPostConfirmQuit_C.OnVisibillityChanged_PostConfirmQuit
	// void OnVisibillityChanged_PostConfirmQuit(ESlateVisibility InVisibility);                                                // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostConfirmQuit.DuelsPostConfirmQuit_C.ExecuteUbergraph_DuelsPostConfirmQuit
	// void ExecuteUbergraph_DuelsPostConfirmQuit(int32_t EntryPoint);                                                          // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C
/// Size: 0x02E4 (740 bytes) (0x000260 - 0x0002E4) align 8 MaxSize: 0x02E4
class UPlayerProfileForLeaderboardEntry_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      Flag;                                                       // 0x0268   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0270   (0x0008)  
	class UImage*                                      PlusIcon;                                                   // 0x0278   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  SteamProfile;                                               // 0x0280   (0x0008)  
	class UImage*                                      SteamProfileImg;                                            // 0x0288   (0x0008)  
	class UUIR_TextBlock_C*                            Username;                                                   // 0x0290   (0x0008)  
	class UUIR_SmallText_C*                            UserRank;                                                   // 0x0298   (0x0008)  
	FUWorksSteamID                                     SteamID;                                                    // 0x02A0   (0x0008)  
	FString                                            Country_Code;                                               // 0x02A8   (0x0010)  
	class UVaRestJsonObject*                           Json;                                                       // 0x02B8   (0x0008)  
	FText                                              SteamName;                                                  // 0x02C0   (0x0018)  
	class UTexture2D*                                  steam_profile_image;                                        // 0x02D8   (0x0008)  
	int32_t                                            retry_wait_for_steam_profile_image;                         // 0x02E0   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Get-ProfileImage
	// void Get_ProfileImage(FUWorksSteamID SteamIDFriend, class UTexture2D*& NewParam);                                        // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Update-Image
	// void Update_Image(class UTexture2D* NewParam);                                                                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.NewFunction
	// void NewFunction();                                                                                                      // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Set-ViewModel
	// void Set_ViewModel(FUWorksSteamID InSteamId, FText InSteamName);                                                         // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.OnFail_3A62565F4C313817559349985C674736
	// void OnFail_3A62565F4C313817559349985C674736(class UTexture2DDynamic* Texture);                                          // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.OnSuccess_3A62565F4C313817559349985C674736
	// void OnSuccess_3A62565F4C313817559349985C674736(class UTexture2DDynamic* Texture);                                       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Receive_ErrorK2_C2E719264F8C6AE28B123CA4DCB385AE
	// void Receive_ErrorK2_C2E719264F8C6AE28B123CA4DCB385AE(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Receive_SuccessK2_C2E719264F8C6AE28B123CA4DCB385AE
	// void Receive_SuccessK2_C2E719264F8C6AE28B123CA4DCB385AE(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Receive_Error_K2_CD9742644BEE22EC734A349890AB422B
	// void Receive_Error_K2_CD9742644BEE22EC734A349890AB422B(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Receive_Success_K2_CD9742644BEE22EC734A349890AB422B
	// void Receive_Success_K2_CD9742644BEE22EC734A349890AB422B(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.get_sa_player_profile
	// void get_sa_player_profile();                                                                                            // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Get Player Flag
	// void GetPlayerFlag();                                                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Parse Response
	// void ParseResponse(FString inString);                                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.BndEvt__PlayerProfileForLeaderboardEntry_SteamProfile_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__PlayerProfileForLeaderboardEntry_SteamProfile_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();  // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Update-View
	// void Update_View();                                                                                                      // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.Receive-PersonaStateChange
	// void Receive_PersonaStateChange(FUWorksSteamID SteamID, TArray<EUWorksPersonaChange>& ChangeFlags);                      // [0x18d2100] HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.OnInitialized
	// void OnInitialized();                                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfileForLeaderboardEntry.PlayerProfileForLeaderboardEntry_C.ExecuteUbergraph_PlayerProfileForLeaderboardEntry
	// void ExecuteUbergraph_PlayerProfileForLeaderboardEntry(int32_t EntryPoint);                                              // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C
/// Size: 0x02C8 (712 bytes) (0x000260 - 0x0002C8) align 8 MaxSize: 0x02C8
class USocials_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Discord;                                                    // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Help;                                                       // 0x0270   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0278   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x0280   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x0288   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x0290   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x0298   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x02A0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  News;                                                       // 0x02A8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Reddit;                                                     // 0x02B0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Twitter;                                                    // 0x02B8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Youtube;                                                    // 0x02C0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__Discord_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__Discord_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__Reddit_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature
	// void BndEvt__Reddit_K2Node_ComponentBoundEvent_4_OnClicked__DelegateSignature();                                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__Twitter_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature
	// void BndEvt__Twitter_K2Node_ComponentBoundEvent_5_OnClicked__DelegateSignature();                                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__Youtube_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature
	// void BndEvt__Youtube_K2Node_ComponentBoundEvent_7_OnClicked__DelegateSignature();                                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__News_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature
	// void BndEvt__News_K2Node_ComponentBoundEvent_20_OnClicked__DelegateSignature();                                          // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.BndEvt__Help_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature
	// void BndEvt__Help_K2Node_ComponentBoundEvent_21_OnClicked__DelegateSignature();                                          // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Socials.Socials_C.ExecuteUbergraph_Socials
	// void ExecuteUbergraph_Socials(int32_t EntryPoint);                                                                       // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Palette/PalettedBorderFlatTopWidget.PalettedBorderFlatTopWidget_C
/// Size: 0x0278 (632 bytes) (0x000270 - 0x000278) align 8 MaxSize: 0x0278
class UPalettedBorderFlatTopWidget_C : public UPalettedBorderWidgetNative
{ 
public:
	class UNamedSlot*                                  ContentsSlot;                                               // 0x0270   (0x0008)  
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C
/// Size: 0x02A8 (680 bytes) (0x000260 - 0x0002A8) align 8 MaxSize: 0x02A8
class UPlayerProfile_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      Flag;                                                       // 0x0268   (0x0008)  
	class UImage*                                      PlusIcon;                                                   // 0x0270   (0x0008)  
	class UImage*                                      SteamProfileImg;                                            // 0x0278   (0x0008)  
	class UUIR_TextBlock_C*                            Username;                                                   // 0x0280   (0x0008)  
	FUWorksSteamID                                     SteamID;                                                    // 0x0288   (0x0008)  
	FString                                            Country_Code;                                               // 0x0290   (0x0010)  
	class UVaRestJsonObject*                           Json;                                                       // 0x02A0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.OnFail_EE67B81840E98D84952F0BABB4A085CD
	// void OnFail_EE67B81840E98D84952F0BABB4A085CD(class UTexture2DDynamic* Texture);                                          // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.OnSuccess_EE67B81840E98D84952F0BABB4A085CD
	// void OnSuccess_EE67B81840E98D84952F0BABB4A085CD(class UTexture2DDynamic* Texture);                                       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Receive_ErrorK2_BD697A854663DC140AD8C0907EB71319
	// void Receive_ErrorK2_BD697A854663DC140AD8C0907EB71319(FString ResponseContents, int32_t ResponseCode);                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Receive_SuccessK2_BD697A854663DC140AD8C0907EB71319
	// void Receive_SuccessK2_BD697A854663DC140AD8C0907EB71319(FString ResponseContents, int32_t ResponseCode);                 // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Receive_Error_K2_EDD0312544D78CB9661698B9E762307C
	// void Receive_Error_K2_EDD0312544D78CB9661698B9E762307C(FString SteamAuthToken, EUWorksResult SteamServerResult);         // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Receive_Success_K2_EDD0312544D78CB9661698B9E762307C
	// void Receive_Success_K2_EDD0312544D78CB9661698B9E762307C(FString SteamAuthToken, EUWorksResult SteamServerResult);       // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.get_sa_player_profile
	// void get_sa_player_profile();                                                                                            // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Get Player Flag
	// void GetPlayerFlag();                                                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Parse Response
	// void ParseResponse(FString inString);                                                                                    // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/PlayerProfile.PlayerProfile_C.ExecuteUbergraph_PlayerProfile
	// void ExecuteUbergraph_PlayerProfile(int32_t EntryPoint);                                                                 // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C
/// Size: 0x05B8 (1464 bytes) (0x0002A8 - 0x0005B8) align 8 MaxSize: 0x05B8
class ULeaderboardEntry_C : public UTemporaryUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x02A8   (0x0008)  
	class UUIR_TextBlock_C*                            AccuracyValue;                                              // 0x02B0   (0x0008)  
	class UUIR_TextBlock_C*                            AverageFPSValue;                                            // 0x02B8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  Cancel;                                                     // 0x02C0   (0x0008)  
	class UUIR_TextBlock_C*                            CM360Value;                                                 // 0x02C8   (0x0008)  
	class UHorizontalBox*                              CuboidOverride;                                             // 0x02D0   (0x0008)  
	class UBorder*                                     CylinderOverride;                                           // 0x02D8   (0x0008)  
	class UUIR_TextBlock_C*                            DateValue;                                                  // 0x02E0   (0x0008)  
	class UUIR_TextBlock_C*                            FovValue;                                                   // 0x02E8   (0x0008)  
	class UUIR_TextBlock_C*                            GameVersion;                                                // 0x02F0   (0x0008)  
	class UUIR_TextBlock_C*                            ModelOverridesCubeValue;                                    // 0x02F8   (0x0008)  
	class UUIR_TextBlock_C*                            ModelOverridesCylinderValue;                                // 0x0300   (0x0008)  
	class UUIR_TextBlock_C*                            ModelOverridesSphereValue;                                  // 0x0308   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0310   (0x0008)  
	class UUIR_TextBlock_C*                            PercentileValue;                                            // 0x0318   (0x0008)  
	class UPlayerProfileForLeaderboardEntry_C*         PlayerProfileForLeaderboardEntry;                           // 0x0320   (0x0008)  
	class UHorizontalBox*                              RandomizerInterval;                                         // 0x0328   (0x0008)  
	class UUIR_TextBlock_C*                            RandomizerIntervalValue;                                    // 0x0330   (0x0008)  
	class UBorder*                                     RandomizerRange;                                            // 0x0338   (0x0008)  
	class UUIR_TextBlock_C*                            RandomizerRangeValue;                                       // 0x0340   (0x0008)  
	class UUIR_TextBlock_C*                            RankValue;                                                  // 0x0348   (0x0008)  
	class UUIR_TextBlock_C*                            ResolutionValue;                                            // 0x0350   (0x0008)  
	class UUIR_TextBlock_C*                            ScenarioName;                                               // 0x0358   (0x0008)  
	class UUIR_TextBlock_C*                            ScoreValue;                                                 // 0x0360   (0x0008)  
	class UUIR_TextBlock_C*                            SensValue;                                                  // 0x0368   (0x0008)  
	class UBorder*                                     SpheroidOverride;                                           // 0x0370   (0x0008)  
	class UUIR_TextBlock_C*                            TimePausedValue;                                            // 0x0378   (0x0008)  
	class UUIR_TextBlock_C*                            TTKValue;                                                   // 0x0380   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x0388   (0x0008)  
	class UInputSound_C*                               ParentSoundWidget;                                          // 0x0390   (0x0008)  
	class UAudioComponent*                             TestSound;                                                  // 0x0398   (0x0008)  
	TArray<FString>                                    SoundFiles;                                                 // 0x03A0   (0x0010)  
	FLeaderboardEntryViewModel                         ViewModel;                                                  // 0x03B0   (0x01E0)  
	bool                                               IsDragging;                                                 // 0x0590   (0x0001)  
	unsigned char                                      UnknownData00_6[0x3];                                       // 0x0591   (0x0003)  MISSED
	FVector2D                                          OriginalMousePosition;                                      // 0x0594   (0x0008)  
	bool                                               IgnoreNext;                                                 // 0x059C   (0x0001)  
	unsigned char                                      UnknownData01_6[0x3];                                       // 0x059D   (0x0003)  MISSED
	FVector2D                                          OriginalWidgetPosition;                                     // 0x05A0   (0x0008)  
	FVector2D                                          MouseOffset__Viewport_;                                     // 0x05A8   (0x0008)  
	FVector2D                                          MouseInitial__Absolute_;                                    // 0x05B0   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.FilterText
	// void FilterText(FText InText, bool UseDashes, FText& OutText);                                                           // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.OnDragCancelled
	// void OnDragCancelled(FPointerEvent& PointerEvent, class UDragDropOperation* Operation);                                  // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.OnDragDetected
	// void OnDragDetected(FGeometry MyGeometry, FPointerEvent& PointerEvent, class UDragDropOperation*& Operation);            // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.OnMouseButtonDown
	// FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                          // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.Get-MousePosition (Viewport)
	// FVector2D Get_MousePosition_Viewport_();                                                                                 // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.Update- View
	// void Update_View();                                                                                                      // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.PopulateSounds
	// void PopulateSounds();                                                                                                   // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.GetSounds
	// void GetSounds();                                                                                                        // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.MessageFromButton
	// void MessageFromButton(FText Message, int32_t Number, FString Extension, class UObject* data);                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.DraggingRemoveSelf
	// void DraggingRemoveSelf();                                                                                               // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.OnInitialized
	// void OnInitialized();                                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.Receive_Resume
	// void Receive_Resume();                                                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.BndEvt__LeaderboardEntry_Cancel_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__LeaderboardEntry_Cancel_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/LeaderboardEntry.LeaderboardEntry_C.ExecuteUbergraph_LeaderboardEntry
	// void ExecuteUbergraph_LeaderboardEntry(int32_t EntryPoint);                                                              // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C
/// Size: 0x02D0 (720 bytes) (0x000260 - 0x0002D0) align 8 MaxSize: 0x02D0
class UInputGameModeDropdown_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_ComboWidget_C*                          DropdownEntry;                                              // 0x0268   (0x0008)  
	class UHorizontalBox*                              FullWidgetBox;                                              // 0x0270   (0x0008)  
	class ANewCharacterPlayerController_C*             PlayerCont;                                                 // 0x0278   (0x0008)  
	SDK_UNDEFINED(16,672) /* FMulticastInlineDelegate */ __um(ValueChanged);                                       // 0x0280   (0x0010)  
	TArray<FString>                                    Entries;                                                    // 0x0290   (0x0010)  
	FText                                              TooltipDesc;                                                // 0x02A0   (0x0018)  
	FText                                              MainText;                                                   // 0x02B8   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.Get_TextDesc_Text
	// FText Get_TextDesc_Text();                                                                                               // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.Get_ViewModelSkinBox_Visibility
	// ESlateVisibility Get_ViewModelSkinBox_Visibility();                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.SetData
	// void SetData(FString DropdownEntry);                                                                                     // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.GetData
	// void GetData(FString& DropdownEntry);                                                                                    // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.FillEntries
	// void FillEntries();                                                                                                      // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.BndEvt__InputDropdown_DropdownEntry_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature
	// void BndEvt__InputDropdown_DropdownEntry_K2Node_ComponentBoundEvent_2_OnSelectionChanged__DelegateSignature(FString SelectedItem, TEnumAsByte<ESelectInfo> SelectionType); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.ExecuteUbergraph_InputGameModeDropdown
	// void ExecuteUbergraph_InputGameModeDropdown(int32_t EntryPoint);                                                         // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/BasicElements/InputGameModeDropdown.InputGameModeDropdown_C.ValueChanged__DelegateSignature
	// void ValueChanged__DelegateSignature(FString SelectedItem);                                                              // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/DuelsPostChallengeReturnToLobby.DuelsPostChallengeReturnToLobby_C
/// Size: 0x0300 (768 bytes) (0x000270 - 0x000300) align 8 MaxSize: 0x0300
class UDuelsPostChallengeReturnToLobby_C : public UDuelsGameplayTimeoutWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0278   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0280   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0288   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  QuitButton;                                                 // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            Text;                                                       // 0x0298   (0x0008)  
	class UPauseMenu_C*                                PauseMenu;                                                  // 0x02A0   (0x0008)  
	FString                                            Folder;                                                     // 0x02A8   (0x0010)  
	FString                                            Filename;                                                   // 0x02B8   (0x0010)  
	int32_t                                            CmdProcID;                                                  // 0x02C8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02CC   (0x0004)  MISSED
	FText                                              DefaultText;                                                // 0x02D0   (0x0018)  
	FText                                              NoChallengeCompletedText;                                   // 0x02E8   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostChallengeReturnToLobby.DuelsPostChallengeReturnToLobby_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostChallengeReturnToLobby.DuelsPostChallengeReturnToLobby_C.BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostChallengeReturnToLobby.DuelsPostChallengeReturnToLobby_C.OnVisibilityChanged_PostChallenge
	// void OnVisibilityChanged_PostChallenge(ESlateVisibility InVisibility);                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/DuelsPostChallengeReturnToLobby.DuelsPostChallengeReturnToLobby_C.ExecuteUbergraph_DuelsPostChallengeReturnToLobby
	// void ExecuteUbergraph_DuelsPostChallengeReturnToLobby(int32_t EntryPoint);                                               // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/ConfirmQuit.ConfirmQuit_C
/// Size: 0x02CC (716 bytes) (0x000260 - 0x0002CC) align 8 MaxSize: 0x02CC
class UConfirmQuit_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  CancelBtn;                                                  // 0x0268   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0270   (0x0008)  
	class UUIR_SmallText_C*                            MainText;                                                   // 0x0278   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0280   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  QuitButton;                                                 // 0x0288   (0x0008)  
	class UUIR_TextBlock_C*                            Text;                                                       // 0x0290   (0x0008)  
	class UUIR_TextBlock_C*                            UIR_TextBlock_C;                                            // 0x0298   (0x0008)  
	class UPauseMenu_C*                                PauseMenu;                                                  // 0x02A0   (0x0008)  
	FString                                            Folder;                                                     // 0x02A8   (0x0010)  
	FString                                            Filename;                                                   // 0x02B8   (0x0010)  
	int32_t                                            CmdProcID;                                                  // 0x02C8   (0x0004)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/ConfirmQuit.ConfirmQuit_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/ConfirmQuit.ConfirmQuit_C.BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__ConfirmQuit_QuitButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                         // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/ConfirmQuit.ConfirmQuit_C.BndEvt__ConfirmQuit_CancelBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__ConfirmQuit_CancelBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                          // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/ConfirmQuit.ConfirmQuit_C.ExecuteUbergraph_ConfirmQuit
	// void ExecuteUbergraph_ConfirmQuit(int32_t EntryPoint);                                                                   // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Playlists/DraggableScenarioOfPlaylist.DraggableScenarioOfPlaylist_C
/// Size: 0x0290 (656 bytes) (0x000260 - 0x000290) align 8 MaxSize: 0x0290
class UDraggableScenarioOfPlaylist_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UDarkendBorderBackground_C*                  EvenBorder;                                                 // 0x0268   (0x0008)  
	class UBoxBorder_C*                                HighlightedBorder;                                          // 0x0270   (0x0008)  
	class UUIR_SmallText_C*                            ScenarioText;                                               // 0x0278   (0x0008)  
	FString                                            ScenarioName;                                               // 0x0280   (0x0010)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/DraggableScenarioOfPlaylist.DraggableScenarioOfPlaylist_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/DraggableScenarioOfPlaylist.DraggableScenarioOfPlaylist_C.ExecuteUbergraph_DraggableScenarioOfPlaylist
	// void ExecuteUbergraph_DraggableScenarioOfPlaylist(int32_t EntryPoint);                                                   // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C
/// Size: 0x02D4 (724 bytes) (0x000260 - 0x0002D4) align 8 MaxSize: 0x02D4
class UUIR_ImageButtonWidget_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_BoxButton_C*                            Button;                                                     // 0x0268   (0x0008)  
	class UImage*                                      ButtonImage;                                                // 0x0270   (0x0008)  
	SDK_UNDEFINED(16,673) /* FMulticastInlineDelegate */ __um(Button_Click);                                       // 0x0278   (0x0010)  
	class UTexture2D*                                  Image;                                                      // 0x0288   (0x0008)  
	FMargin                                            ImagePadding;                                               // 0x0290   (0x0010)  
	FSlateColor                                        ImageTint;                                                  // 0x02A0   (0x0028)  
	float                                              ImageAngle;                                                 // 0x02C8   (0x0004)  
	FVector2D                                          ImageScale;                                                 // 0x02CC   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.SetImageTint
	// void SetImageTint(FSlateColor newTint);                                                                                  // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.Set Image
	// void SetImage();                                                                                                         // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.BndEvt__UIR_Button_C_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__UIR_Button_C_0_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                      // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.ExecuteUbergraph_UIR_ImageButtonWidget
	// void ExecuteUbergraph_UIR_ImageButtonWidget(int32_t EntryPoint);                                                         // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Interactables/UIR_ImageButtonWidget.UIR_ImageButtonWidget_C.Button Click__DelegateSignature
	// void ButtonClick__DelegateSignature();                                                                                   // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C
/// Size: 0x0369 (873 bytes) (0x000270 - 0x000369) align 8 MaxSize: 0x0369
class UScenarioInPlaylist_C : public UScenarioInPlaylistWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UButton*                                     BackgroundButton;                                           // 0x0278   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              CopyBtn;                                                    // 0x0280   (0x0008)  
	class UBorder*                                     Drop_Indicator_Bottom;                                      // 0x0288   (0x0008)  
	class UBorder*                                     Drop_Indicator_TOP;                                         // 0x0290   (0x0008)  
	class UHorizontalBox*                              EditingBox1;                                                // 0x0298   (0x0008)  
	class UHorizontalBox*                              EditingBox2;                                                // 0x02A0   (0x0008)  
	class UHorizontalBox*                              EditingBox3;                                                // 0x02A8   (0x0008)  
	class UDarkendBorderBackground_C*                  EvenBorder;                                                 // 0x02B0   (0x0008)  
	class UBoxBorder_C*                                HighlightedBorder;                                          // 0x02B8   (0x0008)  
	class UHorizontalBox*                              HorizontalBox;                                              // 0x02C0   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02C8   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02D0   (0x0008)  
	class UImage*                                      Image1;                                                     // 0x02D8   (0x0008)  
	class UImage*                                      Image2;                                                     // 0x02E0   (0x0008)  
	class UImage*                                      Image3;                                                     // 0x02E8   (0x0008)  
	class UImage*                                      Image4;                                                     // 0x02F0   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              MinusBtn;                                                   // 0x02F8   (0x0008)  
	class UHorizontalBox*                              OptionsBox;                                                 // 0x0300   (0x0008)  
	class UTextBlock*                                  PlayCountText;                                              // 0x0308   (0x0008)  
	class UUIR_SmallButtonTrim_C*                      PlayCountTrim;                                              // 0x0310   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              PlusBtn;                                                    // 0x0318   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              RemoveScenarioBtn;                                          // 0x0320   (0x0008)  
	class UUIR_SmallText_C*                            ScenarioText;                                               // 0x0328   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              SortDownBtn;                                                // 0x0330   (0x0008)  
	class UPalettedRoundedButtonWidget_C*              SortUpBtn;                                                  // 0x0338   (0x0008)  
	class UObject*                                     ListItemObject;                                             // 0x0340   (0x0008)  
	SDK_UNDEFINED(16,674) /* FMulticastInlineDelegate */ __um(OnNonRandomPlayingDoubleClick);                      // 0x0348   (0x0010)  
	bool                                               DragDropEnabled;                                            // 0x0358   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0359   (0x0007)  MISSED
	class UDragDropOperation*                          Operation;                                                  // 0x0360   (0x0008)  
	bool                                               DraggedOnTop;                                               // 0x0368   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDoneDraggingThisWidget
	// void OnDoneDraggingThisWidget();                                                                                         // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnStartedDraggingThisWidget
	// void OnStartedDraggingThisWidget();                                                                                      // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.HighlightDropIdicator
	// void HighlightDropIdicator(bool Reset, bool Top);                                                                        // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDrop
	// bool OnDrop(FGeometry MyGeometry, FPointerEvent PointerEvent, class UDragDropOperation* Operation);                      // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDragOver
	// bool OnDragOver(FGeometry MyGeometry, FPointerEvent PointerEvent, class UDragDropOperation* Operation);                  // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDragDetected
	// void OnDragDetected(FGeometry MyGeometry, FPointerEvent& PointerEvent, class UDragDropOperation*& Operation);            // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnMouseButtonDown
	// FEventReply OnMouseButtonDown(FGeometry MyGeometry, FPointerEvent& MouseEvent);                                          // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.RefreshPlayCount
	// void RefreshPlayCount();                                                                                                 // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.ConstructFromListItem
	// void ConstructFromListItem();                                                                                            // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.GetListItemObject
	// class UObject* GetListItemObject();                                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.On_HighlightBorder_MouseDoubleClick
	// FEventReply On_HighlightBorder_MouseDoubleClick(FGeometry MyGeometry, FPointerEvent& MouseEvent);                        // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.Get_BackgroundButton_Visibility
	// ESlateVisibility Get_BackgroundButton_Visibility();                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.RefreshEvensBackground
	// void RefreshEvensBackground();                                                                                           // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.RefreshEditingMode
	// void RefreshEditingMode();                                                                                               // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.RefreshBackgroundColors
	// void RefreshBackgroundColors();                                                                                          // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x18d2100] Event|Protected|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_2_K2Node_ComponentBoundEvent_0_OnButtonClickedEvent__DelegateSignature();                            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__SortUpBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__SortUpBtn_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                                      // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__SortDownBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__SortDownBtn_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                    // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__MinusBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature
	// void BndEvt__MinusBtn_K2Node_ComponentBoundEvent_2_OnClicked__DelegateSignature();                                       // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__PlusBtn_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature
	// void BndEvt__PlusBtn_K2Node_ComponentBoundEvent_11_OnClicked__DelegateSignature();                                       // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__CopyBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature
	// void BndEvt__CopyBtn_K2Node_ComponentBoundEvent_3_OnClicked__DelegateSignature();                                        // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.BndEvt__RemoveScenarioBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature
	// void BndEvt__RemoveScenarioBtn_K2Node_ComponentBoundEvent_14_OnClicked__DelegateSignature();                             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnClickedScenario
	// void OnClickedScenario();                                                                                                // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.PlayCountChanged
	// void PlayCountChanged();                                                                                                 // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.PlaylistPlayingStatusChanged
	// void PlaylistPlayingStatusChanged();                                                                                     // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.PlaylistSlectedScenarioChanged
	// void PlaylistSlectedScenarioChanged(int32_t NewScenarioIndex);                                                           // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.PlaylistEditStarted
	// void PlaylistEditStarted();                                                                                              // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.PlaylistEditEnded
	// void PlaylistEditEnded();                                                                                                // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.Destruct
	// void Destruct();                                                                                                         // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDragLeave
	// void OnDragLeave(FPointerEvent PointerEvent, class UDragDropOperation* Operation);                                       // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnDragCancelled
	// void OnDragCancelled(FPointerEvent& PointerEvent, class UDragDropOperation* Operation);                                  // [0x18d2100] BlueprintCosmetic|Event|Public|HasOutParms|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.ExecuteUbergraph_ScenarioInPlaylist
	// void ExecuteUbergraph_ScenarioInPlaylist(int32_t EntryPoint);                                                            // [0x18d2100] Final|HasDefaults    
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/ScenarioInPlaylist.ScenarioInPlaylist_C.OnNonRandomPlayingDoubleClick__DelegateSignature
	// void OnNonRandomPlayingDoubleClick__DelegateSignature();                                                                 // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C
/// Size: 0x0289 (649 bytes) (0x000260 - 0x000289) align 8 MaxSize: 0x0289
class URandomizeSelector_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UImage*                                      CurrentImage;                                               // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PalettedBoxButtonWidget;                                    // 0x0270   (0x0008)  
	SDK_UNDEFINED(16,675) /* FMulticastInlineDelegate */ __um(OnSelectionChanged);                                 // 0x0278   (0x0010)  
	ERandomizePlaylistTypes                            CurrentType;                                                // 0x0288   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.SetImageAndTooltip
	// void SetImageAndTooltip();                                                                                               // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.SetSelectedType
	// void SetSelectedType(ERandomizePlaylistTypes NewType);                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.PreConstruct
	// void PreConstruct(bool IsDesignTime);                                                                                    // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.BndEvt__RandomizeSelector_PalettedBoxButtonWidget_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__RandomizeSelector_PalettedBoxButtonWidget_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();      // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.ExecuteUbergraph_RandomizeSelector
	// void ExecuteUbergraph_RandomizeSelector(int32_t EntryPoint);                                                             // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/RandomizeSelector.RandomizeSelector_C.OnSelectionChanged__DelegateSignature
	// void OnSelectionChanged__DelegateSignature(ERandomizePlaylistTypes SelectedType);                                        // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/GameUI/ButtonSelector.ButtonSelector_C
/// Size: 0x02B0 (688 bytes) (0x0002B0 - 0x0002B0) align 8 MaxSize: 0x02B0
class UButtonSelector_C : public UButtonSelectorWidget
{ 
public:
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/Borders/UIR_BGHeaderBorder.UIR_BGHeaderBorder_C
/// Size: 0x0270 (624 bytes) (0x000270 - 0x000270) align 8 MaxSize: 0x0270
class UUIR_BGHeaderBorder_C : public UBorder
{ 
public:
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C
/// Size: 0x0310 (784 bytes) (0x000270 - 0x000310) align 8 MaxSize: 0x0310
class UOnlinePlaylistInBrowser_C : public UOnlinePlaylistInBrowserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0270   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  DownloadButton;                                             // 0x0278   (0x0008)  
	class UBorder*                                     DownloadNotificatio;                                        // 0x0280   (0x0008)  
	class UBorder*                                     EvenItemsBorder;                                            // 0x0288   (0x0008)  
	class UFavoriteIcon_C*                             FavoriteIcon_ui;                                            // 0x0290   (0x0008)  
	class UUIR_BGInnerBorder_C*                        HightlightedBorder;                                         // 0x0298   (0x0008)  
	class UImage*                                      Image;                                                      // 0x02A0   (0x0008)  
	class UImage*                                      Image0;                                                     // 0x02A8   (0x0008)  
	class UButton*                                     MouseoverHighlight;                                         // 0x02B0   (0x0008)  
	class UBorder*                                     NameTitleBorder;                                            // 0x02B8   (0x0008)  
	class UUIR_SmallText_C*                            PlaylistAuthor;                                             // 0x02C0   (0x0008)  
	class UButton*                                     PlaylistDetailsHover;                                       // 0x02C8   (0x0008)  
	class UUIR_SmallText_C*                            PlaylistNameText;                                           // 0x02D0   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  PlayPlaylistButton;                                         // 0x02D8   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  RemoveButton;                                               // 0x02E0   (0x0008)  
	class UButton*                                     SelectButton;                                               // 0x02E8   (0x0008)  
	class USizeBox*                                    TrashIconSizebox;                                           // 0x02F0   (0x0008)  
	int32_t                                            Index;                                                      // 0x02F8   (0x0004)  
	unsigned char                                      UnknownData00_6[0x4];                                       // 0x02FC   (0x0004)  MISSED
	class UObject*                                     ListItemObject;                                             // 0x0300   (0x0008)  
	class UScenarioBrowser_C*                          ScenarioBrowser;                                            // 0x0308   (0x0008)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.SetAuthorName
	// void SetAuthorName();                                                                                                    // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.On_HightlightedBorder_MouseDoubleClick
	// FEventReply On_HightlightedBorder_MouseDoubleClick(FGeometry MyGeometry, FPointerEvent& MouseEvent);                     // [0x18d2100] Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.Get_DownloadButton_bIsEnabled
	// bool Get_DownloadButton_bIsEnabled();                                                                                    // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.RefreshSelection
	// void RefreshSelection();                                                                                                 // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.ConstructFromListObject
	// void ConstructFromListObject(bool DarkBackground);                                                                       // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.GetListItemObject
	// class UObject* GetListItemObject();                                                                                      // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure|Const 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.UpdatePlayButton
	// void UpdatePlayButton();                                                                                                 // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.SetPlaylistName
	// void SetPlaylistName();                                                                                                  // [0x18d2100] Public|HasDefaults|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.UpdateDownloadButtonUI
	// void UpdateDownloadButtonUI();                                                                                           // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.OnListItemObjectSet
	// void OnListItemObjectSet(class UObject* ListItemObject);                                                                 // [0x18d2100] Event|Protected|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__FavoriteIcon_54_K2Node_ComponentBoundEvent_3_StarClicked__DelegateSignature
	// void BndEvt__FavoriteIcon_54_K2Node_ComponentBoundEvent_3_StarClicked__DelegateSignature(bool IsFavorite);               // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature
	// void BndEvt__Button_0_K2Node_ComponentBoundEvent_4_OnButtonClickedEvent__DelegateSignature();                            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__PlayPlaylistButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__PlayPlaylistButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();                             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__OnlinePlaylistInBrowser_CloseButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__OnlinePlaylistInBrowser_CloseButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();            // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__OnlinePlaylistInBrowser_RemoveButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__OnlinePlaylistInBrowser_RemoveButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();           // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__OnlinePlaylistInBrowser_PlaylistDetailsHover_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__OnlinePlaylistInBrowser_PlaylistDetailsHover_K2Node_ComponentBoundEvent_5_OnButtonHoverEvent__DelegateSignature(); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.PlayPlaylist
	// void PlayPlaylist();                                                                                                     // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.DoubleClickPlaylist
	// void DoubleClickPlaylist();                                                                                              // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__OnlinePlaylistInBrowser_MouseoverHighlight_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__OnlinePlaylistInBrowser_MouseoverHighlight_K2Node_ComponentBoundEvent_6_OnButtonHoverEvent__DelegateSignature(); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.BndEvt__OnlinePlaylistInBrowser_MouseoverHighlight_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature
	// void BndEvt__OnlinePlaylistInBrowser_MouseoverHighlight_K2Node_ComponentBoundEvent_7_OnButtonHoverEvent__DelegateSignature(); // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.HighlightOwner
	// void HighlightOwner();                                                                                                   // [0x18d2100] BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.PlaylistDeSelected
	// void PlaylistDeSelected();                                                                                               // [0x18d2100] Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistInBrowser.OnlinePlaylistInBrowser_C.ExecuteUbergraph_OnlinePlaylistInBrowser
	// void ExecuteUbergraph_OnlinePlaylistInBrowser(int32_t EntryPoint);                                                       // [0x18d2100] Final|HasDefaults    
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C
/// Size: 0x02F1 (753 bytes) (0x000260 - 0x0002F1) align 8 MaxSize: 0x02F1
class UUIR_RetryPopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UUIR_SmallText_C*                            CommonText1;                                                // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  OkayButton;                                                 // 0x0270   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0278   (0x0008)  
	class UPalettedTextWidget_C*                       SpecificText;                                               // 0x0280   (0x0008)  
	class UDraggableHeaderBar_C*                       TitleText;                                                  // 0x0288   (0x0008)  
	class UUIR_TextBlock_C*                            UploadButtonText;                                           // 0x0290   (0x0008)  
	SDK_UNDEFINED(16,676) /* FMulticastInlineDelegate */ __um(CalledOkay);                                         // 0x0298   (0x0010)  
	FText                                              SpecificTextCached;                                         // 0x02A8   (0x0018)  
	FText                                              TitleCached;                                                // 0x02C0   (0x0018)  
	FText                                              CommonTextCached;                                           // 0x02D8   (0x0018)  
	bool                                               DontHideOnOkay;                                             // 0x02F0   (0x0001)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.EnableOkButton
	// void EnableOkButton(bool Enable);                                                                                        // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.RefreshUIData
	// void RefreshUIData();                                                                                                    // [0x18d2100] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.SetContent
	// void SetContent(FText Title, FText CommonText, FText SpecificText);                                                      // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                     // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.ExecuteUbergraph_UIR_RetryPopup
	// void ExecuteUbergraph_UIR_RetryPopup(int32_t EntryPoint);                                                                // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_RetryPopup.UIR_RetryPopup_C.CalledOkay__DelegateSignature
	// void CalledOkay__DelegateSignature();                                                                                    // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C
/// Size: 0x0320 (800 bytes) (0x000260 - 0x000320) align 8 MaxSize: 0x0320
class UUIR_ActionMessagepopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  ActionButton;                                               // 0x0268   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  CloseButton;                                                // 0x0270   (0x0008)  
	class UUIR_SmallText_C*                            CommonText1;                                                // 0x0278   (0x0008)  
	class UImage*                                      Image;                                                      // 0x0280   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0288   (0x0008)  
	class UPalettedTextWidget_C*                       SpecificText;                                               // 0x0290   (0x0008)  
	class UDraggableHeaderBar_C*                       TitleText;                                                  // 0x0298   (0x0008)  
	class UUIR_TextBlock_C*                            UploadButtonText;                                           // 0x02A0   (0x0008)  
	SDK_UNDEFINED(16,677) /* FMulticastInlineDelegate */ __um(CalledAction);                                       // 0x02A8   (0x0010)  
	FText                                              SpecificTextCached;                                         // 0x02B8   (0x0018)  
	FText                                              TitleCached;                                                // 0x02D0   (0x0018)  
	FText                                              CommonTextCached;                                           // 0x02E8   (0x0018)  
	bool                                               PerformAction;                                              // 0x0300   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0301   (0x0007)  MISSED
	FText                                              TextButtonName;                                             // 0x0308   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.Get_UploadButtonText_Text
	// FText Get_UploadButtonText_Text();                                                                                       // [0x18d2100] Public|HasOutParms|BlueprintCallable|BlueprintEvent|BlueprintPure 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.EnableOkButton
	// void EnableOkButton(bool Enable);                                                                                        // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.RefreshUIData
	// void RefreshUIData();                                                                                                    // [0x18d2100] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.SetContent
	// void SetContent(FText Title, FText CommonText, FText SpecificText, FText ButtonName, bool PerfromAction);                // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                     // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.BndEvt__UIR_ActionMessagepopup_CloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature
	// void BndEvt__UIR_ActionMessagepopup_CloseButton_K2Node_ComponentBoundEvent_0_OnClicked__DelegateSignature();             // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.ExecuteUbergraph_UIR_ActionMessagepopup
	// void ExecuteUbergraph_UIR_ActionMessagepopup(int32_t EntryPoint);                                                        // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_ActionMessagepopup.UIR_ActionMessagepopup_C.CalledAction__DelegateSignature
	// void CalledAction__DelegateSignature();                                                                                  // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/Playlists/OnlinePlaylistListViewItemObject.OnlinePlaylistListViewItemObject_C
/// Size: 0x0031 (49 bytes) (0x000028 - 0x000031) align 8 MaxSize: 0x0031
class UOnlinePlaylistListViewItemObject_C : public UObject
{ 
public:
	class UOnlinePlaylist*                             Playlist;                                                   // 0x0028   (0x0008)  
	bool                                               DarkBackground;                                             // 0x0030   (0x0001)  
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C
/// Size: 0x02F0 (752 bytes) (0x000260 - 0x0002F0) align 8 MaxSize: 0x02F0
class UUIR_SelectableTextPopup_C : public UUserWidget
{ 
public:
	FPointerToUberGraphFrame                           UberGraphFrame;                                             // 0x0260   (0x0008)  
	class UDraggableHeaderBar_C*                       DraggableHeaderBar;                                         // 0x0268   (0x0008)  
	class UUIR_SmallText_C*                            messageText;                                                // 0x0270   (0x0008)  
	class UPalettedBoxButtonWidget_C*                  OkayButton;                                                 // 0x0278   (0x0008)  
	class UPalettedBorderWidget_C*                     PalettedBorderWidget;                                       // 0x0280   (0x0008)  
	class UEditableTextBox*                            ShareCodeText;                                              // 0x0288   (0x0008)  
	class UUIR_TextBlock_C*                            UploadButtonText;                                           // 0x0290   (0x0008)  
	SDK_UNDEFINED(16,678) /* FMulticastInlineDelegate */ __um(CalledOkay);                                         // 0x0298   (0x0010)  
	FText                                              Selectable_Text;                                            // 0x02A8   (0x0018)  
	FText                                              Title;                                                      // 0x02C0   (0x0018)  
	FText                                              Message;                                                    // 0x02D8   (0x0018)  


	/// Functions
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.RefreshUIData
	// void RefreshUIData();                                                                                                    // [0x18d2100] Private|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.SetContent
	// void SetContent(FText Title, FText Message, FText SelectableTextMsg);                                                    // [0x18d2100] Public|BlueprintCallable|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.Construct
	// void Construct();                                                                                                        // [0x18d2100] BlueprintCosmetic|Event|Public|BlueprintEvent 
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature
	// void BndEvt__OkayButton_K2Node_ComponentBoundEvent_1_OnClicked__DelegateSignature();                                     // [0x18d2100] BlueprintEvent       
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.ExecuteUbergraph_UIR_SelectableTextPopup
	// void ExecuteUbergraph_UIR_SelectableTextPopup(int32_t EntryPoint);                                                       // [0x18d2100] Final                
	// Function /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_SelectableTextPopup.UIR_SelectableTextPopup_C.CalledOkay__DelegateSignature
	// void CalledOkay__DelegateSignature();                                                                                    // [0x18d2100] Public|Delegate|BlueprintCallable|BlueprintEvent 
};

/// Class /Game/FirstPersonBP/Blueprints/UI/UIR_BuildingBlocks/UIR_CommonMessagePopup.UIR_CommonMessagePopup_C
/// Size: 0x02F1 (753 bytes) (0x000260 - 0x0002F1) align 8 MaxSize: 0x02F1
