
/********************************************************
*                                                       *
*   Package generated using UEDumper by Spuckwaffel.    *
*                                                       *
********************************************************/

#pragma once
/// dependency: BasicType
/// dependency: CoreUObject
/// dependency: Engine
/// dependency: SlateCore
/// dependency: UMG

#pragma pack(push, 0x1)

/// Enum /Script/XsollaUIBuilder.EBrushThemeType
/// Size: 0x01 (1 bytes)
enum class EBrushThemeType : uint8_t
{
	BrushType_Default                                                                = 0,
	BrushType1                                                                       = 1,
	BrushType2                                                                       = 2,
	BrushType3                                                                       = 3,
	BrushType4                                                                       = 4,
	BrushType5                                                                       = 5,
	BrushType6                                                                       = 6,
	BrushType7                                                                       = 7,
	BrushType8                                                                       = 8,
	BrushType9                                                                       = 9,
	BrushType10                                                                      = 10,
	BrushType11                                                                      = 11,
	BrushType12                                                                      = 12,
	BrushType13                                                                      = 13,
	BrushType14                                                                      = 14,
	BrushType15                                                                      = 15,
	BrushType16                                                                      = 16,
	BrushType17                                                                      = 17,
	BrushType18                                                                      = 18,
	BrushType19                                                                      = 19,
	BrushType20                                                                      = 20,
	BrushType21                                                                      = 21,
	BrushType22                                                                      = 22,
	BrushType23                                                                      = 23,
	BrushType24                                                                      = 24,
	BrushType25                                                                      = 25,
	BrushType26                                                                      = 26,
	BrushType27                                                                      = 27,
	BrushType28                                                                      = 28,
	BrushType29                                                                      = 29,
	BrushType30                                                                      = 30,
	BrushType31                                                                      = 31,
	BrushType32                                                                      = 32,
	BrushType33                                                                      = 33,
	BrushType34                                                                      = 34,
	BrushType35                                                                      = 35,
	BrushType36                                                                      = 36,
	BrushType37                                                                      = 37,
	BrushType38                                                                      = 38,
	BrushType39                                                                      = 39,
	BrushType40                                                                      = 40,
	BrushType41                                                                      = 41,
	BrushType42                                                                      = 42,
	BrushType43                                                                      = 43,
	BrushType44                                                                      = 44,
	BrushType45                                                                      = 45,
	BrushType46                                                                      = 46,
	BrushType47                                                                      = 47,
	BrushType48                                                                      = 48,
	BrushType49                                                                      = 49,
	BrushType50                                                                      = 50,
	BrushType51                                                                      = 51,
	BrushType52                                                                      = 52,
	BrushType53                                                                      = 53,
	BrushType54                                                                      = 54,
	BrushType55                                                                      = 55,
	BrushType56                                                                      = 56,
	BrushType57                                                                      = 57,
	BrushType58                                                                      = 58,
	BrushType59                                                                      = 59,
	BrushType60                                                                      = 60,
	BrushType61                                                                      = 61,
	BrushType62                                                                      = 62,
	BrushType_Max                                                                    = 63
};

/// Enum /Script/XsollaUIBuilder.EFontType
/// Size: 0x01 (1 bytes)
enum class EFontType : uint8_t
{
	FontType_Default                                                                 = 0,
	FontType1                                                                        = 1,
	FontType2                                                                        = 2,
	FontType3                                                                        = 3,
	FontType4                                                                        = 4,
	FontType5                                                                        = 5,
	FontType6                                                                        = 6,
	FontType7                                                                        = 7,
	FontType8                                                                        = 8,
	FontType9                                                                        = 9,
	FontType10                                                                       = 10,
	FontType11                                                                       = 11,
	FontType12                                                                       = 12,
	FontType13                                                                       = 13,
	FontType14                                                                       = 14,
	FontType15                                                                       = 15,
	FontType16                                                                       = 16,
	FontType17                                                                       = 17,
	FontType18                                                                       = 18,
	FontType19                                                                       = 19,
	FontType20                                                                       = 20,
	FontType21                                                                       = 21,
	FontType22                                                                       = 22,
	FontType23                                                                       = 23,
	FontType24                                                                       = 24,
	FontType25                                                                       = 25,
	FontType26                                                                       = 26,
	FontType27                                                                       = 27,
	FontType28                                                                       = 28,
	FontType29                                                                       = 29,
	FontType30                                                                       = 30,
	FontType_Max                                                                     = 31
};

/// Enum /Script/XsollaUIBuilder.EColorType
/// Size: 0x01 (1 bytes)
enum class EColorType : uint8_t
{
	ColorType_Default                                                                = 0,
	ColorType1                                                                       = 1,
	ColorType2                                                                       = 2,
	ColorType3                                                                       = 3,
	ColorType4                                                                       = 4,
	ColorType5                                                                       = 5,
	ColorType6                                                                       = 6,
	ColorType7                                                                       = 7,
	ColorType8                                                                       = 8,
	ColorType9                                                                       = 9,
	ColorType10                                                                      = 10,
	ColorType11                                                                      = 11,
	ColorType12                                                                      = 12,
	ColorType13                                                                      = 13,
	ColorType14                                                                      = 14,
	ColorType15                                                                      = 15,
	ColorType16                                                                      = 16,
	ColorType17                                                                      = 17,
	ColorType18                                                                      = 18,
	ColorType19                                                                      = 19,
	ColorType20                                                                      = 20,
	ColorType21                                                                      = 21,
	ColorType22                                                                      = 22,
	ColorType23                                                                      = 23,
	ColorType24                                                                      = 24,
	ColorType25                                                                      = 25,
	ColorType26                                                                      = 26,
	ColorType27                                                                      = 27,
	ColorType28                                                                      = 28,
	ColorType29                                                                      = 29,
	ColorType30                                                                      = 30,
	ColorType_Max                                                                    = 31
};

/// Enum /Script/XsollaUIBuilder.EWidgetType
/// Size: 0x01 (1 bytes)
enum class EWidgetType : uint8_t
{
	WidgetType_Default                                                               = 0,
	WidgetType1                                                                      = 1,
	WidgetType2                                                                      = 2,
	WidgetType3                                                                      = 3,
	WidgetType4                                                                      = 4,
	WidgetType5                                                                      = 5,
	WidgetType6                                                                      = 6,
	WidgetType7                                                                      = 7,
	WidgetType8                                                                      = 8,
	WidgetType9                                                                      = 9,
	WidgetType10                                                                     = 10,
	WidgetType11                                                                     = 11,
	WidgetType12                                                                     = 12,
	WidgetType13                                                                     = 13,
	WidgetType14                                                                     = 14,
	WidgetType15                                                                     = 15,
	WidgetType16                                                                     = 16,
	WidgetType17                                                                     = 17,
	WidgetType18                                                                     = 18,
	WidgetType19                                                                     = 19,
	WidgetType20                                                                     = 20,
	WidgetType21                                                                     = 21,
	WidgetType22                                                                     = 22,
	WidgetType23                                                                     = 23,
	WidgetType24                                                                     = 24,
	WidgetType25                                                                     = 25,
	WidgetType26                                                                     = 26,
	WidgetType27                                                                     = 27,
	WidgetType28                                                                     = 28,
	WidgetType29                                                                     = 29,
	WidgetType30                                                                     = 30,
	WidgetType_Max                                                                   = 31
};

/// Class /Script/XsollaUIBuilder.XsollaGenericPrimitive
/// Size: 0x0260 (608 bytes) (0x000260 - 0x000260) align 8 MaxSize: 0x0260
class UXsollaGenericPrimitive : public UUserWidget
{ 
public:
};

/// Struct /Script/XsollaUIBuilder.ThemeParameters
/// Size: 0x00F0 (240 bytes) (0x000000 - 0x0000F0) align 8 MaxSize: 0x00F0
struct FThemeParameters
{ 
	SDK_UNDEFINED(80,811) /* TMap<FString, TEnumAsByte<EColorType>> */ __um(Colors);                               // 0x0000   (0x0050)  
	SDK_UNDEFINED(80,812) /* TMap<FString, TEnumAsByte<EFontType>> */ __um(Fonts);                                 // 0x0050   (0x0050)  
	SDK_UNDEFINED(80,813) /* TMap<FString, TEnumAsByte<EBrushThemeType>> */ __um(Brushes);                         // 0x00A0   (0x0050)  
};

/// Class /Script/XsollaUIBuilder.XsollaGenericWrapper
/// Size: 0x0370 (880 bytes) (0x000260 - 0x000370) align 8 MaxSize: 0x0370
class UXsollaGenericWrapper : public UUserWidget
{ 
public:
	TEnumAsByte<EWidgetType>                           WidgetLibraryType;                                          // 0x0260   (0x0001)  
	unsigned char                                      UnknownData00_6[0x7];                                       // 0x0261   (0x0007)  MISSED
	class UClass*                                      OverrideWidget;                                             // 0x0268   (0x0008)  
	bool                                               OverrideDefaultTheme;                                       // 0x0270   (0x0001)  
	unsigned char                                      UnknownData01_6[0x7];                                       // 0x0271   (0x0007)  MISSED
	class UClass*                                      Theme;                                                      // 0x0278   (0x0008)  
	FThemeParameters                                   Parameters;                                                 // 0x0280   (0x00F0)  


	/// Functions
	// Function /Script/XsollaUIBuilder.XsollaGenericWrapper.UpdateWrapperTheme
	// void UpdateWrapperTheme();                                                                                               // [0x18d2100] Event|Public|BlueprintCallable|BlueprintEvent 
	// Function /Script/XsollaUIBuilder.XsollaGenericWrapper.UpdateThemeParameters
	// void UpdateThemeParameters(FThemeParameters& InParameters);                                                              // [0xc1f230] Final|Native|Public|HasOutParms|BlueprintCallable 
	// Function /Script/XsollaUIBuilder.XsollaGenericWrapper.ThemeUpdated
	// void ThemeUpdated(class UClass* NewTheme);                                                                               // [0xc1f110] Final|Native|Protected 
	// Function /Script/XsollaUIBuilder.XsollaGenericWrapper.GetWidgetClass
	// class UClass* GetWidgetClass();                                                                                          // [0xc1ee60] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/XsollaUIBuilder.XsollaUIBuilderLibrary
/// Size: 0x0028 (40 bytes) (0x000028 - 0x000028) align 8 MaxSize: 0x0028
class UXsollaUIBuilderLibrary : public UBlueprintFunctionLibrary
{ 
public:


	/// Functions
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.IsEmpty
	// bool IsEmpty(FThemeParameters& Parameters);                                                                              // [0xc1ef30] Final|Native|Static|Public|HasOutParms|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.GetWidgetsLibrary
	// class UXsollaUIBuilderWidgetsLibrary* GetWidgetsLibrary(class UClass* WidgetLibraryClass);                               // [0xc1eea0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.GetUIBuilderSettings
	// class UXsollaUIBuilderSettings* GetUIBuilderSettings();                                                                  // [0xc1ed90] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.GetTheme
	// class UXsollaUIBuilderTheme* GetTheme(class UClass* ThemeClass);                                                         // [0xc1ed00] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.GetCurrentWidgetsLibrary
	// class UXsollaUIBuilderWidgetsLibrary* GetCurrentWidgetsLibrary();                                                        // [0xc1eb00] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.GetCurrentTheme
	// class UXsollaUIBuilderTheme* GetCurrentTheme();                                                                          // [0xc1ead0] Final|Native|Static|Public|BlueprintCallable|BlueprintPure 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderLibrary.Clear
	// void Clear(FThemeParameters& Parameters);                                                                                // [0xc1e6a0] Final|Native|Static|Public|HasOutParms|BlueprintCallable 
};

/// Struct /Script/XsollaUIBuilder.EntityTypeName
/// Size: 0x000C (12 bytes) (0x000000 - 0x00000C) align 4 MaxSize: 0x000C
struct FEntityTypeName
{ 
	int32_t                                            TypeAsInt;                                                  // 0x0000   (0x0004)  
	FName                                              Name;                                                       // 0x0004   (0x0008)  
};

/// Class /Script/XsollaUIBuilder.XsollaUIBuilderSettings
/// Size: 0x0088 (136 bytes) (0x000028 - 0x000088) align 8 MaxSize: 0x0088
class UXsollaUIBuilderSettings : public UObject
{ 
public:
	SDK_UNDEFINED(16,814) /* FMulticastInlineDelegate */ __um(ThemeChanged);                                       // 0x0028   (0x0010)  
	TArray<FEntityTypeName>                            WidgetTypes;                                                // 0x0038   (0x0010)  
	TArray<FEntityTypeName>                            ColorTypes;                                                 // 0x0048   (0x0010)  
	TArray<FEntityTypeName>                            FontTypes;                                                  // 0x0058   (0x0010)  
	TArray<FEntityTypeName>                            BrushTypes;                                                 // 0x0068   (0x0010)  
	class UClass*                                      InterfaceTheme;                                             // 0x0078   (0x0008)  
	class UClass*                                      WidgetsLibrary;                                             // 0x0080   (0x0008)  


	/// Functions
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderSettings.UpdateTheme
	// void UpdateTheme(class UClass* NewTheme);                                                                                // [0xc1f1a0] Final|Native|Public|BlueprintCallable 
};

/// Class /Script/XsollaUIBuilder.XsollaUIBuilderTheme
/// Size: 0x0118 (280 bytes) (0x000028 - 0x000118) align 8 MaxSize: 0x0118
class UXsollaUIBuilderTheme : public UObject
{ 
public:
	SDK_UNDEFINED(80,815) /* TMap<TEnumAsByte<EColorType>, FColor> */ __um(ColorsMap);                             // 0x0028   (0x0050)  
	SDK_UNDEFINED(80,816) /* TMap<TEnumAsByte<EFontType>, FSlateFontInfo> */ __um(FontsMap);                       // 0x0078   (0x0050)  
	SDK_UNDEFINED(80,817) /* TMap<TEnumAsByte<EBrushThemeType>, FSlateBrush> */ __um(BrushesMap);                  // 0x00C8   (0x0050)  


	/// Functions
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderTheme.GetFontByType
	// FSlateFontInfo GetFontByType(TEnumAsByte<EFontType> FontType, bool& bIsFound);                                           // [0xc1eb30] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderTheme.GetColorByType
	// FColor GetColorByType(TEnumAsByte<EColorType> colorType, bool& bIsFound);                                                // [0xc1e9f0] Final|Native|Public|HasOutParms|HasDefaults|BlueprintCallable|BlueprintPure|Const 
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderTheme.GetBrushByType
	// FSlateBrush GetBrushByType(TEnumAsByte<EBrushThemeType> BrushType, bool& bIsFound);                                      // [0xc1e880] Final|Native|Public|HasOutParms|BlueprintCallable|BlueprintPure|Const 
};

/// Class /Script/XsollaUIBuilder.XsollaUIBuilderWidgetsLibrary
/// Size: 0x0078 (120 bytes) (0x000028 - 0x000078) align 8 MaxSize: 0x0078
class UXsollaUIBuilderWidgetsLibrary : public UObject
{ 
public:
	SDK_UNDEFINED(80,818) /* TMap<TEnumAsByte<EWidgetType>, class UClass*> */ __um(Widgets);                       // 0x0028   (0x0050)  


	/// Functions
	// Function /Script/XsollaUIBuilder.XsollaUIBuilderWidgetsLibrary.GetWidgetByType
	// class UClass* GetWidgetByType(TEnumAsByte<EWidgetType> WidgetType);                                                      // [0xc1edc0] Final|Native|Public|BlueprintCallable|BlueprintPure|Const 
};

#pragma pack(pop)


static_assert(sizeof(UXsollaGenericPrimitive) == 0x0260); // 608 bytes (0x000260 - 0x000260)
static_assert(sizeof(FThemeParameters) == 0x00F0); // 240 bytes (0x000000 - 0x0000F0)
static_assert(sizeof(UXsollaGenericWrapper) == 0x0370); // 880 bytes (0x000260 - 0x000370)
static_assert(sizeof(UXsollaUIBuilderLibrary) == 0x0028); // 40 bytes (0x000028 - 0x000028)
static_assert(sizeof(FEntityTypeName) == 0x000C); // 12 bytes (0x000000 - 0x00000C)
static_assert(sizeof(UXsollaUIBuilderSettings) == 0x0088); // 136 bytes (0x000028 - 0x000088)
static_assert(sizeof(UXsollaUIBuilderTheme) == 0x0118); // 280 bytes (0x000028 - 0x000118)
static_assert(sizeof(UXsollaUIBuilderWidgetsLibrary) == 0x0078); // 120 bytes (0x000028 - 0x000078)
static_assert(offsetof(UXsollaGenericWrapper, WidgetLibraryType) == 0x0260);
static_assert(offsetof(UXsollaGenericWrapper, OverrideWidget) == 0x0268);
static_assert(offsetof(UXsollaGenericWrapper, Theme) == 0x0278);
static_assert(offsetof(UXsollaGenericWrapper, Parameters) == 0x0280);
static_assert(offsetof(FEntityTypeName, Name) == 0x0004);
static_assert(offsetof(UXsollaUIBuilderSettings, WidgetTypes) == 0x0038);
static_assert(offsetof(UXsollaUIBuilderSettings, ColorTypes) == 0x0048);
static_assert(offsetof(UXsollaUIBuilderSettings, FontTypes) == 0x0058);
static_assert(offsetof(UXsollaUIBuilderSettings, BrushTypes) == 0x0068);
static_assert(offsetof(UXsollaUIBuilderSettings, InterfaceTheme) == 0x0078);
static_assert(offsetof(UXsollaUIBuilderSettings, WidgetsLibrary) == 0x0080);
